// type： 1 正品，2 伪品
const source_file_paths = [
  {
    dir: "一枝黄花",
    files: [
      {
        path: "一枝黄花/010_一枝黄花植物.jpg",
        type: [1],
      },
      {
        path: "一枝黄花/030_一枝黄花药材.jpg",
        type: [1],
      },
      {
        path: "一枝黄花/050_一枝黄花药材.jpg",
        type: [1],
      },
      {
        path: "一枝黄花/070_一枝黄花性状.jpg",
        type: [1],
      },
      {
        path: "一枝黄花/090_一枝黄花（左）；加拿大一枝黄花（右）植株对比.jpg",
        type: [1],
      },
      {
        path: "一枝黄花/110_一枝黄花（左）；加拿大一枝黄花花序（右）对比.jpg",
        type: [1],
      },
      {
        path: "一枝黄花/130_加拿大一枝黄花（上）和一枝黄花（下）茎枝对比.jpg",
        type: [1],
      },
      {
        path: "一枝黄花/150_加拿大一枝黄花和一枝黄花叶形对比.jpg",
        type: [1],
      },
      {
        path: "一枝黄花/170_枝黄花和加拿大一枝黄花；头状花序对比.jpg",
        type: [1],
      },
      {
        path: "一枝黄花/190_两者种子放大后对比.jpg",
        type: [1],
      },
      {
        path: "一枝黄花/210_一枝黄花（左）和加拿大一枝黄花（右）饮片对比.jpg",
        type: [1],
      },
      {
        path: "一枝黄花/230_一枝黄花饮片.jpg",
        type: [1],
      },
      {
        path: "一枝黄花/250_一枝黄花饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "丁公藤",
    files: [
      {
        path: "丁公藤/010_丁公藤植物.jpg",
        type: [1],
      },
      {
        path: "丁公藤/030_光叶丁公藤植物.jpg",
        type: [1],
      },
      {
        path: "丁公藤/050_丁公藤.jpg",
        type: [1],
      },
      {
        path: "丁公藤/070_丁公藤.jpg",
        type: [1],
      },
      {
        path: "丁公藤/090_丁公藤伪品_红叶藤_瘤枝微花藤_小花青藤.jpg",
        type: [1],
      },
      {
        path: "丁公藤/110_丁公藤伪品_百眼藤_青江藤_假丁公藤.jpg",
        type: [1],
      },
      {
        path: "丁公藤/130_丁公藤.jpg",
        type: [1],
      },
      {
        path: "丁公藤/150_雷公藤.jpg",
        type: [1],
      },
      {
        path: "丁公藤/170_丁公藤饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "丁香",
    files: [
      {
        path: "丁香/010_丁香植物.jpg",
        type: [1],
      },
      {
        path: "丁香/030_丁香花蕾.jpg",
        type: [1],
      },
      {
        path: "丁香/050_丁香药材.jpg",
        type: [1],
      },
      {
        path: "丁香/070_丁香性状鉴别.jpg",
        type: [1],
      },
      {
        path: "丁香/090_丁香伪品：肉桂子.jpg",
        type: [1],
      },
      {
        path: "丁香/110_丁香伪品：肉桂叶柄.jpg",
        type: [1],
      },
      {
        path: "丁香/130_丁香新货与陈货对比.jpg",
        type: [1],
      },
      {
        path: "丁香/150_母丁香成熟果实.jpg",
        type: [1],
      },
      {
        path: "丁香/170_母丁香药材.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "三七",
    files: [
      {
        path: "三七/000_止血药_三七.jpg",
        type: [1],
      },
      {
        path: "三七/010_三七人工种植.jpg",
        type: [1],
      },
      {
        path: "三七/030_三七原植物.jpg",
        type: [1],
      },
      {
        path: "三七/050_三七头子.jpg",
        type: [1],
      },
      {
        path: "三七/070_三七筋条.jpg",
        type: [1],
      },
      {
        path: "三七/090_三七剪口.jpg",
        type: [1],
      },
      {
        path: "三七/110_三七尾.jpg",
        type: [1],
      },
      {
        path: "三七/130_三七植株全图.jpg",
        type: [1],
      },
      {
        path: "三七/150_三七药材.jpg",
        type: [1],
      },
      {
        path: "三七/170_带帽七（主根及根茎）.jpg",
        type: [1],
      },
      {
        path: "三七/190_剪口（根茎）.jpg",
        type: [1],
      },
      {
        path: "三七/210_筋条（支根）.jpg",
        type: [1],
      },
      {
        path: "三七/230_三七绒须（须根）.jpg",
        type: [1],
      },
      {
        path: "三七/250_春七与冬七.jpg",
        type: [1],
      },
      {
        path: "三七/270_三七切片.jpg",
        type: [1],
      },
      {
        path: "三七/290_三七的性状鉴别.jpg",
        type: [1],
      },
      {
        path: "三七/310_莪术.jpg",
        type: [1],
      },
      {
        path: "三七/330_藤三七.jpg",
        type: [1],
      },
      {
        path: "三七/350_白及.jpg",
        type: [1],
      },
      {
        path: "三七/370_裂果薯.jpg",
        type: [1],
      },
      {
        path: "三七/390_木薯加工品.jpg",
        type: [1],
      },
      {
        path: "三七/410_菊三七.jpg",
        type: [1],
      },
      {
        path: "三七/430_珠子参.jpg",
        type: [1],
      },
      {
        path: "三七/450_竹节参.jpg",
        type: [1],
      },
      {
        path: "三七/470_峨参.jpg",
        type: [1],
      },
      {
        path: "三七/490_白及.jpg",
        type: [1],
      },
      {
        path: "三七/510_菊三七.jpg",
        type: [1],
      },
      {
        path: "三七/530_峨参.jpg",
        type: [1],
      },
      {
        path: "三七/550_广西莪术.jpg",
        type: [1],
      },
      {
        path: "三七/570_姜黄.jpg",
        type: [1],
      },
      {
        path: "三七/590_蓬莪术.jpg",
        type: [1],
      },
      {
        path: "三七/610_温郁金.jpg",
        type: [1],
      },
      {
        path: "三七/630_竹切参.jpg",
        type: [1],
      },
      {
        path: "三七/650_用莪术加工的仿制品.jpg",
        type: [1],
      },
      {
        path: "三七/670_用木薯加工的仿制品.jpg",
        type: [1],
      },
      {
        path: "三七/690_三七粉.jpg",
        type: [1],
      },
      {
        path: "三七/710_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "三丫苦",
    files: [
      {
        path: "三丫苦/010_三桠苦.jpg",
        type: [1],
      },
      {
        path: "三丫苦/030_三桠苦.jpg",
        type: [1],
      },
      {
        path: "三丫苦/050_三丫苦药材.jpg",
        type: [1],
      },
      {
        path: "三丫苦/070_三丫苦药材.jpg",
        type: [1],
      },
      {
        path: "三丫苦/090_三丫苦药材.jpg",
        type: [1],
      },
      {
        path: "三丫苦/110_三丫苦药材.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "三棱",
    files: [
      {
        path: "三棱/010_黑三棱.jpg",
        type: [1],
      },
      {
        path: "三棱/030_三棱药材.jpg",
        type: [1],
      },
      {
        path: "三棱/050_三棱药材.jpg",
        type: [1],
      },
      {
        path: "三棱/070_三棱.jpg",
        type: [1],
      },
      {
        path: "三棱/090_三棱性状鉴别.jpg",
        type: [1],
      },
      {
        path: "三棱/110_三棱.jpg",
        type: [1],
      },
      {
        path: "三棱/130_泡三棱.jpg",
        type: [1],
      },
      {
        path: "三棱/150_三棱饮片.jpg",
        type: [1],
      },
      {
        path: "三棱/170_醋三棱饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "三白草",
    files: [
      {
        path: "三白草/010_三白草植物.jpg",
        type: [1],
      },
      {
        path: "三白草/030_三白草饮片.jpg",
        type: [1],
      },
      {
        path: "三白草/050_三白草饮片.jpg",
        type: [1],
      },
      {
        path: "三白草/070_三白草性状.jpg",
        type: [1],
      },
      {
        path: "三白草/090_三白草药材.jpg",
        type: [1],
      },
      {
        path: "三白草/110_三白草茎叶.jpg",
        type: [1],
      },
      {
        path: "三白草/130_三白草根.jpg",
        type: [1],
      },
      {
        path: "三白草/150_三白草饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "三颗针",
    files: [
      {
        path: "三颗针/010_拟豪猪刺植物.jpg",
        type: [1],
      },
      {
        path: "三颗针/030_细叶小檗植物.jpg",
        type: [1],
      },
      {
        path: "三颗针/050_三颗针.jpg",
        type: [1],
      },
      {
        path: "三颗针/070_三颗针.jpg",
        type: [1],
      },
      {
        path: "三颗针/090_三颗针.jpg",
        type: [1],
      },
      {
        path: "三颗针/110_三颗针.jpg",
        type: [1],
      },
      {
        path: "三颗针/130_三颗针.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "丝瓜络",
    files: [
      {
        path: "丝瓜络/010_丝瓜植物.jpg",
        type: [1],
      },
      {
        path: "丝瓜络/030_丝瓜络药材.jpg",
        type: [1],
      },
      {
        path: "丝瓜络/050_丝瓜络.jpg",
        type: [1],
      },
      {
        path: "丝瓜络/070_丝瓜络性状鉴别.jpg",
        type: [1],
      },
      {
        path: "丝瓜络/090_粤丝瓜络.jpg",
        type: [1],
      },
      {
        path: "丝瓜络/110_丝瓜络.jpg",
        type: [1],
      },
      {
        path: "丝瓜络/130_粤丝瓜络.jpg",
        type: [1],
      },
      {
        path: "丝瓜络/150_丝瓜络饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "两头尖",
    files: [
      {
        path: "两头尖/010_多被银莲花.jpg",
        type: [1],
      },
      {
        path: "两头尖/030_两头尖药材.jpg",
        type: [1],
      },
      {
        path: "两头尖/050_两头尖.jpg",
        type: [1],
      },
      {
        path: "两头尖/070_两头尖.jpg",
        type: [1],
      },
      {
        path: "两头尖/090_两头尖.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "两面针",
    files: [
      {
        path: "两面针/010_两面针植物.jpg",
        type: [1],
      },
      {
        path: "两面针/030_两面针药材.jpg",
        type: [1],
      },
      {
        path: "两面针/050_两面针药材.jpg",
        type: [1],
      },
      {
        path: "两面针/070_两面针饮片.jpg",
        type: [1],
      },
      {
        path: "两面针/090_两面针饮片.jpg",
        type: [1],
      },
      {
        path: "两面针/110_两面针.jpg",
        type: [1],
      },
      {
        path: "两面针/130_两面针.jpg",
        type: [1],
      },
      {
        path: "两面针/150_两面针性状鉴别.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "丹参",
    files: [
      {
        path: "丹参/000_活血药_丹参.jpg",
        type: [1],
      },
      {
        path: "丹参/000_活血药_丹参2.jpg",
        type: [1],
      },
      {
        path: "丹参/010_丹参植物.jpg",
        type: [1],
      },
      {
        path: "丹参/030_丹参药材.jpg",
        type: [1],
      },
      {
        path: "丹参/050_丹参性状鉴别.jpg",
        type: [1],
      },
      {
        path: "丹参/070_丹参饮片.jpg",
        type: [1],
      },
      {
        path: "丹参/090_酒丹参饮片.jpg",
        type: [1],
      },
      {
        path: "丹参/110_甘西鼠尾.jpg",
        type: [2],
      },
      {
        path: "丹参/130_滇丹参.jpg",
        type: [2],
      },
      {
        path: "丹参/150_云南鼠尾草（滇丹参）.jpg",
        type: [2],
      },
      {
        path: "丹参/170_牛蒡根染色伪充丹参.jpg",
        type: [2],
      },
      {
        path: "丹参/190_褐毛甘西鼠尾.jpg",
        type: [2],
      },
      {
        path: "丹参/210_滇丹参.jpg",
        type: [2],
      },
      {
        path: "丹参/230_拟丹参.jpg",
        type: [2],
      },
      {
        path: "丹参/250_毛地黄鼠尾.jpg",
        type: [2],
      },
      {
        path: "丹参/270_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "丹雄鸡",
    files: [
      {
        path: "丹雄鸡/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "乌梅",
    files: [
      {
        path: "乌梅/000_收涩药_乌梅.jpg",
        type: [1],
      },
      {
        path: "乌梅/010_梅植物.jpg",
        type: [1],
      },
      {
        path: "乌梅/030_乌梅药材.jpg",
        type: [1],
      },
      {
        path: "乌梅/050_乌梅.jpg",
        type: [1],
      },
      {
        path: "乌梅/070_乌梅核.jpg",
        type: [1],
      },
      {
        path: "乌梅/090_乌梅性状鉴别.jpg",
        type: [1],
      },
      {
        path: "乌梅/110_杏.jpg",
        type: [1],
      },
      {
        path: "乌梅/130_山杏.jpg",
        type: [1],
      },
      {
        path: "乌梅/150_乌梅核的图片.jpg",
        type: [1],
      },
      {
        path: "乌梅/170_乌梅之混淆品——桃果核.jpg",
        type: [1],
      },
      {
        path: "乌梅/190_乌梅之混淆品——杏果核.jpg",
        type: [1],
      },
      {
        path: "乌梅/210_乌梅肉.jpg",
        type: [1],
      },
      {
        path: "乌梅/230_乌梅炭.jpg",
        type: [1],
      },
      {
        path: "乌梅/250_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "乌梢蛇",
    files: [
      {
        path: "乌梢蛇/010_乌梢蛇.jpg",
        type: [1],
      },
      {
        path: "乌梢蛇/030_乌梢蛇药材.jpg",
        type: [1],
      },
      {
        path: "乌梢蛇/050_乌梢蛇性状鉴别.jpg",
        type: [1],
      },
      {
        path: "乌梢蛇/070_饮片拼接品--皮下胶粘的痕迹.jpg",
        type: [1],
      },
      {
        path: "乌梢蛇/090_饮片未去除内脏或人为增重.jpg",
        type: [1],
      },
      {
        path: "乌梢蛇/110_乌梢蛇（接头换面，不协调）.jpg",
        type: [1],
      },
      {
        path: "乌梢蛇/130_乌梢蛇肉.jpg",
        type: [1],
      },
      {
        path: "乌梢蛇/150_酒乌梢蛇.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "乌药",
    files: [
      {
        path: "乌药/010_乌药植物.jpg",
        type: [1],
      },
      {
        path: "乌药/030_乌药药材.jpg",
        type: [1],
      },
      {
        path: "乌药/050_乌药.jpg",
        type: [1],
      },
      {
        path: "乌药/070_乌药饮片.jpg",
        type: [1],
      },
      {
        path: "乌药/090_乌药.jpg",
        type: [1],
      },
      {
        path: "乌药/110_乌药性状鉴别.jpg",
        type: [1],
      },
      {
        path: "乌药/130_乌药伪品：地上枝.jpg",
        type: [1],
      },
      {
        path: "乌药/150_乌药伪品：桃树枝.jpg",
        type: [1],
      },
      {
        path: "乌药/170_乌药饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "乌贼鱼骨",
    files: [
      {
        path: "乌贼鱼骨/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "乌韭",
    files: [
      {
        path: "乌韭/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "九节菖蒲",
    files: [
      {
        path: "九节菖蒲/000_开窍药_石菖蒲.jpg",
        type: [1],
      },
      {
        path: "九节菖蒲/000_开窍药_石菖蒲2.jpg",
        type: [1],
      },
      {
        path: "九节菖蒲/010_阿尔泰银莲花.jpg",
        type: [1],
      },
      {
        path: "九节菖蒲/030_九节菖蒲药材.jpg",
        type: [1],
      },
      {
        path: "九节菖蒲/050_九节菖蒲.jpg",
        type: [1],
      },
      {
        path: "九节菖蒲/070_九节菖蒲.jpg",
        type: [1],
      },
      {
        path: "九节菖蒲/090_九节菖蒲伪品.jpg",
        type: [2],
      },
      {
        path: "九节菖蒲/110_九节菖蒲伪品.jpg",
        type: [2],
      },
      {
        path: "九节菖蒲/130_九节菖蒲掺杂.jpg",
        type: [1],
      },
      {
        path: "九节菖蒲/150_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "九里香",
    files: [
      {
        path: "九里香/010_九里香.jpg",
        type: [1],
      },
      {
        path: "九里香/030_千里香.jpg",
        type: [1],
      },
      {
        path: "九里香/050_九里香药材.jpg",
        type: [1],
      },
      {
        path: "九里香/070_千里香药材.jpg",
        type: [1],
      },
      {
        path: "九里香/090_九里香与千里香叶片比较.jpg",
        type: [1],
      },
      {
        path: "九里香/110_九里香药材.jpg",
        type: [1],
      },
      {
        path: "九里香/130_九里香药材.jpg",
        type: [1],
      },
      {
        path: "九里香/150_九里香性状鉴别.jpg",
        type: [1],
      },
      {
        path: "九里香/170_九里香饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "九香虫",
    files: [
      {
        path: "九香虫/010_九香虫.jpg",
        type: [1],
      },
      {
        path: "九香虫/030_九香虫药材.jpg",
        type: [1],
      },
      {
        path: "九香虫/050_九香虫性状鉴别.jpg",
        type: [1],
      },
      {
        path: "九香虫/070_九香虫及伪品.jpg",
        type: [1],
      },
      {
        path: "九香虫/090_九香虫.jpg",
        type: [1],
      },
      {
        path: "九香虫/110_伪品小皱蝽.jpg",
        type: [1],
      },
      {
        path: "九香虫/130_正品与伪品伪品小皱蝽比较.jpg",
        type: [1],
      },
      {
        path: "九香虫/150_伪品锯齿蝽.jpg",
        type: [1],
      },
      {
        path: "九香虫/170_伪品麻皮椿与正品九香虫.jpg",
        type: [1],
      },
      {
        path: "九香虫/190_炒九香虫.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "乳香",
    files: [
      {
        path: "乳香/000_活血药_乳香.jpg",
        type: [1],
      },
      {
        path: "乳香/010_乳香树植物.jpg",
        type: [1],
      },
      {
        path: "乳香/030_乳香.jpg",
        type: [1],
      },
      {
        path: "乳香/050_乳香药材.jpg",
        type: [1],
      },
      {
        path: "乳香/070_乳香.jpg",
        type: [1],
      },
      {
        path: "乳香/090_乳香性状鉴别.jpg",
        type: [1],
      },
      {
        path: "乳香/110_乳香掺有树皮.jpg",
        type: [1],
      },
      {
        path: "乳香/130_醋乳香.jpg",
        type: [1],
      },
      {
        path: "乳香/150_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "了哥王",
    files: [
      {
        path: "了哥王/010_了哥王植物.jpg",
        type: [1],
      },
      {
        path: "了哥王/030_了哥王药材.jpg",
        type: [1],
      },
      {
        path: "了哥王/050_了哥王药材.jpg",
        type: [1],
      },
      {
        path: "了哥王/070_了哥王药材.jpg",
        type: [1],
      },
      {
        path: "了哥王/090_了哥王饮片.jpg",
        type: [1],
      },
      {
        path: "了哥王/110_了哥王饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "云实",
    files: [
      {
        path: "云实/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "云母",
    files: [
      {
        path: "云母/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "云芝",
    files: [
      {
        path: "云芝/010_彩绒革盖菌.jpg",
        type: [1],
      },
      {
        path: "云芝/030_彩绒革盖菌.jpg",
        type: [1],
      },
      {
        path: "云芝/050_云芝.jpg",
        type: [1],
      },
      {
        path: "云芝/070_云芝.jpg",
        type: [1],
      },
      {
        path: "云芝/090_云芝.jpg",
        type: [1],
      },
      {
        path: "云芝/110_多种菌类图.jpg",
        type: [1],
      },
      {
        path: "云芝/130_云芝.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "五倍子",
    files: [
      {
        path: "五倍子/010_盐肤木植物及角倍.jpg",
        type: [1],
      },
      {
        path: "五倍子/030_青麸杨植物及肚倍.jpg",
        type: [1],
      },
      {
        path: "五倍子/050_红麸杨.jpg",
        type: [1],
      },
      {
        path: "五倍子/070_肚倍.jpg",
        type: [1],
      },
      {
        path: "五倍子/090_角倍.jpg",
        type: [1],
      },
      {
        path: "五倍子/110_五倍子性状鉴别.jpg",
        type: [1],
      },
      {
        path: "五倍子/130_五倍子性状鉴别.jpg",
        type: [1],
      },
      {
        path: "五倍子/150_五倍子饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "五加皮",
    files: [
      {
        path: "五加皮/000_祛风湿药_五加皮.jpg",
        type: [1],
      },
      {
        path: "五加皮/010_细柱五加植物.jpg",
        type: [1],
      },
      {
        path: "五加皮/030_五加皮药材.jpg",
        type: [1],
      },
      {
        path: "五加皮/050_五加皮.jpg",
        type: [1],
      },
      {
        path: "五加皮/070_五加皮性状鉴别.jpg",
        type: [1],
      },
      {
        path: "五加皮/090_香加皮.jpg",
        type: [2],
      },
      {
        path: "五加皮/110_五加皮与香加皮图.jpg",
        type: [2],
      },
      {
        path: "五加皮/130_伪品红毛五加皮.jpg",
        type: [2],
      },
      {
        path: "五加皮/150_伪品刺五加皮.jpg",
        type: [2],
      },
      {
        path: "五加皮/170_五加皮饮片.jpg",
        type: [1],
      },
      {
        path: "五加皮/190_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "五味子",
    files: [
      {
        path: "五味子/000_收涩药_五味子.jpg",
        type: [1],
      },
      {
        path: "五味子/010_五味子植物.jpg",
        type: [1],
      },
      {
        path: "五味子/030_五味子药材.jpg",
        type: [1],
      },
      {
        path: "五味子/050_五味子性状鉴别.jpg",
        type: [1],
      },
      {
        path: "五味子/070_醋五味子.jpg",
        type: [1],
      },
      {
        path: "五味子/090_华中五味子.jpg",
        type: [1],
      },
      {
        path: "五味子/110_南五味子药材.jpg",
        type: [1],
      },
      {
        path: "五味子/130_南五味子性状鉴别.jpg",
        type: [1],
      },
      {
        path: "五味子/150_醋南五味子.jpg",
        type: [1],
      },
      {
        path: "五味子/170_上北五味子种子，下南五味子种子.jpg",
        type: [1],
      },
      {
        path: "五味子/190_掺伪南五味子样品.jpg",
        type: [1],
      },
      {
        path: "五味子/210_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "五指柑",
    files: [
      {
        path: "五指柑/010_黄荆植物.jpg",
        type: [1],
      },
      {
        path: "五指柑/030_五指柑药材.jpg",
        type: [1],
      },
      {
        path: "五指柑/050_五指柑.jpg",
        type: [1],
      },
      {
        path: "五指柑/070_五指柑.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "五指毛桃",
    files: [
      {
        path: "五指毛桃/010_粗叶榕植物.jpg",
        type: [1],
      },
      {
        path: "五指毛桃/030_五指毛桃药材.jpg",
        type: [1],
      },
      {
        path: "五指毛桃/050_五指毛桃药材.jpg",
        type: [1],
      },
      {
        path: "五指毛桃/070_五指毛桃药材.jpg",
        type: [1],
      },
      {
        path: "五指毛桃/090_五指毛桃药材.jpg",
        type: [1],
      },
      {
        path: "五指毛桃/110_五指毛桃鉴别.jpg",
        type: [1],
      },
      {
        path: "五指毛桃/130_五指毛桃断面鉴别.jpg",
        type: [1],
      },
      {
        path: "五指毛桃/150_断肠草.jpg",
        type: [1],
      },
      {
        path: "五指毛桃/170_断肠草.jpg",
        type: [1],
      },
      {
        path: "五指毛桃/190_断肠草花与金银花.jpg",
        type: [1],
      },
      {
        path: "五指毛桃/210_五指毛桃饮片.jpg",
        type: [1],
      },
      {
        path: "五指毛桃/230_五指毛桃饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "五灵脂",
    files: [
      {
        path: "五灵脂/010_复齿鼯鼠.jpg",
        type: [1],
      },
      {
        path: "五灵脂/030_灵脂块.jpg",
        type: [1],
      },
      {
        path: "五灵脂/050_灵脂米.jpg",
        type: [1],
      },
      {
        path: "五灵脂/070_五灵脂药材.jpg",
        type: [1],
      },
      {
        path: "五灵脂/090_五灵脂药材.jpg",
        type: [1],
      },
      {
        path: "五灵脂/110_属兔粪便.jpg",
        type: [1],
      },
      {
        path: "五灵脂/130_飞鼠粪便.jpg",
        type: [1],
      },
      {
        path: "五灵脂/150_纤维、砂粒伪制品.jpg",
        type: [1],
      },
      {
        path: "五灵脂/170_伪品 砂土伪制品.jpg",
        type: [1],
      },
      {
        path: "五灵脂/190_沥青伪制品.jpg",
        type: [1],
      },
      {
        path: "五灵脂/210_植物种皮伪制品.jpg",
        type: [1],
      },
      {
        path: "五灵脂/230_五灵脂与伪品对比.jpg",
        type: [1],
      },
      {
        path: "五灵脂/250_醋五灵脂.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "亚麻子",
    files: [
      {
        path: "亚麻子/010_亚麻植物.jpg",
        type: [1],
      },
      {
        path: "亚麻子/030_亚麻子药材.jpg",
        type: [1],
      },
      {
        path: "亚麻子/050_亚麻子.jpg",
        type: [1],
      },
      {
        path: "亚麻子/070_亚麻子鉴别.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "京大戟",
    files: [
      {
        path: "京大戟/000_泻下药_京大戟.jpg",
        type: [1],
      },
      {
        path: "京大戟/000_泻下药_京大戟2.jpg",
        type: [1],
      },
      {
        path: "京大戟/010_大戟植物.jpg",
        type: [1],
      },
      {
        path: "京大戟/030_京大戟药材.jpg",
        type: [1],
      },
      {
        path: "京大戟/050_京大戟药材.jpg",
        type: [1],
      },
      {
        path: "京大戟/070_京大戟药材.jpg",
        type: [1],
      },
      {
        path: "京大戟/090_京大戟切片.jpg",
        type: [1],
      },
      {
        path: "京大戟/110_京大戟饮片.jpg",
        type: [1],
      },
      {
        path: "京大戟/130_京大戟.jpg",
        type: [1],
      },
      {
        path: "京大戟/150_京大戟性状鉴别.jpg",
        type: [1],
      },
      {
        path: "京大戟/170_红大戟.jpg",
        type: [1],
      },
      {
        path: "京大戟/190_红大戟.jpg",
        type: [1],
      },
      {
        path: "京大戟/210_草大戟.jpg",
        type: [1],
      },
      {
        path: "京大戟/230_绵大戟.jpg",
        type: [1],
      },
      {
        path: "京大戟/250_京大戟饮片.jpg",
        type: [1],
      },
      {
        path: "京大戟/270_醋京大戟.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "人参",
    files: [
      {
        path: "人参/000_补虚药_人参.jpg",
        type: [1],
      },
      {
        path: "人参/000_补虚药_人参2.jpg",
        type: [1],
      },
      {
        path: "人参/000_补虚药_人参切片.jpg",
        type: [1],
      },
      {
        path: "人参/010_人参原植物.jpg",
        type: [1],
      },
      {
        path: "人参/030_人参植物.jpg",
        type: [1],
      },
      {
        path: "人参/050_园参.jpg",
        type: [1],
      },
      {
        path: "人参/070_林下山参.jpg",
        type: [1],
      },
      {
        path: "人参/090_野山参.jpg",
        type: [1],
      },
      {
        path: "人参/110_人参的鉴别.jpg",
        type: [1],
      },
      {
        path: "人参/130_莨菪.jpg",
        type: [2],
      },
      {
        path: "人参/150_金钱豹.jpg",
        type: [2],
      },
      {
        path: "人参/170_野豇豆.jpg",
        type: [2],
      },
      {
        path: "人参/190_人参片.jpg",
        type: [1],
      },
      {
        path: "人参/210_人参加工规格种类.jpg",
        type: [1],
      },
      {
        path: "人参/230_人参加工炮制品.jpg",
        type: [1],
      },
      {
        path: "人参/250_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "人参叶",
    files: [
      {
        path: "人参叶/010_人参.jpg",
        type: [1],
      },
      {
        path: "人参叶/030_人参叶药材.jpg",
        type: [1],
      },
      {
        path: "人参叶/050_人参叶药材.jpg",
        type: [1],
      },
      {
        path: "人参叶/070_人参叶.jpg",
        type: [1],
      },
      {
        path: "人参叶/090_人参叶性状.jpg",
        type: [1],
      },
      {
        path: "人参叶/110_人参叶.jpg",
        type: [1],
      },
      {
        path: "人参叶/130_人参叶与西洋参叶比较.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "仙茅",
    files: [
      {
        path: "仙茅/010_仙茅植物.jpg",
        type: [1],
      },
      {
        path: "仙茅/030_仙茅药材.jpg",
        type: [1],
      },
      {
        path: "仙茅/050_仙茅性状鉴别.jpg",
        type: [1],
      },
      {
        path: "仙茅/070_铁棒锤.jpg",
        type: [1],
      },
      {
        path: "仙茅/090_伏毛铁棒锤母根.jpg",
        type: [1],
      },
      {
        path: "仙茅/110_不知名的根茎.jpg",
        type: [1],
      },
      {
        path: "仙茅/130_白芍侧根.jpg",
        type: [1],
      },
      {
        path: "仙茅/150_仙茅饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "仙鹤草",
    files: [
      {
        path: "仙鹤草/010_龙芽草.jpg",
        type: [1],
      },
      {
        path: "仙鹤草/030_仙鹤草药材.jpg",
        type: [1],
      },
      {
        path: "仙鹤草/050_仙鹤草药材.jpg",
        type: [1],
      },
      {
        path: "仙鹤草/070_仙鹤草性状鉴别.jpg",
        type: [1],
      },
      {
        path: "仙鹤草/090_仙鹤草饮片.jpg",
        type: [1],
      },
      {
        path: "仙鹤草/110_仙鹤草饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "伊贝母",
    files: [
      {
        path: "伊贝母/010_新疆贝母植物.jpg",
        type: [1],
      },
      {
        path: "伊贝母/030_伊犁贝母植物.jpg",
        type: [1],
      },
      {
        path: "伊贝母/050_新疆贝母药材.jpg",
        type: [1],
      },
      {
        path: "伊贝母/070_伊犁贝母药材.jpg",
        type: [1],
      },
      {
        path: "伊贝母/090_伊犁贝母药材.jpg",
        type: [1],
      },
      {
        path: "伊贝母/110_新疆贝母标本.jpg",
        type: [1],
      },
      {
        path: "伊贝母/130_伊犁贝母标本.jpg",
        type: [1],
      },
      {
        path: "伊贝母/150_新疆贝母.jpg",
        type: [1],
      },
      {
        path: "伊贝母/170_伊犁贝母.jpg",
        type: [1],
      },
      {
        path: "伊贝母/190_伊犁贝母与新疆贝母比较图.jpg",
        type: [1],
      },
      {
        path: "伊贝母/210_五种贝母药材比较.jpg",
        type: [1],
      },
      {
        path: "伊贝母/230_炉贝.jpg",
        type: [1],
      },
      {
        path: "伊贝母/250_炉贝.jpg",
        type: [1],
      },
      {
        path: "伊贝母/270_炉贝.jpg",
        type: [1],
      },
      {
        path: "伊贝母/290_新疆贝母.jpg",
        type: [1],
      },
      {
        path: "伊贝母/310_新疆贝母.jpg",
        type: [1],
      },
      {
        path: "伊贝母/330_伊犁贝母.jpg",
        type: [1],
      },
      {
        path: "伊贝母/350_伊犁贝母.jpg",
        type: [1],
      },
      {
        path: "伊贝母/370_伊犁贝母.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "伏龙肝",
    files: [
      {
        path: "伏龙肝/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "伸筋草",
    files: [
      {
        path: "伸筋草/010_石松.jpg",
        type: [1],
      },
      {
        path: "伸筋草/030_伸筋草药材.jpg",
        type: [1],
      },
      {
        path: "伸筋草/050_伸筋草.jpg",
        type: [1],
      },
      {
        path: "伸筋草/070_伸筋草.jpg",
        type: [1],
      },
      {
        path: "伸筋草/090_伸筋草性状鉴别.jpg",
        type: [1],
      },
      {
        path: "伸筋草/110_牛尾菜.jpg",
        type: [1],
      },
      {
        path: "伸筋草/130_蜘蛛抱蛋.jpg",
        type: [1],
      },
      {
        path: "伸筋草/150_垂穗石松.jpg",
        type: [1],
      },
      {
        path: "伸筋草/170_垂穗石松.jpg",
        type: [1],
      },
      {
        path: "伸筋草/190_地刷子石松.jpg",
        type: [1],
      },
      {
        path: "伸筋草/210_伪品：扁枝石松.jpg",
        type: [1],
      },
      {
        path: "伸筋草/230_伪品：藤石松.jpg",
        type: [1],
      },
      {
        path: "伸筋草/250_伸筋草与混用品同科植物性状比较.jpg",
        type: [1],
      },
      {
        path: "伸筋草/270_伸筋草饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "何首乌",
    files: [
      {
        path: "何首乌/010_何首乌植物.jpg",
        type: [1],
      },
      {
        path: "何首乌/030_何首乌药材.jpg",
        type: [1],
      },
      {
        path: "何首乌/050_何首乌药材.jpg",
        type: [1],
      },
      {
        path: "何首乌/070_何首乌块.jpg",
        type: [1],
      },
      {
        path: "何首乌/090_何首乌片.jpg",
        type: [1],
      },
      {
        path: "何首乌/110_何首乌.jpg",
        type: [1],
      },
      {
        path: "何首乌/130_何首乌.jpg",
        type: [1],
      },
      {
        path: "何首乌/150_何首乌性状鉴别.jpg",
        type: [1],
      },
      {
        path: "何首乌/170_伪品何首乌：翼蓼.jpg",
        type: [1],
      },
      {
        path: "何首乌/190_伪品何首乌：翼蓼片.jpg",
        type: [1],
      },
      {
        path: "何首乌/210_伪品何首乌：毛脉蓼.jpg",
        type: [1],
      },
      {
        path: "何首乌/230_伪品何首乌：白首乌.jpg",
        type: [1],
      },
      {
        path: "何首乌/250_何首乌伪品：牛皮消.jpg",
        type: [1],
      },
      {
        path: "何首乌/270_何首乌伪品：隔山撬.jpg",
        type: [1],
      },
      {
        path: "何首乌/290_何首乌伪品：薯莨.jpg",
        type: [1],
      },
      {
        path: "何首乌/310_何首乌伪品：黄独.jpg",
        type: [1],
      },
      {
        path: "何首乌/330_人形何首乌.jpg",
        type: [1],
      },
      {
        path: "何首乌/350_何首乌饮片.jpg",
        type: [1],
      },
      {
        path: "何首乌/370_制何首乌.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "余甘子",
    files: [
      {
        path: "余甘子/010_余甘子植物.jpg",
        type: [1],
      },
      {
        path: "余甘子/030_余甘子药材.jpg",
        type: [1],
      },
      {
        path: "余甘子/050_余甘子.jpg",
        type: [1],
      },
      {
        path: "余甘子/070_余甘子性状鉴别.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "佛手",
    files: [
      {
        path: "佛手/010_佛手植物.jpg",
        type: [1],
      },
      {
        path: "佛手/030_佛手药材.jpg",
        type: [1],
      },
      {
        path: "佛手/050_佛手性状鉴别.jpg",
        type: [1],
      },
      {
        path: "佛手/070_广佛手，金边白肉.jpg",
        type: [1],
      },
      {
        path: "佛手/090_川佛手（云南），绿皮白肉。主产四川，云南。.jpg",
        type: [1],
      },
      {
        path: "佛手/110_伪品：佛手瓜.jpg",
        type: [1],
      },
      {
        path: "佛手/130_佛手与易混品对比.jpg",
        type: [1],
      },
      {
        path: "佛手/150_佛手花.jpg",
        type: [1],
      },
      {
        path: "佛手/170_佛手丝.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "佩兰",
    files: [
      {
        path: "佩兰/000_化湿药_佩兰.jpg",
        type: [1],
      },
      {
        path: "佩兰/010_佩兰.jpg",
        type: [1],
      },
      {
        path: "佩兰/030_佩兰.jpg",
        type: [1],
      },
      {
        path: "佩兰/050_佩兰.jpg",
        type: [1],
      },
      {
        path: "佩兰/070_佩兰.jpg",
        type: [1],
      },
      {
        path: "佩兰/090_佩兰性状鉴别.jpg",
        type: [1],
      },
      {
        path: "佩兰/110_佩兰.jpg",
        type: [1],
      },
      {
        path: "佩兰/130_泽兰.jpg",
        type: [1],
      },
      {
        path: "佩兰/150_矮糠.jpg",
        type: [2],
      },
      {
        path: "佩兰/170_轮叶泽兰（野马追）.jpg",
        type: [1],
      },
      {
        path: "佩兰/190_异叶佩兰.jpg",
        type: [1],
      },
      {
        path: "佩兰/210_异叶佩兰果.jpg",
        type: [1],
      },
      {
        path: "佩兰/230_窄叶佩兰.jpg",
        type: [1],
      },
      {
        path: "佩兰/250_佩兰饮片.jpg",
        type: [1],
      },
      {
        path: "佩兰/270_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "使君子",
    files: [
      {
        path: "使君子/010_使君子植物.jpg",
        type: [1],
      },
      {
        path: "使君子/030_使君子药材.jpg",
        type: [1],
      },
      {
        path: "使君子/050_使君子.jpg",
        type: [1],
      },
      {
        path: "使君子/070_使君子性状鉴别.jpg",
        type: [1],
      },
      {
        path: "使君子/090_使君子仁.jpg",
        type: [1],
      },
      {
        path: "使君子/110_炒使君子仁.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "侧柏叶",
    files: [
      {
        path: "侧柏叶/000_止血药_侧柏叶.jpg",
        type: [1],
      },
      {
        path: "侧柏叶/010_侧柏.jpg",
        type: [1],
      },
      {
        path: "侧柏叶/030_侧柏叶药材.jpg",
        type: [1],
      },
      {
        path: "侧柏叶/050_侧柏叶饮片.jpg",
        type: [1],
      },
      {
        path: "侧柏叶/070_侧柏叶.jpg",
        type: [1],
      },
      {
        path: "侧柏叶/090_侧柏叶.jpg",
        type: [1],
      },
      {
        path: "侧柏叶/110_侧柏叶性状鉴别.jpg",
        type: [1],
      },
      {
        path: "侧柏叶/130_侧柏叶与柏木叶比较.jpg",
        type: [1],
      },
      {
        path: "侧柏叶/150_侧柏叶.jpg",
        type: [1],
      },
      {
        path: "侧柏叶/170_罗汉松叶.jpg",
        type: [1],
      },
      {
        path: "侧柏叶/190_侧柏叶.jpg",
        type: [1],
      },
      {
        path: "侧柏叶/210_侧柏炭.jpg",
        type: [1],
      },
      {
        path: "侧柏叶/230_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "僵蚕",
    files: [
      {
        path: "僵蚕/000_熄风止痉药_僵蚕.jpg",
        type: [1],
      },
      {
        path: "僵蚕/010_家蚕.jpg",
        type: [1],
      },
      {
        path: "僵蚕/030_僵蚕药材.jpg",
        type: [1],
      },
      {
        path: "僵蚕/050_僵蚕药材.jpg",
        type: [1],
      },
      {
        path: "僵蚕/070_僵蚕.jpg",
        type: [1],
      },
      {
        path: "僵蚕/090_僵蚕性状鉴别.jpg",
        type: [1],
      },
      {
        path: "僵蚕/110_伪品地蚕_又名草石蚕、地虫草.jpg",
        type: [1],
      },
      {
        path: "僵蚕/130_死蚕拌面，特点瘦瘪，玻璃茬不明显.jpg",
        type: [1],
      },
      {
        path: "僵蚕/150_模子压制的，比正常的僵蚕粗，断面没有胶口镜面.jpg",
        type: [1],
      },
      {
        path: "僵蚕/170_①为正品，表面被满菌丝和孢子粉，无石灰粉状物.jpg",
        type: [1],
      },
      {
        path: "僵蚕/190_。②为“发酵”不充分的劣质僵蚕，称“黄条”，通常正品中会有少量.jpg",
        type: [1],
      },
      {
        path: "僵蚕/210_③为伪品，用硼砂加工后再用白僵菌孢子粉拌匀，表面无菌丝状物，白粉不均匀附着.jpg",
        type: [1],
      },
      {
        path: "僵蚕/230_正品折断面，断面外圈有嵌入状的菌丝和孢子粉.jpg",
        type: [1],
      },
      {
        path: "僵蚕/250_劣品黄条折断面，断面无菌丝和孢子粉.jpg",
        type: [1],
      },
      {
        path: "僵蚕/270_伪品折断面，丝腺环参差不平整，明显且饱满，有些有空隙，无菌丝和孢子粉嵌入中间.jpg",
        type: [1],
      },
      {
        path: "僵蚕/290_炒僵蚕.jpg",
        type: [1],
      },
      {
        path: "僵蚕/310_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "儿茶",
    files: [
      {
        path: "儿茶/010_儿茶植物.jpg",
        type: [1],
      },
      {
        path: "儿茶/030_儿茶药材.jpg",
        type: [1],
      },
      {
        path: "儿茶/050_儿茶.jpg",
        type: [1],
      },
      {
        path: "儿茶/070_儿茶性状鉴别.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "光慈菇",
    files: [
      {
        path: "光慈菇/010_老鸦瓣植物.jpg",
        type: [1],
      },
      {
        path: "光慈菇/030_光慈菇药材.jpg",
        type: [1],
      },
      {
        path: "光慈菇/050_光慈菇药材.jpg",
        type: [1],
      },
      {
        path: "光慈菇/070_光慈菇.jpg",
        type: [1],
      },
      {
        path: "光慈菇/090_丽江山慈菇.jpg",
        type: [1],
      },
      {
        path: "光慈菇/110_青牛胆.jpg",
        type: [1],
      },
      {
        path: "光慈菇/130_毛柄青牛胆.jpg",
        type: [1],
      },
      {
        path: "光慈菇/150_毛慈菇.jpg",
        type: [1],
      },
      {
        path: "光慈菇/170_冰球子.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "党参",
    files: [
      {
        path: "党参/010_党参植物.jpg",
        type: [1],
      },
      {
        path: "党参/030_潞党.jpg",
        type: [1],
      },
      {
        path: "党参/050_潞党野生品.jpg",
        type: [1],
      },
      {
        path: "党参/070_素花党参.jpg",
        type: [1],
      },
      {
        path: "党参/090_川党参.jpg",
        type: [1],
      },
      {
        path: "党参/110_党参.jpg",
        type: [1],
      },
      {
        path: "党参/130_素花党参（西党参）.jpg",
        type: [1],
      },
      {
        path: "党参/150_川党参.jpg",
        type: [1],
      },
      {
        path: "党参/170_党参熏硫对比.jpg",
        type: [1],
      },
      {
        path: "党参/190_党参性状鉴别.jpg",
        type: [1],
      },
      {
        path: "党参/210_迷果芹.jpg",
        type: [1],
      },
      {
        path: "党参/230_羊乳参.jpg",
        type: [1],
      },
      {
        path: "党参/250_石生蝇子草.jpg",
        type: [1],
      },
      {
        path: "党参/270_金钱豹.jpg",
        type: [1],
      },
      {
        path: "党参/290_羊乳参.jpg",
        type: [1],
      },
      {
        path: "党参/310_迷果芹.jpg",
        type: [1],
      },
      {
        path: "党参/330_石生蝇子草.jpg",
        type: [1],
      },
      {
        path: "党参/350_大花金钱豹.jpg",
        type: [1],
      },
      {
        path: "党参/370_金钱豹.jpg",
        type: [1],
      },
      {
        path: "党参/390_管花党参.jpg",
        type: [1],
      },
      {
        path: "党参/410_新疆党参.jpg",
        type: [1],
      },
      {
        path: "党参/430_球花党参.jpg",
        type: [1],
      },
      {
        path: "党参/450_灰毛党参.jpg",
        type: [1],
      },
      {
        path: "党参/470_脉花党参.jpg",
        type: [1],
      },
      {
        path: "党参/490_红皮党参.jpg",
        type: [1],
      },
      {
        path: "党参/510_粘萼女娄菜.jpg",
        type: [1],
      },
      {
        path: "党参/530_山女娄菜.jpg",
        type: [1],
      },
      {
        path: "党参/550_金铁锁.jpg",
        type: [1],
      },
      {
        path: "党参/570_党参饮片.jpg",
        type: [1],
      },
      {
        path: "党参/590_炒党参.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "全蝎",
    files: [
      {
        path: "全蝎/010_东亚钳蝎.jpg",
        type: [1],
      },
      {
        path: "全蝎/030_全蝎药材.jpg",
        type: [1],
      },
      {
        path: "全蝎/050_全蝎药材.jpg",
        type: [1],
      },
      {
        path: "全蝎/070_全蝎性状鉴别.jpg",
        type: [1],
      },
      {
        path: "全蝎/090_全蝎性状鉴别.jpg",
        type: [1],
      },
      {
        path: "全蝎/110_腹中加异物.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "八角茴香",
    files: [
      {
        path: "八角茴香/010_八角茴香植物.jpg",
        type: [1],
      },
      {
        path: "八角茴香/030_八角茴香药材.jpg",
        type: [1],
      },
      {
        path: "八角茴香/050_八角茴香性状鉴别.jpg",
        type: [1],
      },
      {
        path: "八角茴香/070_八角茴香伪品：莽草.jpg",
        type: [1],
      },
      {
        path: "八角茴香/090_八角茴香伪品：地枫皮果实.jpg",
        type: [1],
      },
      {
        path: "八角茴香/110_八角茴香伪品：短柱八角.jpg",
        type: [1],
      },
      {
        path: "八角茴香/130_八角茴香伪品：多蕊红茴香.jpg",
        type: [1],
      },
      {
        path: "八角茴香/150_八角茴香伪品：红茴香.jpg",
        type: [1],
      },
      {
        path: "八角茴香/170_八角茴香伪品：野八角.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "八角莲",
    files: [
      {
        path: "八角莲/010_八角莲植物.jpg",
        type: [1],
      },
      {
        path: "八角莲/030_八角莲药材.jpg",
        type: [1],
      },
      {
        path: "八角莲/050_八角莲药材.jpg",
        type: [1],
      },
      {
        path: "八角莲/070_八角莲药材.jpg",
        type: [1],
      },
      {
        path: "八角莲/090_八角莲饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "六畜毛蹄甲",
    files: [
      {
        path: "六畜毛蹄甲/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "六神曲",
    files: [
      {
        path: "六神曲/010_六神曲药材.jpg",
        type: [1],
      },
      {
        path: "六神曲/030_炒神曲.jpg",
        type: [1],
      },
      {
        path: "六神曲/050_焦神曲.jpg",
        type: [1],
      },
      {
        path: "六神曲/070_麸炒神曲.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "兰草",
    files: [
      {
        path: "兰草/000_化湿药_佩兰.jpg",
        type: [1],
      },
      {
        path: "兰草/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "冬凌草",
    files: [
      {
        path: "冬凌草/010_碎米桠.jpg",
        type: [1],
      },
      {
        path: "冬凌草/030_冬凌草药材.jpg",
        type: [1],
      },
      {
        path: "冬凌草/050_冬凌草.jpg",
        type: [1],
      },
      {
        path: "冬凌草/070_冬凌草.jpg",
        type: [1],
      },
      {
        path: "冬凌草/090_冬凌草鉴别.jpg",
        type: [1],
      },
      {
        path: "冬凌草/110_冬凌草鉴别要点.jpg",
        type: [1],
      },
      {
        path: "冬凌草/130_冬凌草饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "冬灰",
    files: [
      {
        path: "冬灰/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "冬瓜子",
    files: [
      {
        path: "冬瓜子/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "冬瓜皮",
    files: [
      {
        path: "冬瓜皮/010_冬瓜植物.jpg",
        type: [1],
      },
      {
        path: "冬瓜皮/030_冬瓜皮.jpg",
        type: [1],
      },
      {
        path: "冬瓜皮/050_冬瓜皮.jpg",
        type: [1],
      },
      {
        path: "冬瓜皮/070_冬瓜皮丝.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "冬葵果",
    files: [
      {
        path: "冬葵果/010_冬葵植物.jpg",
        type: [1],
      },
      {
        path: "冬葵果/030_冬葵果药材.jpg",
        type: [1],
      },
      {
        path: "冬葵果/050_冬葵果药材.jpg",
        type: [1],
      },
      {
        path: "冬葵果/070_冬葵果.jpg",
        type: [1],
      },
      {
        path: "冬葵果/090_冬葵性状鉴别.jpg",
        type: [1],
      },
      {
        path: "冬葵果/110_冬葵果.jpg",
        type: [1],
      },
      {
        path: "冬葵果/130_冬葵果分瓣果.jpg",
        type: [1],
      },
      {
        path: "冬葵果/150_冬葵果分瓣果及种子.jpg",
        type: [1],
      },
      {
        path: "冬葵果/170_冬葵子.jpg",
        type: [1],
      },
      {
        path: "冬葵果/190_苘麻子.jpg",
        type: [2],
      },
      {
        path: "冬葵果/210_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "冬虫夏草",
    files: [
      {
        path: "冬虫夏草/010_采挖前冬虫夏草.jpg",
        type: [1],
      },
      {
        path: "冬虫夏草/030_冬虫夏草药材.jpg",
        type: [1],
      },
      {
        path: "冬虫夏草/050_冬虫夏草性状鉴别.jpg",
        type: [1],
      },
      {
        path: "冬虫夏草/070_伪品：面粉模压品.jpg",
        type: [1],
      },
      {
        path: "冬虫夏草/090_伪品：凉山虫草.jpg",
        type: [1],
      },
      {
        path: "冬虫夏草/110_伪品：新疆虫草.jpg",
        type: [1],
      },
      {
        path: "冬虫夏草/130_伪品：亚香棒虫草.jpg",
        type: [1],
      },
      {
        path: "冬虫夏草/150_伪品：蛹草的子座.jpg",
        type: [1],
      },
      {
        path: "冬虫夏草/170_伪品：地蚕.jpg",
        type: [1],
      },
      {
        path: "冬虫夏草/190_伪品：伪制蛹草.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "冰片",
    files: [
      {
        path: "冰片/010_结构式.jpg",
        type: [1],
      },
      {
        path: "冰片/030_冰片药材.jpg",
        type: [1],
      },
      {
        path: "冰片/050_冰片性状鉴别.jpg",
        type: [1],
      },
      {
        path: "冰片/070_梅花冰片.jpg",
        type: [1],
      },
      {
        path: "冰片/090_冰片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "冰糖",
    files: [
      {
        path: "冰糖/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "决明子",
    files: [
      {
        path: "决明子/000_清热药_决明子.jpg",
        type: [1],
      },
      {
        path: "决明子/010_钝叶决明.jpg",
        type: [1],
      },
      {
        path: "决明子/030_小决明.jpg",
        type: [1],
      },
      {
        path: "决明子/050_决明.jpg",
        type: [1],
      },
      {
        path: "决明子/070_小决明.jpg",
        type: [1],
      },
      {
        path: "决明子/090_左小决明，右决明子.jpg",
        type: [1],
      },
      {
        path: "决明子/110_A. 钝叶决明的种子　B. 小决明的种子.jpg",
        type: [1],
      },
      {
        path: "决明子/130_决明子性状鉴别.jpg",
        type: [1],
      },
      {
        path: "决明子/150_决明子药材.jpg",
        type: [1],
      },
      {
        path: "决明子/170_望江南.jpg",
        type: [2],
      },
      {
        path: "决明子/190_茳芒决明.jpg",
        type: [2],
      },
      {
        path: "决明子/210_田菁种子.jpg",
        type: [2],
      },
      {
        path: "决明子/230_炒决明子.jpg",
        type: [1],
      },
      {
        path: "决明子/250_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "凌霄花",
    files: [
      {
        path: "凌霄花/010_凌霄植物.jpg",
        type: [1],
      },
      {
        path: "凌霄花/030_美洲凌霄.jpg",
        type: [1],
      },
      {
        path: "凌霄花/050_凌霄药材.jpg",
        type: [1],
      },
      {
        path: "凌霄花/070_美洲凌霄药材.jpg",
        type: [1],
      },
      {
        path: "凌霄花/090_凌霄花.jpg",
        type: [1],
      },
      {
        path: "凌霄花/110_美洲凌霄花.jpg",
        type: [1],
      },
      {
        path: "凌霄花/130_凌霄花性状鉴别.jpg",
        type: [1],
      },
      {
        path: "凌霄花/150_凌霄花.jpg",
        type: [1],
      },
      {
        path: "凌霄花/170_泡桐花.jpg",
        type: [1],
      },
      {
        path: "凌霄花/190_伪品泡桐花.jpg",
        type: [1],
      },
      {
        path: "凌霄花/210_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "凝水石",
    files: [
      {
        path: "凝水石/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "凤仙透骨草",
    files: [
      {
        path: "凤仙透骨草/010_凤仙花.jpg",
        type: [1],
      },
      {
        path: "凤仙透骨草/030_凤仙透骨草药材.jpg",
        type: [1],
      },
      {
        path: "凤仙透骨草/050_凤仙透骨草药材.jpg",
        type: [1],
      },
      {
        path: "凤仙透骨草/070_凤仙透骨草饮片.jpg",
        type: [1],
      },
      {
        path: "凤仙透骨草/090_凤仙透骨草饮片.jpg",
        type: [1],
      },
      {
        path: "凤仙透骨草/110_珍珠透骨草.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "刀豆",
    files: [
      {
        path: "刀豆/010_刀豆植物.jpg",
        type: [1],
      },
      {
        path: "刀豆/030_刀豆药材.jpg",
        type: [1],
      },
      {
        path: "刀豆/050_刀豆.jpg",
        type: [1],
      },
      {
        path: "刀豆/070_真品刀豆.jpg",
        type: [1],
      },
      {
        path: "刀豆/090_伪品常春油麻藤的种子.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "刘寄奴",
    files: [
      {
        path: "刘寄奴/010_阴行草植物.jpg",
        type: [1],
      },
      {
        path: "刘寄奴/030_北刘寄奴药材.jpg",
        type: [1],
      },
      {
        path: "刘寄奴/050_北刘寄奴药材.jpg",
        type: [1],
      },
      {
        path: "刘寄奴/070_北刘寄奴.jpg",
        type: [1],
      },
      {
        path: "刘寄奴/090_北刘寄奴.jpg",
        type: [1],
      },
      {
        path: "刘寄奴/110_北刘寄奴.jpg",
        type: [1],
      },
      {
        path: "刘寄奴/130_奇蒿.jpg",
        type: [1],
      },
      {
        path: "刘寄奴/150_南刘寄奴药材.jpg",
        type: [1],
      },
      {
        path: "刘寄奴/170_南刘寄奴饮片.jpg",
        type: [1],
      },
      {
        path: "刘寄奴/190_南刘寄奴.jpg",
        type: [1],
      },
      {
        path: "刘寄奴/210_南刘寄奴.jpg",
        type: [1],
      },
      {
        path: "刘寄奴/230_地耳草.jpg",
        type: [1],
      },
      {
        path: "刘寄奴/250_湖南连翅.jpg",
        type: [1],
      },
      {
        path: "刘寄奴/270_湖南连翅.jpg",
        type: [1],
      },
      {
        path: "刘寄奴/290_元宝草.jpg",
        type: [1],
      },
      {
        path: "刘寄奴/310_元宝草果实表面观.jpg",
        type: [1],
      },
      {
        path: "刘寄奴/330_金丝梅.jpg",
        type: [1],
      },
      {
        path: "刘寄奴/350_甜蒿子.jpg",
        type: [1],
      },
      {
        path: "刘寄奴/370_南刘寄奴.jpg",
        type: [1],
      },
      {
        path: "刘寄奴/390_广东刘寄奴.jpg",
        type: [1],
      },
      {
        path: "刘寄奴/410_北刘寄奴饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "别羁",
    files: [
      {
        path: "别羁/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "刺五加",
    files: [
      {
        path: "刺五加/010_刺五加植物.jpg",
        type: [1],
      },
      {
        path: "刺五加/030_刺五加鲜枝条.jpg",
        type: [1],
      },
      {
        path: "刺五加/050_刺五加根茎及根.jpg",
        type: [1],
      },
      {
        path: "刺五加/070_刺五加茎.jpg",
        type: [1],
      },
      {
        path: "刺五加/090_刺五加药材.jpg",
        type: [1],
      },
      {
        path: "刺五加/110_刺五加根切片.jpg",
        type: [1],
      },
      {
        path: "刺五加/130_刺五加根茎.jpg",
        type: [1],
      },
      {
        path: "刺五加/150_刺五加.jpg",
        type: [1],
      },
      {
        path: "刺五加/170_刺五加性状鉴别.jpg",
        type: [1],
      },
      {
        path: "刺五加/190_短梗五加.jpg",
        type: [1],
      },
      {
        path: "刺五加/210_短梗五加.jpg",
        type: [1],
      },
      {
        path: "刺五加/230_龙牙楤木.jpg",
        type: [1],
      },
      {
        path: "刺五加/250_龙牙楤木.jpg",
        type: [1],
      },
      {
        path: "刺五加/270_蔷薇科某种植物枝条.jpg",
        type: [1],
      },
      {
        path: "刺五加/290_老虎撩子.jpg",
        type: [1],
      },
      {
        path: "刺五加/310_刺五加饮片地上茎.jpg",
        type: [1],
      },
      {
        path: "刺五加/330_刺五加根饮片.jpg",
        type: [1],
      },
      {
        path: "刺五加/350_毛冬青.jpg",
        type: [1],
      },
      {
        path: "刺五加/370_鸟不宿.jpg",
        type: [1],
      },
      {
        path: "刺五加/390_鸟不宿.jpg",
        type: [1],
      },
      {
        path: "刺五加/410_刺五加根片.jpg",
        type: [1],
      },
      {
        path: "刺五加/430_刺五加茎段.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "刺猬皮",
    files: [
      {
        path: "刺猬皮/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "前胡",
    files: [
      {
        path: "前胡/010_白花前胡.jpg",
        type: [1],
      },
      {
        path: "前胡/030_前胡（野生）.jpg",
        type: [1],
      },
      {
        path: "前胡/050_前胡（栽培）.jpg",
        type: [1],
      },
      {
        path: "前胡/070_前胡.jpg",
        type: [1],
      },
      {
        path: "前胡/090_前胡饮片.jpg",
        type: [1],
      },
      {
        path: "前胡/110_前胡（野生）.jpg",
        type: [1],
      },
      {
        path: "前胡/130_前胡（栽培）.jpg",
        type: [1],
      },
      {
        path: "前胡/150_前胡饮片（野生）.jpg",
        type: [1],
      },
      {
        path: "前胡/170_前胡.jpg",
        type: [1],
      },
      {
        path: "前胡/190_前胡.jpg",
        type: [1],
      },
      {
        path: "前胡/210_前胡性状鉴别.jpg",
        type: [1],
      },
      {
        path: "前胡/230_石防风.jpg",
        type: [1],
      },
      {
        path: "前胡/250_前胡伪品，短片藁本.jpg",
        type: [1],
      },
      {
        path: "前胡/270_短片藁本.jpg",
        type: [1],
      },
      {
        path: "前胡/290_华中前胡.jpg",
        type: [1],
      },
      {
        path: "前胡/310_云前胡.jpg",
        type: [1],
      },
      {
        path: "前胡/330_云前胡.jpg",
        type: [1],
      },
      {
        path: "前胡/350_毛前胡.jpg",
        type: [1],
      },
      {
        path: "前胡/370_毛前胡.jpg",
        type: [1],
      },
      {
        path: "前胡/390_前胡饮片.jpg",
        type: [1],
      },
      {
        path: "前胡/410_蜜前胡.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "功劳木",
    files: [
      {
        path: "功劳木/010_阔叶十大功劳.jpg",
        type: [1],
      },
      {
        path: "功劳木/030_细叶十大功劳.jpg",
        type: [1],
      },
      {
        path: "功劳木/050_功劳木.jpg",
        type: [1],
      },
      {
        path: "功劳木/070_功劳木.jpg",
        type: [1],
      },
      {
        path: "功劳木/090_功劳木.jpg",
        type: [1],
      },
      {
        path: "功劳木/110_功劳木.jpg",
        type: [1],
      },
      {
        path: "功劳木/130_阔叶十大功劳.jpg",
        type: [1],
      },
      {
        path: "功劳木/150_细叶十大功劳.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "化橘红",
    files: [
      {
        path: "化橘红/010_化州柚植物.jpg",
        type: [1],
      },
      {
        path: "化橘红/030_柚植物.jpg",
        type: [1],
      },
      {
        path: "化橘红/050_毛橘红.jpg",
        type: [1],
      },
      {
        path: "化橘红/070_毛七爪.jpg",
        type: [1],
      },
      {
        path: "化橘红/090_化橘红性状鉴别.jpg",
        type: [1],
      },
      {
        path: "化橘红/110_化橘红，由柚加工而成.jpg",
        type: [1],
      },
      {
        path: "化橘红/130_光七爪.jpg",
        type: [1],
      },
      {
        path: "化橘红/150_化橘红商品规格.jpg",
        type: [1],
      },
      {
        path: "化橘红/170_化橘红饮片.jpg",
        type: [1],
      },
      {
        path: "化橘红/190_化橘红饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "北沙参",
    files: [
      {
        path: "北沙参/000_补虚药_北沙参.jpg",
        type: [1],
      },
      {
        path: "北沙参/000_补虚药_南沙参.jpg",
        type: [1],
      },
      {
        path: "北沙参/010_珊瑚菜.jpg",
        type: [1],
      },
      {
        path: "北沙参/030_北沙参药材.jpg",
        type: [1],
      },
      {
        path: "北沙参/050_北沙参药材.jpg",
        type: [1],
      },
      {
        path: "北沙参/070_北沙参饮片.jpg",
        type: [1],
      },
      {
        path: "北沙参/090_北沙参鉴别.jpg",
        type: [1],
      },
      {
        path: "北沙参/110_北沙参.jpg",
        type: [1],
      },
      {
        path: "北沙参/130_北沙参、南沙参横切面对比.jpg",
        type: [1],
      },
      {
        path: "北沙参/150_北沙参性状鉴别.jpg",
        type: [1],
      },
      {
        path: "北沙参/170_迷果芹.jpg",
        type: [2],
      },
      {
        path: "北沙参/190_迷果芹.jpg",
        type: [2],
      },
      {
        path: "北沙参/210_硬阿魏.jpg",
        type: [2],
      },
      {
        path: "北沙参/230_石生蝇子草.jpg",
        type: [2],
      },
      {
        path: "北沙参/250_石生蝇子草.jpg",
        type: [2],
      },
      {
        path: "北沙参/270_北沙参饮片.jpg",
        type: [1],
      },
      {
        path: "北沙参/290_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "北豆根",
    files: [
      {
        path: "北豆根/010_蝙蝠葛植物.jpg",
        type: [1],
      },
      {
        path: "北豆根/030_北豆根药材.jpg",
        type: [1],
      },
      {
        path: "北豆根/050_北豆根饮片.jpg",
        type: [1],
      },
      {
        path: "北豆根/070_北豆根.jpg",
        type: [1],
      },
      {
        path: "北豆根/090_北豆根鉴别特征.jpg",
        type: [1],
      },
      {
        path: "北豆根/110_北豆根性状鉴别.jpg",
        type: [1],
      },
      {
        path: "北豆根/130_北豆根.jpg",
        type: [1],
      },
      {
        path: "北豆根/150_山豆根.jpg",
        type: [1],
      },
      {
        path: "北豆根/170_北豆根与山豆根个子对比（上：北豆根）.jpg",
        type: [1],
      },
      {
        path: "北豆根/190_山豆根、北豆根断面对比（右：北豆根）.jpg",
        type: [1],
      },
      {
        path: "北豆根/210_北豆根饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "千年健",
    files: [
      {
        path: "千年健/010_千年健植物.jpg",
        type: [1],
      },
      {
        path: "千年健/030_千年健药材.jpg",
        type: [1],
      },
      {
        path: "千年健/050_千年健药材.jpg",
        type: [1],
      },
      {
        path: "千年健/070_千年健饮片.jpg",
        type: [1],
      },
      {
        path: "千年健/090_千年健性状鉴别.jpg",
        type: [1],
      },
      {
        path: "千年健/110_千年健饮片.jpg",
        type: [1],
      },
      {
        path: "千年健/130_千年健饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "千斤拔",
    files: [
      {
        path: "千斤拔/010_千斤拔植物.jpg",
        type: [1],
      },
      {
        path: "千斤拔/030_大叶千斤拔植物.jpg",
        type: [1],
      },
      {
        path: "千斤拔/050_千斤拔药材.jpg",
        type: [1],
      },
      {
        path: "千斤拔/070_千斤拔饮片.jpg",
        type: [1],
      },
      {
        path: "千斤拔/090_大叶千斤拔药材.jpg",
        type: [1],
      },
      {
        path: "千斤拔/110_大叶千斤拔饮片.jpg",
        type: [1],
      },
      {
        path: "千斤拔/130_千斤拔饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "千里光",
    files: [
      {
        path: "千里光/010_千里光.jpg",
        type: [1],
      },
      {
        path: "千里光/030_千里光药材.jpg",
        type: [1],
      },
      {
        path: "千里光/050_千里光切段.jpg",
        type: [1],
      },
      {
        path: "千里光/070_千里光饮片.jpg",
        type: [1],
      },
      {
        path: "千里光/090_千里光.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "千金子",
    files: [
      {
        path: "千金子/010_续随子植物.jpg",
        type: [1],
      },
      {
        path: "千金子/030_千金子药材.jpg",
        type: [1],
      },
      {
        path: "千金子/050_千金子.jpg",
        type: [1],
      },
      {
        path: "千金子/070_千金子.jpg",
        type: [1],
      },
      {
        path: "千金子/090_千金子性状鉴别.jpg",
        type: [1],
      },
      {
        path: "千金子/110_千金子霜.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "升麻",
    files: [
      {
        path: "升麻/010_大三叶升麻.jpg",
        type: [1],
      },
      {
        path: "升麻/030_兴安升麻.jpg",
        type: [1],
      },
      {
        path: "升麻/050_升麻.jpg",
        type: [1],
      },
      {
        path: "升麻/070_升麻药材.jpg",
        type: [1],
      },
      {
        path: "升麻/090_升麻饮片.jpg",
        type: [1],
      },
      {
        path: "升麻/110_升麻性状特征.jpg",
        type: [1],
      },
      {
        path: "升麻/130_升麻（大三叶）.jpg",
        type: [1],
      },
      {
        path: "升麻/150_升麻.jpg",
        type: [1],
      },
      {
        path: "升麻/170_升麻性状鉴别.jpg",
        type: [1],
      },
      {
        path: "升麻/190_落新妇.jpg",
        type: [2],
      },
      {
        path: "升麻/210_腺毛马蓝.jpg",
        type: [2],
      },
      {
        path: "升麻/230_广升麻.jpg",
        type: [2],
      },
      {
        path: "升麻/250_单穗升麻.jpg",
        type: [2],
      },
      {
        path: "升麻/270_云南升麻.jpg",
        type: [2],
      },
      {
        path: "升麻/290_铁破锣.jpg",
        type: [2],
      },
      {
        path: "升麻/310_类叶升麻.jpg",
        type: [2],
      },
      {
        path: "升麻/330_升麻饮片.jpg",
        type: [1],
      },
      {
        path: "升麻/350_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "半夏",
    files: [
      {
        path: "半夏/000_化痰药_半夏.jpg",
        type: [1],
      },
      {
        path: "半夏/000_化痰药_天南星.jpg",
        type: [1],
      },
      {
        path: "半夏/000_化痰药_天南星2.jpg",
        type: [1],
      },
      {
        path: "半夏/010_半夏植物.jpg",
        type: [1],
      },
      {
        path: "半夏/030_半夏全株.jpg",
        type: [1],
      },
      {
        path: "半夏/050_鲜半夏.jpg",
        type: [1],
      },
      {
        path: "半夏/070_半夏药材.jpg",
        type: [1],
      },
      {
        path: "半夏/090_长侧芽的半夏.jpg",
        type: [1],
      },
      {
        path: "半夏/110_半夏性状鉴别.jpg",
        type: [1],
      },
      {
        path: "半夏/130_半夏伪品：水半夏.jpg",
        type: [1],
      },
      {
        path: "半夏/150_半夏伪品：虎掌南星.jpg",
        type: [1],
      },
      {
        path: "半夏/170_半夏伪品：小天南星.jpg",
        type: [1],
      },
      {
        path: "半夏/190_半夏及伪品.jpg",
        type: [1],
      },
      {
        path: "半夏/210_法半夏.jpg",
        type: [1],
      },
      {
        path: "半夏/230_姜半夏.jpg",
        type: [1],
      },
      {
        path: "半夏/250_清半夏.jpg",
        type: [1],
      },
      {
        path: "半夏/270_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "半枝莲",
    files: [
      {
        path: "半枝莲/010_半枝莲植物.jpg",
        type: [1],
      },
      {
        path: "半枝莲/030_半枝莲鲜草.jpg",
        type: [1],
      },
      {
        path: "半枝莲/050_半枝莲药材.jpg",
        type: [1],
      },
      {
        path: "半枝莲/070_半枝莲.jpg",
        type: [1],
      },
      {
        path: "半枝莲/090_半枝莲.jpg",
        type: [1],
      },
      {
        path: "半枝莲/110_半枝莲.jpg",
        type: [1],
      },
      {
        path: "半枝莲/130_半枝莲性状鉴别.jpg",
        type: [1],
      },
      {
        path: "半枝莲/150_半枝莲性状鉴别.jpg",
        type: [1],
      },
      {
        path: "半枝莲/170_半枝莲饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "半边莲",
    files: [
      {
        path: "半边莲/010_半边莲植物.jpg",
        type: [1],
      },
      {
        path: "半边莲/030_半边莲药材.jpg",
        type: [1],
      },
      {
        path: "半边莲/050_半边莲.jpg",
        type: [1],
      },
      {
        path: "半边莲/070_半边莲.jpg",
        type: [1],
      },
      {
        path: "半边莲/090_半边莲性状鉴别.jpg",
        type: [1],
      },
      {
        path: "半边莲/110_通泉草植物.jpg",
        type: [1],
      },
      {
        path: "半边莲/130_半边莲饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "华山参",
    files: [
      {
        path: "华山参/010_漏斗泡囊草植物.jpg",
        type: [1],
      },
      {
        path: "华山参/030_华山参药材.jpg",
        type: [1],
      },
      {
        path: "华山参/050_华山参饮片.jpg",
        type: [1],
      },
      {
        path: "华山参/070_华山参药材.jpg",
        type: [1],
      },
      {
        path: "华山参/090_华山参切片.jpg",
        type: [1],
      },
      {
        path: "华山参/110_华山参.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "南板蓝根",
    files: [
      {
        path: "南板蓝根/010_马蓝植物.jpg",
        type: [1],
      },
      {
        path: "南板蓝根/030_南板蓝根.jpg",
        type: [1],
      },
      {
        path: "南板蓝根/050_南板蓝根饮片.jpg",
        type: [1],
      },
      {
        path: "南板蓝根/070_南板蓝根.jpg",
        type: [1],
      },
      {
        path: "南板蓝根/090_南板蓝根饮片.jpg",
        type: [1],
      },
      {
        path: "南板蓝根/110_南板蓝根.jpg",
        type: [1],
      },
      {
        path: "南板蓝根/130_南板蓝根.jpg",
        type: [1],
      },
      {
        path: "南板蓝根/150_南板蓝根性状鉴别.jpg",
        type: [1],
      },
      {
        path: "南板蓝根/170_南板蓝根.jpg",
        type: [1],
      },
      {
        path: "南板蓝根/190_板蓝根.jpg",
        type: [1],
      },
      {
        path: "南板蓝根/210_南板蓝根及混伪品性状比较.jpg",
        type: [1],
      },
      {
        path: "南板蓝根/230_左球花马蓝、中疏花马蓝、右广西马蓝.jpg",
        type: [1],
      },
      {
        path: "南板蓝根/250_马鞭草科植物路边青的根.jpg",
        type: [1],
      },
      {
        path: "南板蓝根/270_南板蓝根饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "南沙参",
    files: [
      {
        path: "南沙参/000_补虚药_北沙参.jpg",
        type: [1],
      },
      {
        path: "南沙参/000_补虚药_南沙参.jpg",
        type: [1],
      },
      {
        path: "南沙参/010_轮叶沙参.jpg",
        type: [1],
      },
      {
        path: "南沙参/030_沙参.jpg",
        type: [1],
      },
      {
        path: "南沙参/050_南沙参药材.jpg",
        type: [1],
      },
      {
        path: "南沙参/070_南沙参（轮叶沙参）药材.jpg",
        type: [1],
      },
      {
        path: "南沙参/090_南沙参（杏叶沙参）药材.jpg",
        type: [1],
      },
      {
        path: "南沙参/110_南沙参饮片.jpg",
        type: [1],
      },
      {
        path: "南沙参/130_南沙参.jpg",
        type: [1],
      },
      {
        path: "南沙参/150_南沙参性状鉴别.jpg",
        type: [1],
      },
      {
        path: "南沙参/170_伪品丝石竹.jpg",
        type: [2],
      },
      {
        path: "南沙参/190_伪品丝石竹.jpg",
        type: [2],
      },
      {
        path: "南沙参/210_南沙参与伪品对比图.jpg",
        type: [2],
      },
      {
        path: "南沙参/230_南沙参饮片.jpg",
        type: [1],
      },
      {
        path: "南沙参/250_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "南鹤虱",
    files: [
      {
        path: "南鹤虱/010_野胡萝卜植物.jpg",
        type: [1],
      },
      {
        path: "南鹤虱/030_野胡萝卜果序.jpg",
        type: [1],
      },
      {
        path: "南鹤虱/050_南鹤虱药材.jpg",
        type: [1],
      },
      {
        path: "南鹤虱/070_南鹤虱性状鉴别.jpg",
        type: [1],
      },
      {
        path: "南鹤虱/090_南鹤虱.jpg",
        type: [1],
      },
      {
        path: "南鹤虱/110_华南鹤虱.jpg",
        type: [1],
      },
      {
        path: "南鹤虱/130_鹤虱非正品：东北鹤虱.jpg",
        type: [1],
      },
      {
        path: "南鹤虱/150_鹤虱非正品：破子草.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "卷柏",
    files: [
      {
        path: "卷柏/010_卷柏.jpg",
        type: [1],
      },
      {
        path: "卷柏/030_垫状卷柏.jpg",
        type: [1],
      },
      {
        path: "卷柏/050_卷柏.jpg",
        type: [1],
      },
      {
        path: "卷柏/070_垫状卷柏.jpg",
        type: [1],
      },
      {
        path: "卷柏/090_垫状卷柏.jpg",
        type: [1],
      },
      {
        path: "卷柏/110_卷柏药材.jpg",
        type: [1],
      },
      {
        path: "卷柏/130_卷柏药材.jpg",
        type: [1],
      },
      {
        path: "卷柏/150_卷柏未除去须根（左）和垫状卷柏（右）对比.jpg",
        type: [1],
      },
      {
        path: "卷柏/170_两种基源卷柏叶正面显微图对比.jpg",
        type: [1],
      },
      {
        path: "卷柏/190_两种基源卷柏叶背面显微图对比.jpg",
        type: [1],
      },
      {
        path: "卷柏/210_卷柏性状鉴别.jpg",
        type: [1],
      },
      {
        path: "卷柏/230_翠云草.jpg",
        type: [2],
      },
      {
        path: "卷柏/250_翠云草.jpg",
        type: [2],
      },
      {
        path: "卷柏/270_翠云草.jpg",
        type: [2],
      },
      {
        path: "卷柏/290_中华卷柏.jpg",
        type: [2],
      },
      {
        path: "卷柏/310_中华卷柏.jpg",
        type: [2],
      },
      {
        path: "卷柏/330_蔓出卷柏.jpg",
        type: [2],
      },
      {
        path: "卷柏/350_蔓出卷柏.jpg",
        type: [2],
      },
      {
        path: "卷柏/370_旱生卷柏.jpg",
        type: [2],
      },
      {
        path: "卷柏/390_深绿卷柏.jpg",
        type: [2],
      },
      {
        path: "卷柏/410_深绿卷柏.jpg",
        type: [2],
      },
      {
        path: "卷柏/430_江南卷柏.jpg",
        type: [2],
      },
      {
        path: "卷柏/450_卷柏饮片.jpg",
        type: [1],
      },
      {
        path: "卷柏/470_卷柏炭.jpg",
        type: [1],
      },
      {
        path: "卷柏/490_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "厚朴",
    files: [
      {
        path: "厚朴/000_化湿药_厚朴.jpg",
        type: [1],
      },
      {
        path: "厚朴/000_化湿药_厚朴2.jpg",
        type: [1],
      },
      {
        path: "厚朴/010_厚朴植物.jpg",
        type: [1],
      },
      {
        path: "厚朴/030_凹叶厚朴植物.jpg",
        type: [1],
      },
      {
        path: "厚朴/050_干皮药材.jpg",
        type: [1],
      },
      {
        path: "厚朴/070_根皮药材.jpg",
        type: [1],
      },
      {
        path: "厚朴/090_枝皮药材.jpg",
        type: [1],
      },
      {
        path: "厚朴/110_厚朴.jpg",
        type: [1],
      },
      {
        path: "厚朴/130_厚朴性状鉴别.jpg",
        type: [1],
      },
      {
        path: "厚朴/150_腾冲厚朴.jpg",
        type: [1],
      },
      {
        path: "厚朴/170_厚朴混淆品.jpg",
        type: [1],
      },
      {
        path: "厚朴/190_厚朴混淆品.jpg",
        type: [1],
      },
      {
        path: "厚朴/210_厚朴混淆品.jpg",
        type: [1],
      },
      {
        path: "厚朴/230_厚朴混淆品.jpg",
        type: [1],
      },
      {
        path: "厚朴/250_厚朴饮片.jpg",
        type: [1],
      },
      {
        path: "厚朴/270_姜厚朴.jpg",
        type: [1],
      },
      {
        path: "厚朴/290_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "厚朴花",
    files: [
      {
        path: "厚朴花/010_厚朴植物.jpg",
        type: [1],
      },
      {
        path: "厚朴花/030_凹叶厚朴植物.jpg",
        type: [1],
      },
      {
        path: "厚朴花/050_厚朴花药材.jpg",
        type: [1],
      },
      {
        path: "厚朴花/070_厚朴花药材.jpg",
        type: [1],
      },
      {
        path: "厚朴花/090_厚朴花药材.jpg",
        type: [1],
      },
      {
        path: "厚朴花/110_厚朴花.jpg",
        type: [1],
      },
      {
        path: "厚朴花/130_厚朴花.jpg",
        type: [1],
      },
      {
        path: "厚朴花/150_凹叶厚朴花.jpg",
        type: [1],
      },
      {
        path: "厚朴花/170_凹叶厚朴花.jpg",
        type: [1],
      },
      {
        path: "厚朴花/190_深山含笑.jpg",
        type: [1],
      },
      {
        path: "厚朴花/210_山玉兰.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "原蚕蛾",
    files: [
      {
        path: "原蚕蛾/010_原蚕蛾.jpg",
        type: [1],
      },
      {
        path: "原蚕蛾/030_原蚕蛾.jpg",
        type: [1],
      },
      {
        path: "原蚕蛾/050_原蚕蛾.jpg",
        type: [1],
      },
      {
        path: "原蚕蛾/070_原蚕蛾.jpg",
        type: [1],
      },
      {
        path: "原蚕蛾/090_原蚕蛾.jpg",
        type: [1],
      },
      {
        path: "原蚕蛾/110_原蚕蛾.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "古南",
    files: [
      {
        path: "古南/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "合欢皮",
    files: [
      {
        path: "合欢皮/000_安神药_合欢皮.jpg",
        type: [1],
      },
      {
        path: "合欢皮/010_合欢植物.jpg",
        type: [1],
      },
      {
        path: "合欢皮/030_合欢皮药材.jpg",
        type: [1],
      },
      {
        path: "合欢皮/050_合欢皮.jpg",
        type: [1],
      },
      {
        path: "合欢皮/070_合欢皮鉴别.jpg",
        type: [1],
      },
      {
        path: "合欢皮/090_合欢皮.jpg",
        type: [1],
      },
      {
        path: "合欢皮/110_伪品山合欢.jpg",
        type: [1],
      },
      {
        path: "合欢皮/130_合欢皮  山合欢皮对比图.jpg",
        type: [1],
      },
      {
        path: "合欢皮/150_合欢皮.jpg",
        type: [1],
      },
      {
        path: "合欢皮/170_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "合欢花",
    files: [
      {
        path: "合欢花/010_合欢植物.jpg",
        type: [1],
      },
      {
        path: "合欢花/030_合欢花.jpg",
        type: [1],
      },
      {
        path: "合欢花/050_合欢花药材.jpg",
        type: [1],
      },
      {
        path: "合欢花/070_合欢米药材.jpg",
        type: [1],
      },
      {
        path: "合欢花/090_合欢花性状鉴别.jpg",
        type: [1],
      },
      {
        path: "合欢花/110_合欢花.jpg",
        type: [1],
      },
      {
        path: "合欢花/130_夜合花.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "吴茱萸",
    files: [
      {
        path: "吴茱萸/000_温里药_吴茱萸.jpg",
        type: [1],
      },
      {
        path: "吴茱萸/010_吴茱萸植物.jpg",
        type: [1],
      },
      {
        path: "吴茱萸/030_石虎.jpg",
        type: [1],
      },
      {
        path: "吴茱萸/050_疏毛吴茱萸.jpg",
        type: [1],
      },
      {
        path: "吴茱萸/070_吴茱萸药材.jpg",
        type: [1],
      },
      {
        path: "吴茱萸/090_吴茱萸.jpg",
        type: [1],
      },
      {
        path: "吴茱萸/110_石虎.jpg",
        type: [1],
      },
      {
        path: "吴茱萸/130_吴茱萸药材（吴茱萸）.jpg",
        type: [1],
      },
      {
        path: "吴茱萸/150_吴茱萸药材（疏毛吴茱萸）.jpg",
        type: [1],
      },
      {
        path: "吴茱萸/170_吴茱萸性状鉴别.jpg",
        type: [1],
      },
      {
        path: "吴茱萸/190_臭辣子.jpg",
        type: [1],
      },
      {
        path: "吴茱萸/210_吴茱萸A与臭辣树果实B药材性状图.jpg",
        type: [1],
      },
      {
        path: "吴茱萸/230_吴茱萸开裂掺杂.jpg",
        type: [1],
      },
      {
        path: "吴茱萸/250_制吴茱萸.jpg",
        type: [1],
      },
      {
        path: "吴茱萸/270_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "哈蟆油",
    files: [
      {
        path: "哈蟆油/010_中国林蛙.jpg",
        type: [1],
      },
      {
        path: "哈蟆油/030_哈蟆油.jpg",
        type: [1],
      },
      {
        path: "哈蟆油/050_哈蟆油.jpg",
        type: [1],
      },
      {
        path: "哈蟆油/070_哈蟆油.jpg",
        type: [1],
      },
      {
        path: "哈蟆油/090_哈蟆油.jpg",
        type: [1],
      },
      {
        path: "哈蟆油/110_伪品为蟾蜍的输卵管.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "商陆",
    files: [
      {
        path: "商陆/000_泻下药_商陆.jpg",
        type: [1],
      },
      {
        path: "商陆/010_商陆植物.jpg",
        type: [1],
      },
      {
        path: "商陆/030_垂序商陆植物.jpg",
        type: [1],
      },
      {
        path: "商陆/050_商陆饮片.jpg",
        type: [1],
      },
      {
        path: "商陆/070_商陆饮片.jpg",
        type: [1],
      },
      {
        path: "商陆/090_商陆个子.jpg",
        type: [1],
      },
      {
        path: "商陆/110_商陆纵切面与横切面.jpg",
        type: [1],
      },
      {
        path: "商陆/130_垂序商陆.jpg",
        type: [1],
      },
      {
        path: "商陆/150_商陆.jpg",
        type: [1],
      },
      {
        path: "商陆/170_垂序商陆.jpg",
        type: [1],
      },
      {
        path: "商陆/190_商陆性状鉴别.jpg",
        type: [1],
      },
      {
        path: "商陆/210_野牡丹.jpg",
        type: [1],
      },
      {
        path: "商陆/230_丝石竹.jpg",
        type: [1],
      },
      {
        path: "商陆/250_山莨菪.jpg",
        type: [1],
      },
      {
        path: "商陆/270_三分三.jpg",
        type: [1],
      },
      {
        path: "商陆/290_闭鞘姜.jpg",
        type: [1],
      },
      {
        path: "商陆/310_生商陆.jpg",
        type: [1],
      },
      {
        path: "商陆/330_醋商陆.jpg",
        type: [1],
      },
      {
        path: "商陆/350_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "四季青",
    files: [
      {
        path: "四季青/010_冬青.jpg",
        type: [1],
      },
      {
        path: "四季青/030_四季青药材.jpg",
        type: [1],
      },
      {
        path: "四季青/050_四季青叶.jpg",
        type: [1],
      },
      {
        path: "四季青/070_四季青.jpg",
        type: [1],
      },
      {
        path: "四季青/090_四季青.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "土木香",
    files: [
      {
        path: "土木香/010_土木香植物.jpg",
        type: [1],
      },
      {
        path: "土木香/030_土木香药材.jpg",
        type: [1],
      },
      {
        path: "土木香/050_土木香饮片.jpg",
        type: [1],
      },
      {
        path: "土木香/070_土木香.jpg",
        type: [1],
      },
      {
        path: "土木香/090_土木香.jpg",
        type: [1],
      },
      {
        path: "土木香/110_土木香切片.jpg",
        type: [1],
      },
      {
        path: "土木香/130_土木香.jpg",
        type: [1],
      },
      {
        path: "土木香/150_土木香性状鉴别.jpg",
        type: [1],
      },
      {
        path: "土木香/170_土木香饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "土牛膝",
    files: [
      {
        path: "土牛膝/010_01_各地历史上作土牛膝入药情况整理.jpg",
        type: [1],
      },
      {
        path: "土牛膝/030_土牛膝植物.jpg",
        type: [1],
      },
      {
        path: "土牛膝/050_土牛膝药材.jpg",
        type: [1],
      },
      {
        path: "土牛膝/070_土牛膝药材.jpg",
        type: [1],
      },
      {
        path: "土牛膝/090_土牛膝饮片.jpg",
        type: [1],
      },
      {
        path: "土牛膝/110_土牛膝.jpg",
        type: [1],
      },
      {
        path: "土牛膝/130_土牛膝饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "土茯苓",
    files: [
      {
        path: "土茯苓/010_光叶菝葜.jpg",
        type: [1],
      },
      {
        path: "土茯苓/030_土茯苓药材.jpg",
        type: [1],
      },
      {
        path: "土茯苓/050_土茯苓药材.jpg",
        type: [1],
      },
      {
        path: "土茯苓/070_土茯苓饮片.jpg",
        type: [1],
      },
      {
        path: "土茯苓/090_土茯苓饮片.jpg",
        type: [1],
      },
      {
        path: "土茯苓/110_土茯苓饮片.jpg",
        type: [1],
      },
      {
        path: "土茯苓/130_土茯苓性状鉴别.jpg",
        type: [1],
      },
      {
        path: "土茯苓/150_金荞麦根.jpg",
        type: [1],
      },
      {
        path: "土茯苓/170_土茯苓.jpg",
        type: [1],
      },
      {
        path: "土茯苓/190_土茯苓饮片.jpg",
        type: [1],
      },
      {
        path: "土茯苓/210_肖菝葜.jpg",
        type: [1],
      },
      {
        path: "土茯苓/230_短柱肖菝葜.jpg",
        type: [1],
      },
      {
        path: "土茯苓/250_肖菝葜属切片.jpg",
        type: [1],
      },
      {
        path: "土茯苓/270_菝葜.jpg",
        type: [1],
      },
      {
        path: "土茯苓/290_菝葜.jpg",
        type: [1],
      },
      {
        path: "土茯苓/310_菝葜.jpg",
        type: [1],
      },
      {
        path: "土茯苓/330_菝葜.jpg",
        type: [1],
      },
      {
        path: "土茯苓/350_菝葜.jpg",
        type: [1],
      },
      {
        path: "土茯苓/370_小叶菝葜.jpg",
        type: [1],
      },
      {
        path: "土茯苓/390_土茯苓及伪品比较.jpg",
        type: [1],
      },
      {
        path: "土茯苓/410_土茯苓饮片.jpg",
        type: [1],
      },
      {
        path: "土茯苓/430_土茯苓饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "土荆皮",
    files: [
      {
        path: "土荆皮/010_金钱松植物.jpg",
        type: [1],
      },
      {
        path: "土荆皮/030_土荆皮.jpg",
        type: [1],
      },
      {
        path: "土荆皮/050_土荆皮.jpg",
        type: [1],
      },
      {
        path: "土荆皮/070_土荆皮性状鉴别.jpg",
        type: [1],
      },
      {
        path: "土荆皮/090_正品撕开后的内部红白相间纹理.jpg",
        type: [1],
      },
      {
        path: "土荆皮/110_紫荆皮.jpg",
        type: [1],
      },
      {
        path: "土荆皮/130_余甘子树皮.jpg",
        type: [1],
      },
      {
        path: "土荆皮/150_土荆皮.jpg",
        type: [1],
      },
      {
        path: "土荆皮/170_土槿皮.jpg",
        type: [1],
      },
      {
        path: "土荆皮/190_土荆皮饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "土贝母",
    files: [
      {
        path: "土贝母/010_土贝母植物.jpg",
        type: [1],
      },
      {
        path: "土贝母/030_土贝母药材.jpg",
        type: [1],
      },
      {
        path: "土贝母/050_土贝母药材.jpg",
        type: [1],
      },
      {
        path: "土贝母/070_土贝母.jpg",
        type: [1],
      },
      {
        path: "土贝母/090_土贝母.jpg",
        type: [1],
      },
      {
        path: "土贝母/110_土贝母性状鉴别.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "土鳖虫",
    files: [
      {
        path: "土鳖虫/000_活血药_土鳖.jpg",
        type: [1],
      },
      {
        path: "土鳖虫/010_地鳖.jpg",
        type: [1],
      },
      {
        path: "土鳖虫/030_冀地鳖.jpg",
        type: [1],
      },
      {
        path: "土鳖虫/050_地鳖.jpg",
        type: [1],
      },
      {
        path: "土鳖虫/070_冀地鳖.jpg",
        type: [1],
      },
      {
        path: "土鳖虫/090_地鳖背面.jpg",
        type: [1],
      },
      {
        path: "土鳖虫/110_地鳖腹面.jpg",
        type: [1],
      },
      {
        path: "土鳖虫/130_冀地鳖.jpg",
        type: [1],
      },
      {
        path: "土鳖虫/150_土鳖虫性状鉴别.jpg",
        type: [1],
      },
      {
        path: "土鳖虫/170_赤边水庶.jpg",
        type: [1],
      },
      {
        path: "土鳖虫/190_地鳖、冀地鳖、赤边水庶.jpg",
        type: [1],
      },
      {
        path: "土鳖虫/210_东方龙虱.jpg",
        type: [1],
      },
      {
        path: "土鳖虫/230_土鳖虫.jpg",
        type: [1],
      },
      {
        path: "土鳖虫/250_金边土鳖.jpg",
        type: [1],
      },
      {
        path: "土鳖虫/270_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "地枫皮",
    files: [
      {
        path: "地枫皮/010_地枫皮植物.jpg",
        type: [1],
      },
      {
        path: "地枫皮/030_地枫皮药材.jpg",
        type: [1],
      },
      {
        path: "地枫皮/050_地枫皮性状鉴别.jpg",
        type: [1],
      },
      {
        path: "地枫皮/070_左：假地枫皮   右：大八角.jpg",
        type: [1],
      },
      {
        path: "地枫皮/090_左：红花八角   右：山八角.jpg",
        type: [1],
      },
      {
        path: "地枫皮/110_地枫皮饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "地榆",
    files: [
      {
        path: "地榆/000_止血药_地榆.jpg",
        type: [1],
      },
      {
        path: "地榆/010_地榆植物.jpg",
        type: [1],
      },
      {
        path: "地榆/030_长叶地榆植物.jpg",
        type: [1],
      },
      {
        path: "地榆/050_地榆药材.jpg",
        type: [1],
      },
      {
        path: "地榆/070_绵地榆药材.jpg",
        type: [1],
      },
      {
        path: "地榆/090_绵地榆—皮部撕裂后有绵状纤维特征.jpg",
        type: [1],
      },
      {
        path: "地榆/110_地榆药材.jpg",
        type: [1],
      },
      {
        path: "地榆/130_地榆饮片.jpg",
        type: [1],
      },
      {
        path: "地榆/150_地榆饮片特征.jpg",
        type: [1],
      },
      {
        path: "地榆/170_绵地榆饮片.jpg",
        type: [1],
      },
      {
        path: "地榆/190_地榆性状鉴别.jpg",
        type: [1],
      },
      {
        path: "地榆/210_隔山消.jpg",
        type: [1],
      },
      {
        path: "地榆/230_紫地榆.jpg",
        type: [1],
      },
      {
        path: "地榆/250_黄地榆.jpg",
        type: [1],
      },
      {
        path: "地榆/270_拳参.jpg",
        type: [1],
      },
      {
        path: "地榆/290_地榆饮片.jpg",
        type: [1],
      },
      {
        path: "地榆/310_地榆饮片.jpg",
        type: [1],
      },
      {
        path: "地榆/330_地榆炭.jpg",
        type: [1],
      },
      {
        path: "地榆/350_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "地肤子",
    files: [
      {
        path: "地肤子/000_利水渗湿药_地肤子.jpg",
        type: [1],
      },
      {
        path: "地肤子/010_地肤植物.jpg",
        type: [1],
      },
      {
        path: "地肤子/030_地肤子果序.jpg",
        type: [1],
      },
      {
        path: "地肤子/050_地肤子.jpg",
        type: [1],
      },
      {
        path: "地肤子/070_地肤子放大图.jpg",
        type: [1],
      },
      {
        path: "地肤子/090_地肤子药材.jpg",
        type: [1],
      },
      {
        path: "地肤子/110_地肤子性状鉴别.jpg",
        type: [1],
      },
      {
        path: "地肤子/130_天仙子.jpg",
        type: [2],
      },
      {
        path: "地肤子/150_藜的胞果.jpg",
        type: [2],
      },
      {
        path: "地肤子/170_岗松果.jpg",
        type: [2],
      },
      {
        path: "地肤子/190_1、胞果扁球状五角星形   2、表面灰绿色或浅棕色.jpg",
        type: [2],
      },
      {
        path: "地肤子/210_1、坚果三梭形，一端平截    2、表面灰褐色或褐色.jpg",
        type: [2],
      },
      {
        path: "地肤子/230_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "地胆",
    files: [
      {
        path: "地胆/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "地锦草",
    files: [
      {
        path: "地锦草/010_地锦植物.jpg",
        type: [1],
      },
      {
        path: "地锦草/030_斑地锦植物.jpg",
        type: [1],
      },
      {
        path: "地锦草/050_地锦.jpg",
        type: [1],
      },
      {
        path: "地锦草/070_斑地锦.jpg",
        type: [1],
      },
      {
        path: "地锦草/090_地锦草药材.jpg",
        type: [1],
      },
      {
        path: "地锦草/110_地锦草药材.jpg",
        type: [1],
      },
      {
        path: "地锦草/130_地锦草饮片（地锦）.jpg",
        type: [1],
      },
      {
        path: "地锦草/150_地锦草饮片（斑地锦）.jpg",
        type: [1],
      },
      {
        path: "地锦草/170_地锦草饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "地骨皮",
    files: [
      {
        path: "地骨皮/010_枸杞植物.jpg",
        type: [1],
      },
      {
        path: "地骨皮/030_宁夏枸杞植物.jpg",
        type: [1],
      },
      {
        path: "地骨皮/050_地骨皮药材.jpg",
        type: [1],
      },
      {
        path: "地骨皮/070_地骨皮.jpg",
        type: [1],
      },
      {
        path: "地骨皮/090_地骨皮性状鉴别.jpg",
        type: [1],
      },
      {
        path: "地骨皮/110_伪品：荃皮.jpg",
        type: [1],
      },
      {
        path: "地骨皮/130_鹅绒藤根皮.jpg",
        type: [1],
      },
      {
        path: "地骨皮/150_鹅绒藤根皮.jpg",
        type: [1],
      },
      {
        path: "地骨皮/170_左：地骨皮  中：香加皮  右：荃皮.jpg",
        type: [1],
      },
      {
        path: "地骨皮/190_地骨皮.jpg",
        type: [1],
      },
      {
        path: "地骨皮/210_荃皮.jpg",
        type: [1],
      },
      {
        path: "地骨皮/230_地骨皮饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "地黄",
    files: [
      {
        path: "地黄/000_清热药_生地黄.jpg",
        type: [1],
      },
      {
        path: "地黄/000_补虚药_熟地黄.jpg",
        type: [1],
      },
      {
        path: "地黄/010_地黄植物.jpg",
        type: [1],
      },
      {
        path: "地黄/030_地黄.jpg",
        type: [1],
      },
      {
        path: "地黄/050_鲜地黄药材.jpg",
        type: [1],
      },
      {
        path: "地黄/070_生地黄药材.jpg",
        type: [1],
      },
      {
        path: "地黄/090_地黄的鉴别.jpg",
        type: [1],
      },
      {
        path: "地黄/110_地黄饮片.jpg",
        type: [1],
      },
      {
        path: "地黄/130_熟地黄.jpg",
        type: [1],
      },
      {
        path: "地黄/150_熟地黄炭.jpg",
        type: [1],
      },
      {
        path: "地黄/170_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "地龙",
    files: [
      {
        path: "地龙/000_熄风止痉药_地龙.jpg",
        type: [1],
      },
      {
        path: "地龙/000_熄风止痉药_地龙2.jpg",
        type: [1],
      },
      {
        path: "地龙/010_参环毛蚓.jpg",
        type: [1],
      },
      {
        path: "地龙/030_通俗环毛蚓.jpg",
        type: [1],
      },
      {
        path: "地龙/050_威廉环毛蚓.jpg",
        type: [1],
      },
      {
        path: "地龙/070_广地龙药材.jpg",
        type: [1],
      },
      {
        path: "地龙/090_沪地龙药材.jpg",
        type: [1],
      },
      {
        path: "地龙/110_地龙药材.jpg",
        type: [1],
      },
      {
        path: "地龙/130_广地龙.jpg",
        type: [1],
      },
      {
        path: "地龙/150_地龙性状.jpg",
        type: [1],
      },
      {
        path: "地龙/170_地龙性状鉴别.jpg",
        type: [1],
      },
      {
        path: "地龙/190_伪劣地龙（断面充土）.jpg",
        type: [1],
      },
      {
        path: "地龙/210_地龙饮片.jpg",
        type: [1],
      },
      {
        path: "地龙/230_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "垂盆草",
    files: [
      {
        path: "垂盆草/010_垂盆草.jpg",
        type: [1],
      },
      {
        path: "垂盆草/030_垂盆草.jpg",
        type: [1],
      },
      {
        path: "垂盆草/050_垂盆草性状鉴别.jpg",
        type: [1],
      },
      {
        path: "垂盆草/070_垂盆草与伪品对比.jpg",
        type: [1],
      },
      {
        path: "垂盆草/090_垂盆草饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "墨旱莲",
    files: [
      {
        path: "墨旱莲/010_墨旱莲植物.jpg",
        type: [1],
      },
      {
        path: "墨旱莲/030_墨旱莲药材.jpg",
        type: [1],
      },
      {
        path: "墨旱莲/050_墨旱莲药材.jpg",
        type: [1],
      },
      {
        path: "墨旱莲/070_墨旱莲.jpg",
        type: [1],
      },
      {
        path: "墨旱莲/090_墨旱莲.jpg",
        type: [1],
      },
      {
        path: "墨旱莲/110_墨旱莲.jpg",
        type: [1],
      },
      {
        path: "墨旱莲/130_墨旱莲性状鉴别.jpg",
        type: [1],
      },
      {
        path: "墨旱莲/150_朝天委陵菜.jpg",
        type: [1],
      },
      {
        path: "墨旱莲/170_元宝草.jpg",
        type: [1],
      },
      {
        path: "墨旱莲/190_元宝草果实表面观.jpg",
        type: [1],
      },
      {
        path: "墨旱莲/210_湖南连翅.jpg",
        type: [1],
      },
      {
        path: "墨旱莲/230_湖南连翅.jpg",
        type: [1],
      },
      {
        path: "墨旱莲/250_墨旱莲饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "夏天无",
    files: [
      {
        path: "夏天无/010_伏生紫堇.jpg",
        type: [1],
      },
      {
        path: "夏天无/030_夏天无药材.jpg",
        type: [1],
      },
      {
        path: "夏天无/050_夏天无药材.jpg",
        type: [1],
      },
      {
        path: "夏天无/070_夏天无药材.jpg",
        type: [1],
      },
      {
        path: "夏天无/090_夏天无.jpg",
        type: [1],
      },
      {
        path: "夏天无/110_夏天无.jpg",
        type: [1],
      },
      {
        path: "夏天无/130_延胡索、夏天无对比图.jpg",
        type: [1],
      },
      {
        path: "夏天无/150_零余子.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "夏枯草",
    files: [
      {
        path: "夏枯草/000_清热药_夏枯草.jpg",
        type: [1],
      },
      {
        path: "夏枯草/010_夏枯草植物.jpg",
        type: [1],
      },
      {
        path: "夏枯草/030_夏枯草药材.jpg",
        type: [1],
      },
      {
        path: "夏枯草/050_小坚果放大图.jpg",
        type: [1],
      },
      {
        path: "夏枯草/070_夏枯草性状鉴别.jpg",
        type: [1],
      },
      {
        path: "夏枯草/090_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "大伸筋",
    files: [
      {
        path: "大伸筋/010_牛尾菜植物.jpg",
        type: [1],
      },
      {
        path: "大伸筋/030_蜘蛛抱蛋.jpg",
        type: [1],
      },
      {
        path: "大伸筋/050_牛尾菜药材.jpg",
        type: [1],
      },
      {
        path: "大伸筋/070_牛尾菜药材.jpg",
        type: [1],
      },
      {
        path: "大伸筋/090_牛尾菜药材.jpg",
        type: [1],
      },
      {
        path: "大伸筋/110_蜘蛛抱蛋.jpg",
        type: [1],
      },
      {
        path: "大伸筋/130_蜘蛛抱蛋.jpg",
        type: [1],
      },
      {
        path: "大伸筋/150_牛尾菜.jpg",
        type: [1],
      },
      {
        path: "大伸筋/170_蜘蛛抱蛋.jpg",
        type: [1],
      },
      {
        path: "大伸筋/190_大伸筋饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "大叶紫珠",
    files: [
      {
        path: "大叶紫珠/010_大叶紫珠.jpg",
        type: [1],
      },
      {
        path: "大叶紫珠/030_大叶紫珠药材.jpg",
        type: [1],
      },
      {
        path: "大叶紫珠/050_大叶紫珠药材（叶）.jpg",
        type: [1],
      },
      {
        path: "大叶紫珠/070_大叶紫珠药材（带叶嫩枝）.jpg",
        type: [1],
      },
      {
        path: "大叶紫珠/090_大叶紫珠性状鉴别.jpg",
        type: [1],
      },
      {
        path: "大叶紫珠/110_六种紫珠检索表.jpg",
        type: [1],
      },
      {
        path: "大叶紫珠/130_六种紫珠性状比较.jpg",
        type: [1],
      },
      {
        path: "大叶紫珠/150_六种紫珠性状比较.jpg",
        type: [1],
      },
      {
        path: "大叶紫珠/170_六种紫珠性状比较.jpg",
        type: [1],
      },
      {
        path: "大叶紫珠/190_六种紫珠性状比较.jpg",
        type: [1],
      },
      {
        path: "大叶紫珠/210_大叶紫珠饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "大枣",
    files: [
      {
        path: "大枣/000_补虚药_大枣.jpg",
        type: [1],
      },
      {
        path: "大枣/010_大枣植物.jpg",
        type: [1],
      },
      {
        path: "大枣/030_大枣药材.jpg",
        type: [1],
      },
      {
        path: "大枣/050_大枣饮片.jpg",
        type: [1],
      },
      {
        path: "大枣/070_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "大皂角",
    files: [
      {
        path: "大皂角/000_化痰药_皂角.jpg",
        type: [1],
      },
      {
        path: "大皂角/010_皂荚植物.jpg",
        type: [1],
      },
      {
        path: "大皂角/030_大皂角药材.jpg",
        type: [1],
      },
      {
        path: "大皂角/050_大皂角药材.jpg",
        type: [1],
      },
      {
        path: "大皂角/070_皂角段.jpg",
        type: [1],
      },
      {
        path: "大皂角/090_大皂角.jpg",
        type: [1],
      },
      {
        path: "大皂角/110_猪牙皂.jpg",
        type: [1],
      },
      {
        path: "大皂角/130_肥皂荚.jpg",
        type: [1],
      },
      {
        path: "大皂角/150_日本皂角.jpg",
        type: [1],
      },
      {
        path: "大皂角/170_皂角段.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "大腹皮",
    files: [
      {
        path: "大腹皮/010_槟榔植物.jpg",
        type: [1],
      },
      {
        path: "大腹皮/030_大腹皮.jpg",
        type: [1],
      },
      {
        path: "大腹皮/050_大腹毛.jpg",
        type: [1],
      },
      {
        path: "大腹皮/070_大腹皮与大腹毛.jpg",
        type: [1],
      },
      {
        path: "大腹皮/090_大腹皮性状鉴别.jpg",
        type: [1],
      },
      {
        path: "大腹皮/110_大腹毛.jpg",
        type: [1],
      },
      {
        path: "大腹皮/130_大腹皮饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "大蓟",
    files: [
      {
        path: "大蓟/010_蓟植物.jpg",
        type: [1],
      },
      {
        path: "大蓟/030_大蓟药材.jpg",
        type: [1],
      },
      {
        path: "大蓟/050_大蓟.jpg",
        type: [1],
      },
      {
        path: "大蓟/070_大蓟.jpg",
        type: [1],
      },
      {
        path: "大蓟/090_大蓟根.jpg",
        type: [1],
      },
      {
        path: "大蓟/110_大蓟性状鉴别.jpg",
        type: [1],
      },
      {
        path: "大蓟/130_飞廉.jpg",
        type: [1],
      },
      {
        path: "大蓟/150_伪品飞廉.jpg",
        type: [1],
      },
      {
        path: "大蓟/170_青刺蓟.jpg",
        type: [1],
      },
      {
        path: "大蓟/190_小蓟.jpg",
        type: [1],
      },
      {
        path: "大蓟/210_大蓟饮片.jpg",
        type: [1],
      },
      {
        path: "大蓟/230_大蓟炭.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "大血藤",
    files: [
      {
        path: "大血藤/010_大血藤植物.jpg",
        type: [1],
      },
      {
        path: "大血藤/030_大血藤药材.jpg",
        type: [1],
      },
      {
        path: "大血藤/050_大血藤.jpg",
        type: [1],
      },
      {
        path: "大血藤/070_大血藤.jpg",
        type: [1],
      },
      {
        path: "大血藤/090_大血藤性状鉴别.jpg",
        type: [1],
      },
      {
        path: "大血藤/110_大血藤.jpg",
        type: [1],
      },
      {
        path: "大血藤/130_鸡血藤.jpg",
        type: [1],
      },
      {
        path: "大血藤/150_大血藤饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "大豆黄卷",
    files: [
      {
        path: "大豆黄卷/010_大豆植物.jpg",
        type: [1],
      },
      {
        path: "大豆黄卷/030_大豆.jpg",
        type: [1],
      },
      {
        path: "大豆黄卷/050_大豆黄卷药材.jpg",
        type: [1],
      },
      {
        path: "大豆黄卷/070_大豆黄卷.jpg",
        type: [1],
      },
      {
        path: "大豆黄卷/090_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "大青叶",
    files: [
      {
        path: "大青叶/010_菘蓝.jpg",
        type: [1],
      },
      {
        path: "大青叶/030_大青叶药材.jpg",
        type: [1],
      },
      {
        path: "大青叶/050_大青叶药材.jpg",
        type: [1],
      },
      {
        path: "大青叶/070_大青叶.jpg",
        type: [1],
      },
      {
        path: "大青叶/090_大青叶性状鉴别.jpg",
        type: [1],
      },
      {
        path: "大青叶/110_蓼大青叶.jpg",
        type: [1],
      },
      {
        path: "大青叶/130_马蓝.jpg",
        type: [1],
      },
      {
        path: "大青叶/150_大青.jpg",
        type: [1],
      },
      {
        path: "大青叶/170_大青.jpg",
        type: [1],
      },
      {
        path: "大青叶/190_大青.jpg",
        type: [1],
      },
      {
        path: "大青叶/210_路边青.jpg",
        type: [1],
      },
      {
        path: "大青叶/230_四种大青叶鉴别特征.jpg",
        type: [1],
      },
      {
        path: "大青叶/250_大青叶.jpg",
        type: [1],
      },
      {
        path: "大青叶/270_广东大青叶.jpg",
        type: [1],
      },
      {
        path: "大青叶/290_大青叶饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "大青盐",
    files: [
      {
        path: "大青盐/010_湖盐结晶体.jpg",
        type: [1],
      },
      {
        path: "大青盐/030_大青盐药材.jpg",
        type: [1],
      },
      {
        path: "大青盐/050_大青盐药材.jpg",
        type: [1],
      },
      {
        path: "大青盐/070_大青盐.jpg",
        type: [1],
      },
      {
        path: "大青盐/090_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "大风子",
    files: [
      {
        path: "大风子/010_大风子.jpg",
        type: [1],
      },
      {
        path: "大风子/030_大风子药材.jpg",
        type: [1],
      },
      {
        path: "大风子/050_大风子.jpg",
        type: [1],
      },
      {
        path: "大风子/070_伪品苦檀子.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "大驳骨",
    files: [
      {
        path: "大驳骨/010_黑叶接骨草.jpg",
        type: [1],
      },
      {
        path: "大驳骨/030_大驳骨.jpg",
        type: [1],
      },
      {
        path: "大驳骨/050_广东标准大驳骨原植物及药材.jpg",
        type: [1],
      },
      {
        path: "大驳骨/070_大驳骨与小驳骨性状鉴别.jpg",
        type: [1],
      },
      {
        path: "大驳骨/090_大驳骨.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "大黄",
    files: [
      {
        path: "大黄/000_泻下药_大黄.jpg",
        type: [1],
      },
      {
        path: "大黄/010_掌叶大黄植物.jpg",
        type: [1],
      },
      {
        path: "大黄/030_唐古特大黄植物.jpg",
        type: [1],
      },
      {
        path: "大黄/050_药用大黄植物.jpg",
        type: [1],
      },
      {
        path: "大黄/070_三种大黄图片.jpg",
        type: [1],
      },
      {
        path: "大黄/090_大黄性状鉴别.jpg",
        type: [1],
      },
      {
        path: "大黄/110_掌叶大黄药材.jpg",
        type: [1],
      },
      {
        path: "大黄/130_掌叶大黄饮片.jpg",
        type: [1],
      },
      {
        path: "大黄/150_去皮唐古特大黄药材.jpg",
        type: [1],
      },
      {
        path: "大黄/170_唐古特大黄横切片.jpg",
        type: [1],
      },
      {
        path: "大黄/190_药用大黄饮片.jpg",
        type: [1],
      },
      {
        path: "大黄/210_掌叶大黄.jpg",
        type: [1],
      },
      {
        path: "大黄/230_掌叶大黄.jpg",
        type: [1],
      },
      {
        path: "大黄/250_唐古特大黄.jpg",
        type: [1],
      },
      {
        path: "大黄/270_唐古特大黄.jpg",
        type: [1],
      },
      {
        path: "大黄/290_华北大黄.jpg",
        type: [1],
      },
      {
        path: "大黄/310_藏边大黄.jpg",
        type: [1],
      },
      {
        path: "大黄/330_河套大黄.jpg",
        type: [1],
      },
      {
        path: "大黄/350_天山大黄.jpg",
        type: [1],
      },
      {
        path: "大黄/370_土大黄.jpg",
        type: [1],
      },
      {
        path: "大黄/390_大黄伪品：山大黄.jpg",
        type: [1],
      },
      {
        path: "大黄/410_土大黄.jpg",
        type: [1],
      },
      {
        path: "大黄/430_信州大黄.jpg",
        type: [1],
      },
      {
        path: "大黄/450_心叶大黄.jpg",
        type: [1],
      },
      {
        path: "大黄/470_高山大黄.jpg",
        type: [1],
      },
      {
        path: "大黄/490_卵果大黄.jpg",
        type: [1],
      },
      {
        path: "大黄/510_大黄饮片.jpg",
        type: [1],
      },
      {
        path: "大黄/530_酒大黄饮片.jpg",
        type: [1],
      },
      {
        path: "大黄/550_孰大黄饮片.jpg",
        type: [1],
      },
      {
        path: "大黄/570_大黄炭饮片.jpg",
        type: [1],
      },
      {
        path: "大黄/590_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "天仙子",
    files: [
      {
        path: "天仙子/010_莨菪植物.jpg",
        type: [1],
      },
      {
        path: "天仙子/030_天仙子药材.jpg",
        type: [1],
      },
      {
        path: "天仙子/050_天仙子性状鉴别.jpg",
        type: [1],
      },
      {
        path: "天仙子/070_水蓑衣种子.jpg",
        type: [1],
      },
      {
        path: "天仙子/090_水蓑衣种子.jpg",
        type: [1],
      },
      {
        path: "天仙子/110_中亚天仙子.jpg",
        type: [1],
      },
      {
        path: "天仙子/130_麦瓶花子.jpg",
        type: [1],
      },
      {
        path: "天仙子/150_天仙子.jpg",
        type: [1],
      },
      {
        path: "天仙子/170_南天仙子.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "天仙藤",
    files: [
      {
        path: "天仙藤/010_北马兜铃植物.jpg",
        type: [1],
      },
      {
        path: "天仙藤/030_马兜铃植物.jpg",
        type: [1],
      },
      {
        path: "天仙藤/050_天仙藤药材.jpg",
        type: [1],
      },
      {
        path: "天仙藤/070_天仙藤.jpg",
        type: [1],
      },
      {
        path: "天仙藤/090_天仙藤.jpg",
        type: [1],
      },
      {
        path: "天仙藤/110_天仙藤.jpg",
        type: [1],
      },
      {
        path: "天仙藤/130_天仙藤.jpg",
        type: [1],
      },
      {
        path: "天仙藤/150_天仙藤饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "天冬",
    files: [
      {
        path: "天冬/000_补虚药_天冬.jpg",
        type: [1],
      },
      {
        path: "天冬/010_天冬植物.jpg",
        type: [1],
      },
      {
        path: "天冬/030_天冬鲜药材.jpg",
        type: [1],
      },
      {
        path: "天冬/050_天冬药材.jpg",
        type: [1],
      },
      {
        path: "天冬/070_天冬鉴别.jpg",
        type: [1],
      },
      {
        path: "天冬/090_羊齿天门冬.jpg",
        type: [2],
      },
      {
        path: "天冬/110_天冬饮片.jpg",
        type: [1],
      },
      {
        path: "天冬/130_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "天南星",
    files: [
      {
        path: "天南星/000_化痰药_半夏.jpg",
        type: [1],
      },
      {
        path: "天南星/000_化痰药_天南星.jpg",
        type: [1],
      },
      {
        path: "天南星/000_化痰药_天南星2.jpg",
        type: [1],
      },
      {
        path: "天南星/010_天南星.jpg",
        type: [1],
      },
      {
        path: "天南星/030_异叶天南星.jpg",
        type: [1],
      },
      {
        path: "天南星/050_东北天南星.jpg",
        type: [1],
      },
      {
        path: "天南星/070_天南星.jpg",
        type: [1],
      },
      {
        path: "天南星/090_天南星性状鉴别.jpg",
        type: [1],
      },
      {
        path: "天南星/110_螃蟹七.jpg",
        type: [1],
      },
      {
        path: "天南星/130_虎掌南星.jpg",
        type: [1],
      },
      {
        path: "天南星/150_天南星与伪品虎掌南星.jpg",
        type: [1],
      },
      {
        path: "天南星/170_象南星.jpg",
        type: [1],
      },
      {
        path: "天南星/190_朝鲜南星.jpg",
        type: [1],
      },
      {
        path: "天南星/210_黄苞南星.jpg",
        type: [1],
      },
      {
        path: "天南星/230_制天南星饮片.jpg",
        type: [1],
      },
      {
        path: "天南星/250_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "天名精",
    files: [
      {
        path: "天名精/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "天山雪莲",
    files: [
      {
        path: "天山雪莲/010_天山雪莲.jpg",
        type: [1],
      },
      {
        path: "天山雪莲/030_天山雪莲药材.jpg",
        type: [1],
      },
      {
        path: "天山雪莲/050_天山雪莲.jpg",
        type: [1],
      },
      {
        path: "天山雪莲/070_天山雪莲性状鉴别.jpg",
        type: [1],
      },
      {
        path: "天山雪莲/090_雪莲品种.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "天竺黄",
    files: [
      {
        path: "天竺黄/010_青皮竹.jpg",
        type: [1],
      },
      {
        path: "天竺黄/030_华思劳竹.jpg",
        type: [1],
      },
      {
        path: "天竺黄/050_天竺黄药材.jpg",
        type: [1],
      },
      {
        path: "天竺黄/070_天竺黄药材.jpg",
        type: [1],
      },
      {
        path: "天竺黄/090_天竺黄.jpg",
        type: [1],
      },
      {
        path: "天竺黄/110_天竺黄性状鉴别.jpg",
        type: [1],
      },
      {
        path: "天竺黄/130_天竺黄与人工天竺黄对比（人工天竺黄为非药典品）.jpg",
        type: [1],
      },
      {
        path: "天竺黄/150_伪品竹花（竹黄）.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "天花粉",
    files: [
      {
        path: "天花粉/000_清热药_天花粉.jpg",
        type: [1],
      },
      {
        path: "天花粉/010_栝楼植物.jpg",
        type: [1],
      },
      {
        path: "天花粉/030_双边栝楼.jpg",
        type: [1],
      },
      {
        path: "天花粉/050_天花粉药材.jpg",
        type: [1],
      },
      {
        path: "天花粉/070_天花粉饮片.jpg",
        type: [1],
      },
      {
        path: "天花粉/090_天花粉饮片.jpg",
        type: [1],
      },
      {
        path: "天花粉/110_天花粉.jpg",
        type: [1],
      },
      {
        path: "天花粉/130_天花粉特征.jpg",
        type: [1],
      },
      {
        path: "天花粉/150_天花粉性状鉴别.jpg",
        type: [1],
      },
      {
        path: "天花粉/170_栝楼.jpg",
        type: [1],
      },
      {
        path: "天花粉/190_栝楼表面观与切面观.jpg",
        type: [1],
      },
      {
        path: "天花粉/210_双边栝楼.jpg",
        type: [1],
      },
      {
        path: "天花粉/230_茅瓜.jpg",
        type: [1],
      },
      {
        path: "天花粉/250_长萼栝楼.jpg",
        type: [1],
      },
      {
        path: "天花粉/270_南方栝楼.jpg",
        type: [1],
      },
      {
        path: "天花粉/290_湖北栝楼未去外皮.jpg",
        type: [1],
      },
      {
        path: "天花粉/310_湖北栝楼纵片.jpg",
        type: [1],
      },
      {
        path: "天花粉/330_王瓜.jpg",
        type: [1],
      },
      {
        path: "天花粉/350_木鳖.jpg",
        type: [1],
      },
      {
        path: "天花粉/370_木鳖纵切片.jpg",
        type: [1],
      },
      {
        path: "天花粉/390_赤雹属一种.jpg",
        type: [1],
      },
      {
        path: "天花粉/410_罗汉果根.jpg",
        type: [1],
      },
      {
        path: "天花粉/430_罗汉果根纵切.jpg",
        type: [1],
      },
      {
        path: "天花粉/450_白首乌.jpg",
        type: [1],
      },
      {
        path: "天花粉/470_粉防己.jpg",
        type: [1],
      },
      {
        path: "天花粉/490_天花粉饮片.jpg",
        type: [1],
      },
      {
        path: "天花粉/510_天花粉饮片.jpg",
        type: [1],
      },
      {
        path: "天花粉/530_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "天葵子",
    files: [
      {
        path: "天葵子/010_天葵植物.jpg",
        type: [1],
      },
      {
        path: "天葵子/030_天葵子药材.jpg",
        type: [1],
      },
      {
        path: "天葵子/050_天葵子.jpg",
        type: [1],
      },
      {
        path: "天葵子/070_天葵子.jpg",
        type: [1],
      },
      {
        path: "天葵子/090_天葵子.jpg",
        type: [1],
      },
      {
        path: "天葵子/110_天葵子.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "天雄",
    files: [
      {
        path: "天雄/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "天麻",
    files: [
      {
        path: "天麻/000_熄风止痉药_天麻.jpg",
        type: [1],
      },
      {
        path: "天麻/000_熄风止痉药_天麻切片.jpg",
        type: [1],
      },
      {
        path: "天麻/010_天麻植物.jpg",
        type: [1],
      },
      {
        path: "天麻/030_鲜天麻.jpg",
        type: [1],
      },
      {
        path: "天麻/050_天麻药材.jpg",
        type: [1],
      },
      {
        path: "天麻/070_天麻的性状鉴别.jpg",
        type: [1],
      },
      {
        path: "天麻/090_天麻的性状鉴别.jpg",
        type: [1],
      },
      {
        path: "天麻/110_天麻伪品：大理菊.jpg",
        type: [2],
      },
      {
        path: "天麻/130_天麻伪品：仿天麻环纹的马铃薯.jpg",
        type: [2],
      },
      {
        path: "天麻/150_天麻伪品：紫茉莉.jpg",
        type: [2],
      },
      {
        path: "天麻/170_天麻伪品：羽裂蟹甲草.jpg",
        type: [2],
      },
      {
        path: "天麻/190_天麻伪品：马铃薯.jpg",
        type: [2],
      },
      {
        path: "天麻/210_天麻伪品：大股九牛.jpg",
        type: [2],
      },
      {
        path: "天麻/230_天麻伪品：天花粉.jpg",
        type: [2],
      },
      {
        path: "天麻/250_天麻饮片.jpg",
        type: [1],
      },
      {
        path: "天麻/270_天麻片正品.jpg",
        type: [1],
      },
      {
        path: "天麻/290_伪品芭蕉芋.jpg",
        type: [2],
      },
      {
        path: "天麻/310_上三片为正品，下三片为芭蕉芋.jpg",
        type: [1],
      },
      {
        path: "天麻/330_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "天鼠屎",
    files: [
      {
        path: "天鼠屎/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "太一余粮",
    files: [
      {
        path: "太一余粮/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "太子参",
    files: [
      {
        path: "太子参/010_孩儿参植物.jpg",
        type: [1],
      },
      {
        path: "太子参/030_太子参药材.jpg",
        type: [1],
      },
      {
        path: "太子参/050_太子参性状鉴别.jpg",
        type: [1],
      },
      {
        path: "太子参/070_石生蝇子草.jpg",
        type: [1],
      },
      {
        path: "太子参/090_淡竹叶的根.jpg",
        type: [1],
      },
      {
        path: "太子参/110_菜头肾的根.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "奄闾子",
    files: [
      {
        path: "奄闾子/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "女菀",
    files: [
      {
        path: "女菀/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "女贞子",
    files: [
      {
        path: "女贞子/000_补虚药_女贞子.jpg",
        type: [1],
      },
      {
        path: "女贞子/010_女贞植物.jpg",
        type: [1],
      },
      {
        path: "女贞子/030_女贞子药材.jpg",
        type: [1],
      },
      {
        path: "女贞子/050_女贞子（椭圆形）后期采收.jpg",
        type: [1],
      },
      {
        path: "女贞子/070_女贞子性状鉴别.jpg",
        type: [1],
      },
      {
        path: "女贞子/090_女贞子.jpg",
        type: [1],
      },
      {
        path: "女贞子/110_小蜡.jpg",
        type: [2],
      },
      {
        path: "女贞子/130_陕西荚蒾.jpg",
        type: [2],
      },
      {
        path: "女贞子/150_蒙古荚蒾.jpg",
        type: [2],
      },
      {
        path: "女贞子/170_酒女贞子.jpg",
        type: [1],
      },
      {
        path: "女贞子/190_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "女青",
    files: [
      {
        path: "女青/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "委陵菜",
    files: [
      {
        path: "委陵菜/010_委陵菜植物.jpg",
        type: [1],
      },
      {
        path: "委陵菜/030_委陵菜.jpg",
        type: [1],
      },
      {
        path: "委陵菜/050_委陵菜.jpg",
        type: [1],
      },
      {
        path: "委陵菜/070_委陵菜.jpg",
        type: [1],
      },
      {
        path: "委陵菜/090_委陵菜性状鉴别.jpg",
        type: [1],
      },
      {
        path: "委陵菜/110_委陵菜与翻白草比较.jpg",
        type: [1],
      },
      {
        path: "委陵菜/130_左委陵菜  右翻白草.jpg",
        type: [1],
      },
      {
        path: "委陵菜/150_委陵菜饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "姜皮",
    files: [
      {
        path: "姜皮/010_姜植物.jpg",
        type: [1],
      },
      {
        path: "姜皮/030_姜皮药材.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "姜黄",
    files: [
      {
        path: "姜黄/000_活血药_姜黄.jpg",
        type: [1],
      },
      {
        path: "姜黄/010_姜黄植物.jpg",
        type: [1],
      },
      {
        path: "姜黄/030_姜黄花.jpg",
        type: [1],
      },
      {
        path: "姜黄/050_姜黄药材.jpg",
        type: [1],
      },
      {
        path: "姜黄/070_正品川姜黄，产地四川，与黄丝郁金同一来源.jpg",
        type: [1],
      },
      {
        path: "姜黄/090_姜黄药材（肚姜黄）.jpg",
        type: [1],
      },
      {
        path: "姜黄/110_姜黄药材（条姜黄）.jpg",
        type: [1],
      },
      {
        path: "姜黄/130_姜黄饮片.jpg",
        type: [1],
      },
      {
        path: "姜黄/150_姜黄饮片.jpg",
        type: [1],
      },
      {
        path: "姜黄/170_姜黄.jpg",
        type: [1],
      },
      {
        path: "姜黄/190_姜黄性状鉴别.jpg",
        type: [1],
      },
      {
        path: "姜黄/210_姜黄、莪术、郁金、片姜黄的来源.jpg",
        type: [1],
      },
      {
        path: "姜黄/230_片姜黄.jpg",
        type: [1],
      },
      {
        path: "姜黄/250_姜黄非正品（进口+云、缅、广西）.jpg",
        type: [1],
      },
      {
        path: "姜黄/270_姜黄饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "威灵仙",
    files: [
      {
        path: "威灵仙/010_威灵仙.jpg",
        type: [1],
      },
      {
        path: "威灵仙/030_棉团铁线莲.jpg",
        type: [1],
      },
      {
        path: "威灵仙/050_东北铁线莲.jpg",
        type: [1],
      },
      {
        path: "威灵仙/070_威灵仙.jpg",
        type: [1],
      },
      {
        path: "威灵仙/090_棉团铁线莲.jpg",
        type: [1],
      },
      {
        path: "威灵仙/110_东北铁线莲.jpg",
        type: [1],
      },
      {
        path: "威灵仙/130_威灵仙特征.jpg",
        type: [1],
      },
      {
        path: "威灵仙/150_威灵仙.jpg",
        type: [1],
      },
      {
        path: "威灵仙/170_东北铁线莲.jpg",
        type: [1],
      },
      {
        path: "威灵仙/190_威灵仙性状鉴别.jpg",
        type: [1],
      },
      {
        path: "威灵仙/210_小灵仙.jpg",
        type: [1],
      },
      {
        path: "威灵仙/230_正品与伪品对比图.jpg",
        type: [1],
      },
      {
        path: "威灵仙/250_显脉旋覆花.jpg",
        type: [1],
      },
      {
        path: "威灵仙/270_草珊瑚根.jpg",
        type: [1],
      },
      {
        path: "威灵仙/290_威灵仙及混伪情况.jpg",
        type: [1],
      },
      {
        path: "威灵仙/310_威灵仙及混伪品性状比较.jpg",
        type: [1],
      },
      {
        path: "威灵仙/330_柱果威灵仙.jpg",
        type: [1],
      },
      {
        path: "威灵仙/350_山木通.jpg",
        type: [1],
      },
      {
        path: "威灵仙/370_单叶铁线莲.jpg",
        type: [1],
      },
      {
        path: "威灵仙/390_短柄拔葜.jpg",
        type: [1],
      },
      {
        path: "威灵仙/410_华东拔葜.jpg",
        type: [1],
      },
      {
        path: "威灵仙/430_鞘柄拔葜.jpg",
        type: [1],
      },
      {
        path: "威灵仙/450_黑叶拔葜饮片.jpg",
        type: [1],
      },
      {
        path: "威灵仙/470_云南兔耳风.jpg",
        type: [1],
      },
      {
        path: "威灵仙/490_威灵仙.jpg",
        type: [1],
      },
      {
        path: "威灵仙/510_鬼臼.jpg",
        type: [1],
      },
      {
        path: "威灵仙/530_威灵仙饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "娑罗子",
    files: [
      {
        path: "娑罗子/010_七叶树植物.jpg",
        type: [1],
      },
      {
        path: "娑罗子/030_浙江七叶树植物.jpg",
        type: [1],
      },
      {
        path: "娑罗子/050_天师栗植物.jpg",
        type: [1],
      },
      {
        path: "娑罗子/070_娑罗子.jpg",
        type: [1],
      },
      {
        path: "娑罗子/090_娑罗子.jpg",
        type: [1],
      },
      {
        path: "娑罗子/110_娑罗子.jpg",
        type: [1],
      },
      {
        path: "娑罗子/130_娑罗子.jpg",
        type: [1],
      },
      {
        path: "娑罗子/150_娑罗子.jpg",
        type: [1],
      },
      {
        path: "娑罗子/170_娑罗子切片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "孔公孽",
    files: [
      {
        path: "孔公孽/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "安息香",
    files: [
      {
        path: "安息香/010_白花树植物.jpg",
        type: [1],
      },
      {
        path: "安息香/030_安息香药材.jpg",
        type: [1],
      },
      {
        path: "安息香/050_安息香.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "密蒙花",
    files: [
      {
        path: "密蒙花/010_密蒙花植物.jpg",
        type: [1],
      },
      {
        path: "密蒙花/030_密蒙花.jpg",
        type: [1],
      },
      {
        path: "密蒙花/050_密蒙花药材.jpg",
        type: [1],
      },
      {
        path: "密蒙花/070_密蒙花药材.jpg",
        type: [1],
      },
      {
        path: "密蒙花/090_易混淆品结香.jpg",
        type: [1],
      },
      {
        path: "密蒙花/110_易混淆品结香.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "寻骨风",
    files: [
      {
        path: "寻骨风/010_绵毛马兜铃植物.jpg",
        type: [1],
      },
      {
        path: "寻骨风/030_寻骨风.jpg",
        type: [1],
      },
      {
        path: "寻骨风/050_寻骨风.jpg",
        type: [1],
      },
      {
        path: "寻骨风/070_寻骨风药材.jpg",
        type: [1],
      },
      {
        path: "寻骨风/090_寻骨风叶上表面.jpg",
        type: [1],
      },
      {
        path: "寻骨风/110_寻骨风叶下表面.jpg",
        type: [1],
      },
      {
        path: "寻骨风/130_寻骨风茎.jpg",
        type: [1],
      },
      {
        path: "寻骨风/150_寻骨风饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "射干",
    files: [
      {
        path: "射干/000_清热药_射干.jpg",
        type: [1],
      },
      {
        path: "射干/010_射干植物.jpg",
        type: [1],
      },
      {
        path: "射干/030_射干药材.jpg",
        type: [1],
      },
      {
        path: "射干/050_射干性状鉴别.jpg",
        type: [1],
      },
      {
        path: "射干/070_射干饮片.jpg",
        type: [1],
      },
      {
        path: "射干/090_射干饮片断面放大图.jpg",
        type: [1],
      },
      {
        path: "射干/110_鸢尾植物.jpg",
        type: [1],
      },
      {
        path: "射干/130_川射干药材.jpg",
        type: [1],
      },
      {
        path: "射干/150_川射干鲜切片.jpg",
        type: [1],
      },
      {
        path: "射干/170_川射干饮片.jpg",
        type: [1],
      },
      {
        path: "射干/190_上川射干下射干.jpg",
        type: [1],
      },
      {
        path: "射干/210_白射干.jpg",
        type: [1],
      },
      {
        path: "射干/230_扁竹根.jpg",
        type: [1],
      },
      {
        path: "射干/250_卷叶黄精.jpg",
        type: [1],
      },
      {
        path: "射干/270_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "小叶莲",
    files: [
      {
        path: "小叶莲/010_桃儿七植物.jpg",
        type: [1],
      },
      {
        path: "小叶莲/030_小叶莲.jpg",
        type: [1],
      },
      {
        path: "小叶莲/050_小叶莲.jpg",
        type: [1],
      },
      {
        path: "小叶莲/070_小叶莲.jpg",
        type: [1],
      },
      {
        path: "小叶莲/090_小叶莲.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "小檗皮",
    files: [
      {
        path: "小檗皮/010_黄栌木植物.jpg",
        type: [1],
      },
      {
        path: "小檗皮/030_小檗皮.jpg",
        type: [1],
      },
      {
        path: "小檗皮/050_小檗皮.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "小茴香",
    files: [
      {
        path: "小茴香/010_茴香植物.jpg",
        type: [1],
      },
      {
        path: "小茴香/030_小茴香药材.jpg",
        type: [1],
      },
      {
        path: "小茴香/050_小茴香.jpg",
        type: [1],
      },
      {
        path: "小茴香/070_小茴香伪品-藏茴香.jpg",
        type: [1],
      },
      {
        path: "小茴香/090_小茴香伪品-莳萝.jpg",
        type: [1],
      },
      {
        path: "小茴香/110_小茴香伪品-毒芹.jpg",
        type: [1],
      },
      {
        path: "小茴香/130_小茴香伪品-孜然芹.jpg",
        type: [1],
      },
      {
        path: "小茴香/150_小茴香伪品-防风.jpg",
        type: [1],
      },
      {
        path: "小茴香/170_盐小茴香.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "小蓟",
    files: [
      {
        path: "小蓟/010_刺儿菜.jpg",
        type: [1],
      },
      {
        path: "小蓟/030_小蓟药材.jpg",
        type: [1],
      },
      {
        path: "小蓟/050_小蓟.jpg",
        type: [1],
      },
      {
        path: "小蓟/070_小蓟.jpg",
        type: [1],
      },
      {
        path: "小蓟/090_小蓟.jpg",
        type: [1],
      },
      {
        path: "小蓟/110_小蓟性状鉴别.jpg",
        type: [1],
      },
      {
        path: "小蓟/130_小蓟.jpg",
        type: [1],
      },
      {
        path: "小蓟/150_大蓟.jpg",
        type: [1],
      },
      {
        path: "小蓟/170_苣荬菜.jpg",
        type: [1],
      },
      {
        path: "小蓟/190_小蓟饮片.jpg",
        type: [1],
      },
      {
        path: "小蓟/210_小蓟炭.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "小通草",
    files: [
      {
        path: "小通草/010_喜马山旌节花植物.jpg",
        type: [1],
      },
      {
        path: "小通草/030_中国旌节花植物.jpg",
        type: [1],
      },
      {
        path: "小通草/050_青荚叶植物.jpg",
        type: [1],
      },
      {
        path: "小通草/070_小通草药材.jpg",
        type: [1],
      },
      {
        path: "小通草/090_小通草(青荚叶）.jpg",
        type: [1],
      },
      {
        path: "小通草/110_小通草（喜马山旌节花）.jpg",
        type: [1],
      },
      {
        path: "小通草/130_小通草.jpg",
        type: [1],
      },
      {
        path: "小通草/150_伪品：绣球小通草.jpg",
        type: [1],
      },
      {
        path: "小通草/170_小通草与伪品对比图.jpg",
        type: [1],
      },
      {
        path: "小通草/190_小通草与伪品对比.jpg",
        type: [1],
      },
      {
        path: "小通草/210_伪品绣球小通草.jpg",
        type: [1],
      },
      {
        path: "小通草/230_小通草段.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "小驳骨",
    files: [
      {
        path: "小驳骨/010_小驳骨植物.jpg",
        type: [1],
      },
      {
        path: "小驳骨/030_小驳骨.jpg",
        type: [1],
      },
      {
        path: "小驳骨/050_小驳骨.jpg",
        type: [1],
      },
      {
        path: "小驳骨/070_小驳骨.jpg",
        type: [1],
      },
      {
        path: "小驳骨/090_小驳骨.jpg",
        type: [1],
      },
      {
        path: "小驳骨/110_小驳骨.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "小麦",
    files: [
      {
        path: "小麦/000_收涩药_浮小麦.jpg",
        type: [1],
      },
      {
        path: "小麦/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "屈草",
    files: [
      {
        path: "屈草/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "山慈菇",
    files: [
      {
        path: "山慈菇/010_杜鹃兰植物.jpg",
        type: [1],
      },
      {
        path: "山慈菇/030_独蒜兰植物.jpg",
        type: [1],
      },
      {
        path: "山慈菇/050_云南独蒜兰植物.jpg",
        type: [1],
      },
      {
        path: "山慈菇/070_毛慈菇药材.jpg",
        type: [1],
      },
      {
        path: "山慈菇/090_冰球子药材.jpg",
        type: [1],
      },
      {
        path: "山慈菇/110_冰球子.jpg",
        type: [1],
      },
      {
        path: "山慈菇/130_毛慈菇.jpg",
        type: [1],
      },
      {
        path: "山慈菇/150_冰球子.jpg",
        type: [1],
      },
      {
        path: "山慈菇/170_毛慈菇.jpg",
        type: [1],
      },
      {
        path: "山慈菇/190_冰球子.jpg",
        type: [1],
      },
      {
        path: "山慈菇/210_毛慈菇.jpg",
        type: [1],
      },
      {
        path: "山慈菇/230_冰球子.jpg",
        type: [1],
      },
      {
        path: "山慈菇/250_毛慈菇性状鉴别.jpg",
        type: [1],
      },
      {
        path: "山慈菇/270_伪品小白及.jpg",
        type: [1],
      },
      {
        path: "山慈菇/290_伪品山兰.jpg",
        type: [1],
      },
      {
        path: "山慈菇/310_伪品光茨菇.jpg",
        type: [1],
      },
      {
        path: "山慈菇/330_丽江山慈菇网图，或为未去皮的冰球子，待考证.jpg",
        type: [1],
      },
      {
        path: "山慈菇/350_茨菇鲜品.jpg",
        type: [1],
      },
      {
        path: "山慈菇/370_山慈菇饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "山柰",
    files: [
      {
        path: "山柰/010_山柰植物.jpg",
        type: [1],
      },
      {
        path: "山柰/030_山柰饮片.jpg",
        type: [1],
      },
      {
        path: "山柰/050_山柰饮片.jpg",
        type: [1],
      },
      {
        path: "山柰/070_山柰.jpg",
        type: [1],
      },
      {
        path: "山柰/090_山柰性状鉴别.jpg",
        type: [1],
      },
      {
        path: "山柰/110_苦山柰.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "山楂",
    files: [
      {
        path: "山楂/010_山里红.jpg",
        type: [1],
      },
      {
        path: "山楂/030_山楂植物.jpg",
        type: [1],
      },
      {
        path: "山楂/050_山里红、山楂叶与果实对比.jpg",
        type: [1],
      },
      {
        path: "山楂/070_山楂药材.jpg",
        type: [1],
      },
      {
        path: "山楂/090_山楂性状鉴别.jpg",
        type: [1],
      },
      {
        path: "山楂/110_山里红、山楂、南山楂对比.jpg",
        type: [1],
      },
      {
        path: "山楂/130_野山楂植物.jpg",
        type: [1],
      },
      {
        path: "山楂/150_南山楂.jpg",
        type: [1],
      },
      {
        path: "山楂/170_林檎.jpg",
        type: [1],
      },
      {
        path: "山楂/190_炒山楂.jpg",
        type: [1],
      },
      {
        path: "山楂/210_焦山楂.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "山楂叶",
    files: [
      {
        path: "山楂叶/010_山里红.jpg",
        type: [1],
      },
      {
        path: "山楂叶/030_山楂植物.jpg",
        type: [1],
      },
      {
        path: "山楂叶/050_山楂叶药材.jpg",
        type: [1],
      },
      {
        path: "山楂叶/070_山楂叶药材.jpg",
        type: [1],
      },
      {
        path: "山楂叶/090_山楂叶（山里红）.jpg",
        type: [1],
      },
      {
        path: "山楂叶/110_山楂叶（山楂）.jpg",
        type: [1],
      },
      {
        path: "山楂叶/130_山楂叶（山里红）.jpg",
        type: [1],
      },
      {
        path: "山楂叶/150_山楂叶（山里红）.jpg",
        type: [1],
      },
      {
        path: "山楂叶/170_山楂叶（山楂）.jpg",
        type: [1],
      },
      {
        path: "山楂叶/190_山楂叶性状鉴别.jpg",
        type: [1],
      },
      {
        path: "山楂叶/210_野山楂叶.jpg",
        type: [1],
      },
      {
        path: "山楂叶/230_湖北山楂叶.jpg",
        type: [1],
      },
      {
        path: "山楂叶/250_云南山楂（广西产）.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "山茱萸",
    files: [
      {
        path: "山茱萸/000_收涩药_山茱萸.jpg",
        type: [1],
      },
      {
        path: "山茱萸/010_山茱萸花.jpg",
        type: [1],
      },
      {
        path: "山茱萸/030_山茱萸植物.jpg",
        type: [1],
      },
      {
        path: "山茱萸/050_山茱萸果实.jpg",
        type: [1],
      },
      {
        path: "山茱萸/070_山茱萸药材.jpg",
        type: [1],
      },
      {
        path: "山茱萸/090_山茱萸性状鉴别.jpg",
        type: [1],
      },
      {
        path: "山茱萸/110_山茱萸与其杂质（果核与果柄）.jpg",
        type: [1],
      },
      {
        path: "山茱萸/130_山楂皮及山茱萸果核.jpg",
        type: [1],
      },
      {
        path: "山茱萸/150_山葡萄皮.jpg",
        type: [1],
      },
      {
        path: "山茱萸/170_葡萄皮.jpg",
        type: [1],
      },
      {
        path: "山茱萸/190_掺矾山.jpg",
        type: [1],
      },
      {
        path: "山茱萸/210_酒萸肉.jpg",
        type: [1],
      },
      {
        path: "山茱萸/230_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "山药",
    files: [
      {
        path: "山药/000_补虚药_山药.jpg",
        type: [1],
      },
      {
        path: "山药/010_山药植物.jpg",
        type: [1],
      },
      {
        path: "山药/030_山药.jpg",
        type: [1],
      },
      {
        path: "山药/050_零余子.jpg",
        type: [1],
      },
      {
        path: "山药/070_鲜山药.jpg",
        type: [1],
      },
      {
        path: "山药/090_毛山药药材.jpg",
        type: [1],
      },
      {
        path: "山药/110_山药饮片和山药片（鲜切干燥）.jpg",
        type: [1],
      },
      {
        path: "山药/130_光山药药材.jpg",
        type: [1],
      },
      {
        path: "山药/150_山药性状.jpg",
        type: [1],
      },
      {
        path: "山药/170_天花粉.jpg",
        type: [2],
      },
      {
        path: "山药/190_天花粉表面观与切面观.jpg",
        type: [2],
      },
      {
        path: "山药/210_参薯.jpg",
        type: [2],
      },
      {
        path: "山药/230_山药伪品（番薯横切片）.jpg",
        type: [2],
      },
      {
        path: "山药/250_山药伪品（番薯纵切片）.jpg",
        type: [2],
      },
      {
        path: "山药/270_山药伪品（木薯）.jpg",
        type: [2],
      },
      {
        path: "山药/290_山药伪品（木薯横切片）.jpg",
        type: [2],
      },
      {
        path: "山药/310_山药伪品（山薯）.jpg",
        type: [2],
      },
      {
        path: "山药/330_山药伪品（山薯横切片）.jpg",
        type: [2],
      },
      {
        path: "山药/350_山药伪品（山薯斜切片）.jpg",
        type: [2],
      },
      {
        path: "山药/370_山药伪品（山薯纵切片）.jpg",
        type: [2],
      },
      {
        path: "山药/390_山药片（鲜切片）.jpg",
        type: [1],
      },
      {
        path: "山药/410_山药片（光山药切片）.jpg",
        type: [1],
      },
      {
        path: "山药/430_山药片（毛山药切片）.jpg",
        type: [1],
      },
      {
        path: "山药/450_麸炒山药.jpg",
        type: [1],
      },
      {
        path: "山药/470_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "山豆根",
    files: [
      {
        path: "山豆根/010_越南槐.jpg",
        type: [1],
      },
      {
        path: "山豆根/030_山豆根药材.jpg",
        type: [1],
      },
      {
        path: "山豆根/050_山豆根个子货、饮片及断面放大.jpg",
        type: [1],
      },
      {
        path: "山豆根/070_山豆根切片放大（月饼边）.jpg",
        type: [1],
      },
      {
        path: "山豆根/090_山豆根.jpg",
        type: [1],
      },
      {
        path: "山豆根/110_山豆根性状鉴别.jpg",
        type: [1],
      },
      {
        path: "山豆根/130_山豆根性状鉴别.jpg",
        type: [1],
      },
      {
        path: "山豆根/150_北豆根.jpg",
        type: [1],
      },
      {
        path: "山豆根/170_山豆根.jpg",
        type: [1],
      },
      {
        path: "山豆根/190_北豆根与山豆根个子对比（上：北豆根）.jpg",
        type: [1],
      },
      {
        path: "山豆根/210_北豆根与山豆根个子对比（上：山豆根）.jpg",
        type: [1],
      },
      {
        path: "山豆根/230_山豆根、北豆根断面对比（右：北豆根）.jpg",
        type: [1],
      },
      {
        path: "山豆根/250_华东木蓝根.jpg",
        type: [1],
      },
      {
        path: "山豆根/270_木蓝山豆根.jpg",
        type: [1],
      },
      {
        path: "山豆根/290_北豆根.jpg",
        type: [1],
      },
      {
        path: "山豆根/310_苦豆根，又名西豆根.jpg",
        type: [1],
      },
      {
        path: "山豆根/330_四种豆根对比图.jpg",
        type: [1],
      },
      {
        path: "山豆根/350_山豆根与伪品的区别.jpg",
        type: [1],
      },
      {
        path: "山豆根/370_山豆根伪品.jpg",
        type: [1],
      },
      {
        path: "山豆根/390_山豆根伪品.jpg",
        type: [1],
      },
      {
        path: "山豆根/410_山豆根伪品.jpg",
        type: [1],
      },
      {
        path: "山豆根/430_山豆根伪品.jpg",
        type: [1],
      },
      {
        path: "山豆根/450_山豆根伪品.jpg",
        type: [1],
      },
      {
        path: "山豆根/470_山豆根伪品.jpg",
        type: [1],
      },
      {
        path: "山豆根/490_山豆根劣质品.jpg",
        type: [1],
      },
      {
        path: "山豆根/510_山豆根与伪品对比图.jpg",
        type: [1],
      },
      {
        path: "山豆根/530_山豆根饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "山香圆叶",
    files: [
      {
        path: "山香圆叶/010_山香圆植物.jpg",
        type: [1],
      },
      {
        path: "山香圆叶/030_山香圆叶.jpg",
        type: [1],
      },
      {
        path: "山香圆叶/050_山香圆叶.jpg",
        type: [1],
      },
      {
        path: "山香圆叶/070_山香圆叶.jpg",
        type: [1],
      },
      {
        path: "山香圆叶/090_山香圆叶.jpg",
        type: [1],
      },
      {
        path: "山香圆叶/110_山香圆叶饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "岗梅根",
    files: [
      {
        path: "岗梅根/010_岗梅植物.jpg",
        type: [1],
      },
      {
        path: "岗梅根/030_岗梅根药材.jpg",
        type: [1],
      },
      {
        path: "岗梅根/050_岗梅根药材.jpg",
        type: [1],
      },
      {
        path: "岗梅根/070_岗梅根饮片.jpg",
        type: [1],
      },
      {
        path: "岗梅根/090_岗梅根饮片.jpg",
        type: [1],
      },
      {
        path: "岗梅根/110_岗梅根饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "岩白菜",
    files: [
      {
        path: "岩白菜/010_岩白菜植物.jpg",
        type: [1],
      },
      {
        path: "岩白菜/030_岩白菜药材.jpg",
        type: [1],
      },
      {
        path: "岩白菜/050_岩白菜药材.jpg",
        type: [1],
      },
      {
        path: "岩白菜/070_岩白菜.jpg",
        type: [1],
      },
      {
        path: "岩白菜/090_岩白菜.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "岩陀",
    files: [
      {
        path: "岩陀/010_西南鬼灯檠.jpg",
        type: [1],
      },
      {
        path: "岩陀/030_羽叶鬼灯檠.jpg",
        type: [1],
      },
      {
        path: "岩陀/050_岩陀药材.jpg",
        type: [1],
      },
      {
        path: "岩陀/070_岩陀药材.jpg",
        type: [1],
      },
      {
        path: "岩陀/090_岩陀饮片.jpg",
        type: [1],
      },
      {
        path: "岩陀/110_岩陀饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "川乌",
    files: [
      {
        path: "川乌/010_乌头植物.jpg",
        type: [1],
      },
      {
        path: "川乌/030_乌头鲜根.jpg",
        type: [1],
      },
      {
        path: "川乌/050_去除子根后的母根，鲜川乌.jpg",
        type: [1],
      },
      {
        path: "川乌/070_鲜川乌纵切片和横切片.jpg",
        type: [1],
      },
      {
        path: "川乌/090_乌头根.jpg",
        type: [1],
      },
      {
        path: "川乌/110_乌头根.jpg",
        type: [1],
      },
      {
        path: "川乌/130_川乌药材.jpg",
        type: [1],
      },
      {
        path: "川乌/150_生川乌药材.jpg",
        type: [1],
      },
      {
        path: "川乌/170_生川乌混伪品（生附子，市场上的生川乌基本上多为此种）.jpg",
        type: [1],
      },
      {
        path: "川乌/190_制川乌.jpg",
        type: [1],
      },
      {
        path: "川乌/210_制川乌.jpg",
        type: [1],
      },
      {
        path: "川乌/230_制川乌伪品（生附子药材的加工品，常冒充制川乌流通，且市场占比极高）.jpg",
        type: [1],
      },
      {
        path: "川乌/250_川乌.jpg",
        type: [1],
      },
      {
        path: "川乌/270_川乌性状鉴别.jpg",
        type: [1],
      },
      {
        path: "川乌/290_草乌 未经炮制前（个子货）.jpg",
        type: [1],
      },
      {
        path: "川乌/310_切片后.jpg",
        type: [1],
      },
      {
        path: "川乌/330_制草乌.jpg",
        type: [1],
      },
      {
        path: "川乌/350_川乌 未经炮制前（个子货）.jpg",
        type: [1],
      },
      {
        path: "川乌/370_切片后.jpg",
        type: [1],
      },
      {
        path: "川乌/390_川乌炮制品.jpg",
        type: [1],
      },
      {
        path: "川乌/410_盐附子.jpg",
        type: [1],
      },
      {
        path: "川乌/430_左白附片、右黑顺片.jpg",
        type: [1],
      },
      {
        path: "川乌/450_川乌、草乌、附子比较.jpg",
        type: [1],
      },
      {
        path: "川乌/470_川乌、草乌生品与制品比较.jpg",
        type: [1],
      },
      {
        path: "川乌/490_制川乌.jpg",
        type: [1],
      },
      {
        path: "川乌/510_川乌炮制过程.jpg",
        type: [1],
      },
      {
        path: "川乌/530_制川乌性状.jpg",
        type: [1],
      },
      {
        path: "川乌/550_制草乌.jpg",
        type: [1],
      },
      {
        path: "川乌/570_制草乌炮制过程与制草乌性状.jpg",
        type: [1],
      },
      {
        path: "川乌/590_制草乌伪品.jpg",
        type: [1],
      },
      {
        path: "川乌/610_制草乌伪品.jpg",
        type: [1],
      },
      {
        path: "川乌/630_附子个.jpg",
        type: [1],
      },
      {
        path: "川乌/650_黑顺片.jpg",
        type: [1],
      },
      {
        path: "川乌/670_泥附子干品（上部凹槽为芽痕，易被误认为茎痕当为川乌）.jpg",
        type: [1],
      },
      {
        path: "川乌/690_制川乌.jpg",
        type: [1],
      },
      {
        path: "川乌/710_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "川木通",
    files: [
      {
        path: "川木通/010_小木通植物.jpg",
        type: [1],
      },
      {
        path: "川木通/030_绣球藤植物.jpg",
        type: [1],
      },
      {
        path: "川木通/050_川木通药材.jpg",
        type: [1],
      },
      {
        path: "川木通/070_川木通（小木通）.jpg",
        type: [1],
      },
      {
        path: "川木通/090_川木通（绣球藤）.jpg",
        type: [1],
      },
      {
        path: "川木通/110_川木通性状鉴别.jpg",
        type: [1],
      },
      {
        path: "川木通/130_川木通.jpg",
        type: [1],
      },
      {
        path: "川木通/150_木通.jpg",
        type: [1],
      },
      {
        path: "川木通/170_伪品关木通.jpg",
        type: [1],
      },
      {
        path: "川木通/190_山木通饮片.jpg",
        type: [1],
      },
      {
        path: "川木通/210_川木通.jpg",
        type: [1],
      },
      {
        path: "川木通/230_关木通.jpg",
        type: [1],
      },
      {
        path: "川木通/250_川木通饮片.jpg",
        type: [1],
      },
      {
        path: "川木通/270_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "川木香",
    files: [
      {
        path: "川木香/010_川木香植物.jpg",
        type: [1],
      },
      {
        path: "川木香/030_灰毛川木香植物.jpg",
        type: [1],
      },
      {
        path: "川木香/050_川木香药材.jpg",
        type: [1],
      },
      {
        path: "川木香/070_川木香药材.jpg",
        type: [1],
      },
      {
        path: "川木香/090_川木香特征.jpg",
        type: [1],
      },
      {
        path: "川木香/110_川木香饮片.jpg",
        type: [1],
      },
      {
        path: "川木香/130_川木香饮片.jpg",
        type: [1],
      },
      {
        path: "川木香/150_川木香.jpg",
        type: [1],
      },
      {
        path: "川木香/170_川木香性状鉴别.jpg",
        type: [1],
      },
      {
        path: "川木香/190_土木香.jpg",
        type: [2],
      },
      {
        path: "川木香/210_土木香.jpg",
        type: [2],
      },
      {
        path: "川木香/230_总状土木香.jpg",
        type: [2],
      },
      {
        path: "川木香/250_总状土木香饮片.jpg",
        type: [2],
      },
      {
        path: "川木香/270_国产木香.jpg",
        type: [1],
      },
      {
        path: "川木香/290_老木香.jpg",
        type: [1],
      },
      {
        path: "川木香/310_新木香.jpg",
        type: [1],
      },
      {
        path: "川木香/330_木香饮片.jpg",
        type: [1],
      },
      {
        path: "川木香/350_油头木香.jpg",
        type: [1],
      },
      {
        path: "川木香/370_铁杆木香.jpg",
        type: [1],
      },
      {
        path: "川木香/390_槽子木香.jpg",
        type: [1],
      },
      {
        path: "川木香/410_川木香斜切片.jpg",
        type: [1],
      },
      {
        path: "川木香/430_土木香.jpg",
        type: [2],
      },
      {
        path: "川木香/450_土木香横切片.jpg",
        type: [2],
      },
      {
        path: "川木香/470_青木香.jpg",
        type: [2],
      },
      {
        path: "川木香/490_青木香切面.jpg",
        type: [2],
      },
      {
        path: "川木香/510_红木香饮片.jpg",
        type: [2],
      },
      {
        path: "川木香/530_越西木香.jpg",
        type: [1],
      },
      {
        path: "川木香/550_木香、川木香、土木香鉴别.jpg",
        type: [1],
      },
      {
        path: "川木香/570_川木香饮片.jpg",
        type: [1],
      },
      {
        path: "川木香/590_煨川木香.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "川楝子",
    files: [
      {
        path: "川楝子/000_行气药_川楝子.jpg",
        type: [1],
      },
      {
        path: "川楝子/010_川楝植物.jpg",
        type: [1],
      },
      {
        path: "川楝子/030_川楝子药材.jpg",
        type: [1],
      },
      {
        path: "川楝子/050_川楝子.jpg",
        type: [1],
      },
      {
        path: "川楝子/070_川楝子、果核及种子.jpg",
        type: [1],
      },
      {
        path: "川楝子/090_川楝子性状鉴别.jpg",
        type: [1],
      },
      {
        path: "川楝子/110_川楝子、苦楝子果实对比.jpg",
        type: [1],
      },
      {
        path: "川楝子/130_川楝子、苦楝子果实对比.jpg",
        type: [1],
      },
      {
        path: "川楝子/150_炒川楝子.jpg",
        type: [1],
      },
      {
        path: "川楝子/170_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "川牛膝",
    files: [
      {
        path: "川牛膝/000_活血药_川牛膝饮片.jpg",
        type: [1],
      },
      {
        path: "川牛膝/000_活血药_怀牛膝.jpg",
        type: [1],
      },
      {
        path: "川牛膝/000_活血药_牛膝.jpg",
        type: [1],
      },
      {
        path: "川牛膝/010_川牛膝植物.jpg",
        type: [1],
      },
      {
        path: "川牛膝/030_川牛膝药材.jpg",
        type: [1],
      },
      {
        path: "川牛膝/050_川牛膝药材.jpg",
        type: [1],
      },
      {
        path: "川牛膝/070_川牛膝饮片.jpg",
        type: [1],
      },
      {
        path: "川牛膝/090_川牛膝.jpg",
        type: [1],
      },
      {
        path: "川牛膝/110_牛膝与川牛膝个子货比较.jpg",
        type: [1],
      },
      {
        path: "川牛膝/130_牛膝药材及切片.jpg",
        type: [1],
      },
      {
        path: "川牛膝/150_川牛膝药材及切片.jpg",
        type: [1],
      },
      {
        path: "川牛膝/170_牛膝与川牛膝饮片比较.jpg",
        type: [1],
      },
      {
        path: "川牛膝/190_牛膝、川牛膝断面对比.jpg",
        type: [1],
      },
      {
        path: "川牛膝/210_川牛膝.jpg",
        type: [1],
      },
      {
        path: "川牛膝/230_川牛膝性状鉴别.jpg",
        type: [1],
      },
      {
        path: "川牛膝/250_川牛膝.jpg",
        type: [1],
      },
      {
        path: "川牛膝/270_味牛膝.jpg",
        type: [1],
      },
      {
        path: "川牛膝/290_麻牛膝.jpg",
        type: [2],
      },
      {
        path: "川牛膝/310_土木香片.jpg",
        type: [2],
      },
      {
        path: "川牛膝/330_川牛膝.jpg",
        type: [1],
      },
      {
        path: "川牛膝/350_酒川牛膝.jpg",
        type: [1],
      },
      {
        path: "川牛膝/370_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "川芎",
    files: [
      {
        path: "川芎/000_活血药_川芎.jpg",
        type: [1],
      },
      {
        path: "川芎/000_活血药_川芎2.jpg",
        type: [1],
      },
      {
        path: "川芎/010_川芎人工种植.jpg",
        type: [1],
      },
      {
        path: "川芎/030_川芎植物.jpg",
        type: [1],
      },
      {
        path: "川芎/050_川芎药材.jpg",
        type: [1],
      },
      {
        path: "川芎/070_川芎鉴别.jpg",
        type: [1],
      },
      {
        path: "川芎/090_川芎伪品：藁本.jpg",
        type: [2],
      },
      {
        path: "川芎/110_川芎混淆品：抚芎.jpg",
        type: [2],
      },
      {
        path: "川芎/130_川芎混淆品：东川芎.jpg",
        type: [2],
      },
      {
        path: "川芎/150_抚芎.jpg",
        type: [2],
      },
      {
        path: "川芎/170_东川芎.jpg",
        type: [2],
      },
      {
        path: "川芎/190_藁本.jpg",
        type: [2],
      },
      {
        path: "川芎/210_川芎饮片.jpg",
        type: [1],
      },
      {
        path: "川芎/230_酒川芎饮片.jpg",
        type: [1],
      },
      {
        path: "川芎/250_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "川贝母",
    files: [
      {
        path: "川贝母/000_化痰药_川贝母.jpg",
        type: [1],
      },
      {
        path: "川贝母/000_化痰药_浙贝母.jpg",
        type: [1],
      },
      {
        path: "川贝母/010_川贝母.jpg",
        type: [1],
      },
      {
        path: "川贝母/030_暗紫贝母.jpg",
        type: [1],
      },
      {
        path: "川贝母/050_甘肃贝母.jpg",
        type: [1],
      },
      {
        path: "川贝母/070_梭砂贝母.jpg",
        type: [1],
      },
      {
        path: "川贝母/090_太白贝母.jpg",
        type: [1],
      },
      {
        path: "川贝母/110_瓦布贝母.jpg",
        type: [1],
      },
      {
        path: "川贝母/130_松贝药材.jpg",
        type: [1],
      },
      {
        path: "川贝母/150_松贝药材.jpg",
        type: [1],
      },
      {
        path: "川贝母/170_青贝药材.jpg",
        type: [1],
      },
      {
        path: "川贝母/190_青贝药材.jpg",
        type: [1],
      },
      {
        path: "川贝母/210_炉贝药材.jpg",
        type: [1],
      },
      {
        path: "川贝母/230_白炉贝.jpg",
        type: [1],
      },
      {
        path: "川贝母/250_栽培品（太白贝母）.jpg",
        type: [1],
      },
      {
        path: "川贝母/270_栽培品（瓦布贝母）.jpg",
        type: [1],
      },
      {
        path: "川贝母/290_栽培品（瓦布贝母）.jpg",
        type: [1],
      },
      {
        path: "川贝母/310_松贝性状鉴别.jpg",
        type: [1],
      },
      {
        path: "川贝母/330_青贝性状鉴别.jpg",
        type: [1],
      },
      {
        path: "川贝母/350_炉贝性状鉴别.jpg",
        type: [1],
      },
      {
        path: "川贝母/370_伪品：小平贝.jpg",
        type: [1],
      },
      {
        path: "川贝母/390_伪品：小平贝母与川贝母比较.jpg",
        type: [1],
      },
      {
        path: "川贝母/410_丽江山慈菇.jpg",
        type: [1],
      },
      {
        path: "川贝母/430_湖北贝母.jpg",
        type: [1],
      },
      {
        path: "川贝母/450_小浙贝.jpg",
        type: [1],
      },
      {
        path: "川贝母/470_光慈姑.jpg",
        type: [1],
      },
      {
        path: "川贝母/490_新疆贝母.jpg",
        type: [1],
      },
      {
        path: "川贝母/510_伊犁贝母.jpg",
        type: [1],
      },
      {
        path: "川贝母/530_伊犁贝母与新疆贝母比较图.jpg",
        type: [1],
      },
      {
        path: "川贝母/550_东贝.jpg",
        type: [1],
      },
      {
        path: "川贝母/570_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "巴戟天",
    files: [
      {
        path: "巴戟天/000_补虚药_巴戟天.jpg",
        type: [1],
      },
      {
        path: "巴戟天/010_巴戟天植物.jpg",
        type: [1],
      },
      {
        path: "巴戟天/030_巴戟天药材.jpg",
        type: [1],
      },
      {
        path: "巴戟天/050_巴戟天.jpg",
        type: [1],
      },
      {
        path: "巴戟天/070_巴戟天.jpg",
        type: [1],
      },
      {
        path: "巴戟天/090_巴戟天.jpg",
        type: [1],
      },
      {
        path: "巴戟天/110_巴戟天性状鉴别.jpg",
        type: [1],
      },
      {
        path: "巴戟天/130_羊角藤.jpg",
        type: [2],
      },
      {
        path: "巴戟天/150_羊角藤.jpg",
        type: [2],
      },
      {
        path: "巴戟天/170_川虎刺.jpg",
        type: [2],
      },
      {
        path: "巴戟天/190_川虎刺.jpg",
        type: [2],
      },
      {
        path: "巴戟天/210_假巴戟.jpg",
        type: [2],
      },
      {
        path: "巴戟天/230_假巴戟.jpg",
        type: [2],
      },
      {
        path: "巴戟天/250_铁箍散.jpg",
        type: [2],
      },
      {
        path: "巴戟天/270_铁箍散.jpg",
        type: [2],
      },
      {
        path: "巴戟天/290_虎刺.jpg",
        type: [2],
      },
      {
        path: "巴戟天/310_白木通.jpg",
        type: [2],
      },
      {
        path: "巴戟天/330_白木通.jpg",
        type: [2],
      },
      {
        path: "巴戟天/350_巴戟天伪品：大果巴戟.jpg",
        type: [2],
      },
      {
        path: "巴戟天/370_巴戟天伪品：短刺虎刺.jpg",
        type: [2],
      },
      {
        path: "巴戟天/390_巴戟天伪品：黑老虎.jpg",
        type: [2],
      },
      {
        path: "巴戟天/410_巴戟天伪品：长叶数珠根.jpg",
        type: [2],
      },
      {
        path: "巴戟天/430_巴戟天伪品：长叶数珠根.jpg",
        type: [2],
      },
      {
        path: "巴戟天/450_巴戟肉.jpg",
        type: [1],
      },
      {
        path: "巴戟天/470_盐巴戟天.jpg",
        type: [1],
      },
      {
        path: "巴戟天/490_制巴戟天.jpg",
        type: [1],
      },
      {
        path: "巴戟天/510_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "巴豆",
    files: [
      {
        path: "巴豆/000_泻下药_巴豆.jpg",
        type: [1],
      },
      {
        path: "巴豆/010_巴豆植物.jpg",
        type: [1],
      },
      {
        path: "巴豆/030_巴豆果实.jpg",
        type: [1],
      },
      {
        path: "巴豆/050_巴豆药材.jpg",
        type: [1],
      },
      {
        path: "巴豆/070_巴豆.jpg",
        type: [1],
      },
      {
        path: "巴豆/090_巴豆性状鉴别.jpg",
        type: [1],
      },
      {
        path: "巴豆/110_巴豆与伪品小巴豆.jpg",
        type: [1],
      },
      {
        path: "巴豆/130_生巴豆.jpg",
        type: [1],
      },
      {
        path: "巴豆/150_巴豆霜.jpg",
        type: [1],
      },
      {
        path: "巴豆/170_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "布渣叶",
    files: [
      {
        path: "布渣叶/010_破布叶植物.jpg",
        type: [1],
      },
      {
        path: "布渣叶/030_布渣叶.jpg",
        type: [1],
      },
      {
        path: "布渣叶/050_布渣叶.jpg",
        type: [1],
      },
      {
        path: "布渣叶/070_布渣叶.jpg",
        type: [1],
      },
      {
        path: "布渣叶/090_布渣叶.jpg",
        type: [1],
      },
      {
        path: "布渣叶/110_布渣叶.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "常山",
    files: [
      {
        path: "常山/000_涌吐药_常山.jpg",
        type: [1],
      },
      {
        path: "常山/010_常山植物.jpg",
        type: [1],
      },
      {
        path: "常山/030_常山药材.jpg",
        type: [1],
      },
      {
        path: "常山/050_常山饮片.jpg",
        type: [1],
      },
      {
        path: "常山/070_常山.jpg",
        type: [1],
      },
      {
        path: "常山/090_常山.jpg",
        type: [1],
      },
      {
        path: "常山/110_常山性状鉴别.jpg",
        type: [1],
      },
      {
        path: "常山/130_滇常山.jpg",
        type: [1],
      },
      {
        path: "常山/150_功劳木.jpg",
        type: [1],
      },
      {
        path: "常山/170_细叶小檗.jpg",
        type: [1],
      },
      {
        path: "常山/190_穿山龙.jpg",
        type: [1],
      },
      {
        path: "常山/210_伞花绣球.jpg",
        type: [1],
      },
      {
        path: "常山/230_南天竹.jpg",
        type: [1],
      },
      {
        path: "常山/250_常山饮片.jpg",
        type: [1],
      },
      {
        path: "常山/270_常山饮片.jpg",
        type: [1],
      },
      {
        path: "常山/290_炒常山.jpg",
        type: [1],
      },
      {
        path: "常山/310_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "干姜",
    files: [
      {
        path: "干姜/000_止血药_炮姜.jpg",
        type: [1],
      },
      {
        path: "干姜/000_温里药_干姜.jpg",
        type: [1],
      },
      {
        path: "干姜/010_姜植物.jpg",
        type: [1],
      },
      {
        path: "干姜/030_干姜.jpg",
        type: [1],
      },
      {
        path: "干姜/050_干姜片.jpg",
        type: [1],
      },
      {
        path: "干姜/070_干姜片.jpg",
        type: [1],
      },
      {
        path: "干姜/090_干姜.jpg",
        type: [1],
      },
      {
        path: "干姜/110_炮姜.jpg",
        type: [1],
      },
      {
        path: "干姜/130_干姜性状鉴别.jpg",
        type: [1],
      },
      {
        path: "干姜/150_干姜片.jpg",
        type: [1],
      },
      {
        path: "干姜/170_姜炭.jpg",
        type: [1],
      },
      {
        path: "干姜/190_炮姜.jpg",
        type: [1],
      },
      {
        path: "干姜/210_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "干漆",
    files: [
      {
        path: "干漆/010_漆树植物.jpg",
        type: [1],
      },
      {
        path: "干漆/030_干漆药材.jpg",
        type: [1],
      },
      {
        path: "干漆/050_干漆药材.jpg",
        type: [1],
      },
      {
        path: "干漆/070_干漆.jpg",
        type: [1],
      },
      {
        path: "干漆/090_干漆炭.jpg",
        type: [1],
      },
      {
        path: "干漆/110_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "平贝母",
    files: [
      {
        path: "平贝母/010_平贝母植物.jpg",
        type: [1],
      },
      {
        path: "平贝母/030_平贝母药材.jpg",
        type: [1],
      },
      {
        path: "平贝母/050_磨砂小平贝，经常伪充松贝.jpg",
        type: [1],
      },
      {
        path: "平贝母/070_平贝母.jpg",
        type: [1],
      },
      {
        path: "平贝母/090_平贝母性状鉴别.jpg",
        type: [1],
      },
      {
        path: "平贝母/110_劣品：含硫平贝母.jpg",
        type: [1],
      },
      {
        path: "平贝母/130_平贝母.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "广东紫珠",
    files: [
      {
        path: "广东紫珠/010_广东紫珠植物.jpg",
        type: [1],
      },
      {
        path: "广东紫珠/030_广东紫珠.jpg",
        type: [1],
      },
      {
        path: "广东紫珠/050_广东紫珠.jpg",
        type: [1],
      },
      {
        path: "广东紫珠/070_广东紫珠.jpg",
        type: [1],
      },
      {
        path: "广东紫珠/090_广东紫珠.jpg",
        type: [1],
      },
      {
        path: "广东紫珠/110_大叶紫珠.jpg",
        type: [1],
      },
      {
        path: "广东紫珠/130_紫珠叶.jpg",
        type: [1],
      },
      {
        path: "广东紫珠/150_六种紫珠检索表.jpg",
        type: [1],
      },
      {
        path: "广东紫珠/170_六种紫珠性状比较.jpg",
        type: [1],
      },
      {
        path: "广东紫珠/190_六种紫珠性状比较.jpg",
        type: [1],
      },
      {
        path: "广东紫珠/210_六种紫珠性状比较.jpg",
        type: [1],
      },
      {
        path: "广东紫珠/230_六种紫珠性状比较.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "广山药",
    files: [
      {
        path: "广山药/010_左：山薯原植物   右：褐苞薯蓣原植物.jpg",
        type: [1],
      },
      {
        path: "广山药/030_广山药药材（左：山薯   右：褐苞薯蓣）.jpg",
        type: [1],
      },
      {
        path: "广山药/050_广山药饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "广枣",
    files: [
      {
        path: "广枣/010_南酸枣植物.jpg",
        type: [1],
      },
      {
        path: "广枣/030_广枣.jpg",
        type: [1],
      },
      {
        path: "广枣/050_广枣.jpg",
        type: [1],
      },
      {
        path: "广枣/070_广枣.jpg",
        type: [1],
      },
      {
        path: "广枣/090_广枣果核（市场常称五眼果）.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "广藿香",
    files: [
      {
        path: "广藿香/010_广藿香.jpg",
        type: [1],
      },
      {
        path: "广藿香/030_广藿香药材.jpg",
        type: [1],
      },
      {
        path: "广藿香/050_广藿香药材.jpg",
        type: [1],
      },
      {
        path: "广藿香/070_广藿香.jpg",
        type: [1],
      },
      {
        path: "广藿香/090_广藿香.jpg",
        type: [1],
      },
      {
        path: "广藿香/110_广藿香.jpg",
        type: [1],
      },
      {
        path: "广藿香/130_广藿香性状鉴别.jpg",
        type: [1],
      },
      {
        path: "广藿香/150_防风草.jpg",
        type: [1],
      },
      {
        path: "广藿香/170_劣质广藿香.jpg",
        type: [1],
      },
      {
        path: "广藿香/190_土藿香饮片.jpg",
        type: [1],
      },
      {
        path: "广藿香/210_土藿香饮片.jpg",
        type: [1],
      },
      {
        path: "广藿香/230_广藿香饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "广金钱草",
    files: [
      {
        path: "广金钱草/010_广金钱草植物.jpg",
        type: [1],
      },
      {
        path: "广金钱草/030_广金钱草药材.jpg",
        type: [1],
      },
      {
        path: "广金钱草/050_广金钱草药材.jpg",
        type: [1],
      },
      {
        path: "广金钱草/070_广金钱草.jpg",
        type: [1],
      },
      {
        path: "广金钱草/090_广金钱草性状鉴别.jpg",
        type: [1],
      },
      {
        path: "广金钱草/110_广金钱草.jpg",
        type: [1],
      },
      {
        path: "广金钱草/130_金钱草.jpg",
        type: [1],
      },
      {
        path: "广金钱草/150_广金钱草饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "延胡索元胡",
    files: [
      {
        path: "延胡索元胡/010_延胡索植物.jpg",
        type: [1],
      },
      {
        path: "延胡索元胡/030_延胡索药材.jpg",
        type: [1],
      },
      {
        path: "延胡索元胡/050_延胡索饮片.jpg",
        type: [1],
      },
      {
        path: "延胡索元胡/070_延胡索.jpg",
        type: [1],
      },
      {
        path: "延胡索元胡/090_延胡索.jpg",
        type: [1],
      },
      {
        path: "延胡索元胡/110_延胡索性状鉴别.jpg",
        type: [1],
      },
      {
        path: "延胡索元胡/130_延胡索.jpg",
        type: [1],
      },
      {
        path: "延胡索元胡/150_伪品：山药豆.jpg",
        type: [1],
      },
      {
        path: "延胡索元胡/170_延胡索、山药豆荧光显色.jpg",
        type: [1],
      },
      {
        path: "延胡索元胡/190_延胡索提取残渣.jpg",
        type: [1],
      },
      {
        path: "延胡索元胡/210_夏天无.jpg",
        type: [1],
      },
      {
        path: "延胡索元胡/230_齿瓣延胡索.jpg",
        type: [1],
      },
      {
        path: "延胡索元胡/250_东北延胡索.jpg",
        type: [1],
      },
      {
        path: "延胡索元胡/270_东北延胡索（生品）.jpg",
        type: [1],
      },
      {
        path: "延胡索元胡/290_土元胡.jpg",
        type: [1],
      },
      {
        path: "延胡索元胡/310_新疆延胡索.jpg",
        type: [1],
      },
      {
        path: "延胡索元胡/330_伪制品：姜黄块.jpg",
        type: [1],
      },
      {
        path: "延胡索元胡/350_延胡索饮片.jpg",
        type: [1],
      },
      {
        path: "延胡索元胡/370_醋延胡索.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "当归",
    files: [
      {
        path: "当归/000_补虚药_当归.jpg",
        type: [1],
      },
      {
        path: "当归/000_补虚药_当归2.jpg",
        type: [1],
      },
      {
        path: "当归/010_当归种植.jpg",
        type: [1],
      },
      {
        path: "当归/030_当归植物.jpg",
        type: [1],
      },
      {
        path: "当归/050_当归药材.jpg",
        type: [1],
      },
      {
        path: "当归/070_下方为含硫当归.jpg",
        type: [1],
      },
      {
        path: "当归/090_当归性状鉴别.jpg",
        type: [1],
      },
      {
        path: "当归/110_紫花前胡.jpg",
        type: [1],
      },
      {
        path: "当归/130_欧当归.jpg",
        type: [1],
      },
      {
        path: "当归/150_日本东当归.jpg",
        type: [1],
      },
      {
        path: "当归/170_朝鲜东当归.jpg",
        type: [1],
      },
      {
        path: "当归/190_吉林东当归.jpg",
        type: [1],
      },
      {
        path: "当归/210_云南野当归.jpg",
        type: [1],
      },
      {
        path: "当归/230_当归切片.jpg",
        type: [1],
      },
      {
        path: "当归/250_酒当归饮片.jpg",
        type: [1],
      },
      {
        path: "当归/270_当归炭饮片.jpg",
        type: [1],
      },
      {
        path: "当归/290_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "彼子",
    files: [
      {
        path: "彼子/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "徐长卿",
    files: [
      {
        path: "徐长卿/010_徐长卿植物.jpg",
        type: [1],
      },
      {
        path: "徐长卿/030_徐长卿药材.jpg",
        type: [1],
      },
      {
        path: "徐长卿/050_徐长卿性状鉴别.jpg",
        type: [1],
      },
      {
        path: "徐长卿/070_徐长卿饮片.jpg",
        type: [1],
      },
      {
        path: "徐长卿/090_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "忍冬藤",
    files: [
      {
        path: "忍冬藤/010_忍冬植物.jpg",
        type: [1],
      },
      {
        path: "忍冬藤/030_忍冬藤药材.jpg",
        type: [1],
      },
      {
        path: "忍冬藤/050_忍冬藤.jpg",
        type: [1],
      },
      {
        path: "忍冬藤/070_忍冬性状鉴别.jpg",
        type: [1],
      },
      {
        path: "忍冬藤/090_忍冬藤混淆品：灰毡毛忍冬.jpg",
        type: [1],
      },
      {
        path: "忍冬藤/110_忍冬藤与混淆品对比.jpg",
        type: [1],
      },
      {
        path: "忍冬藤/130_忍冬藤饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "急性子",
    files: [
      {
        path: "急性子/010_凤仙花植物.jpg",
        type: [1],
      },
      {
        path: "急性子/030_凤仙花.jpg",
        type: [1],
      },
      {
        path: "急性子/050_急性子药材.jpg",
        type: [1],
      },
      {
        path: "急性子/070_急性子.jpg",
        type: [1],
      },
      {
        path: "急性子/090_急性子.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "恒山",
    files: [
      {
        path: "恒山/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "扁青",
    files: [
      {
        path: "扁青/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "拳参",
    files: [
      {
        path: "拳参/010_拳参植物.jpg",
        type: [1],
      },
      {
        path: "拳参/030_拳参鲜品.jpg",
        type: [1],
      },
      {
        path: "拳参/050_拳参鲜品.jpg",
        type: [1],
      },
      {
        path: "拳参/070_拳参药材.jpg",
        type: [1],
      },
      {
        path: "拳参/090_拳参.jpg",
        type: [1],
      },
      {
        path: "拳参/110_拳参饮片.jpg",
        type: [1],
      },
      {
        path: "拳参/130_拳参.jpg",
        type: [1],
      },
      {
        path: "拳参/150_拳参.jpg",
        type: [1],
      },
      {
        path: "拳参/170_拳参.jpg",
        type: [1],
      },
      {
        path: "拳参/190_拳参性状鉴别.jpg",
        type: [1],
      },
      {
        path: "拳参/210_拳参与伪品性状对比.jpg",
        type: [1],
      },
      {
        path: "拳参/230_草血竭.jpg",
        type: [1],
      },
      {
        path: "拳参/250_草血竭断面.jpg",
        type: [1],
      },
      {
        path: "拳参/270_珠芽蓼.jpg",
        type: [1],
      },
      {
        path: "拳参/290_支柱蓼.jpg",
        type: [1],
      },
      {
        path: "拳参/310_拳参与伪品性状对比.jpg",
        type: [1],
      },
      {
        path: "拳参/330_拳参与伪品对比图.jpg",
        type: [1],
      },
      {
        path: "拳参/350_左拳参，右草血竭。365nm紫外灯下 ，草血竭的维管束呈黄色.jpg",
        type: [1],
      },
      {
        path: "拳参/370_珠芽蓼：质坚硬，断面紫红色，维管束15~20个，白色点状，环形排列，味涩.jpg",
        type: [1],
      },
      {
        path: "拳参/390_拳参饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "救必应",
    files: [
      {
        path: "救必应/010_铁冬青植物.jpg",
        type: [1],
      },
      {
        path: "救必应/030_救必应药材.jpg",
        type: [1],
      },
      {
        path: "救必应/050_救必应药材.jpg",
        type: [1],
      },
      {
        path: "救必应/070_救必应饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "斑蝥",
    files: [
      {
        path: "斑蝥/010_南方大斑蝥.jpg",
        type: [1],
      },
      {
        path: "斑蝥/030_黄黑小斑蝥.jpg",
        type: [1],
      },
      {
        path: "斑蝥/050_南方大斑蝥.jpg",
        type: [1],
      },
      {
        path: "斑蝥/070_黄黑小斑蝥.jpg",
        type: [1],
      },
      {
        path: "斑蝥/090_黄黑小斑蝥.jpg",
        type: [1],
      },
      {
        path: "斑蝥/110_斑蝥药材.jpg",
        type: [1],
      },
      {
        path: "斑蝥/130_斑蝥药材.jpg",
        type: [1],
      },
      {
        path: "斑蝥/150_斑蝥.jpg",
        type: [1],
      },
      {
        path: "斑蝥/170_斑蝥性状鉴别.jpg",
        type: [1],
      },
      {
        path: "斑蝥/190_青娘子.jpg",
        type: [1],
      },
      {
        path: "斑蝥/斑蝥.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "断血流",
    files: [
      {
        path: "断血流/010_灯笼草植物.jpg",
        type: [1],
      },
      {
        path: "断血流/030_风轮菜植物.jpg",
        type: [1],
      },
      {
        path: "断血流/050_断血流饮片.jpg",
        type: [1],
      },
      {
        path: "断血流/070_断血流饮片.jpg",
        type: [1],
      },
      {
        path: "断血流/090_灯笼草药材.jpg",
        type: [1],
      },
      {
        path: "断血流/110_灯笼草药材.jpg",
        type: [1],
      },
      {
        path: "断血流/130_风轮菜药材.jpg",
        type: [1],
      },
      {
        path: "断血流/150_断血流饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "新绛",
    files: [
      {
        path: "新绛/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "旋覆花",
    files: [
      {
        path: "旋覆花/000_化痰药_旋覆花.jpg",
        type: [1],
      },
      {
        path: "旋覆花/010_旋覆花植物.jpg",
        type: [1],
      },
      {
        path: "旋覆花/030_欧亚旋覆花植物.jpg",
        type: [1],
      },
      {
        path: "旋覆花/050_旋覆花.jpg",
        type: [1],
      },
      {
        path: "旋覆花/070_欧亚旋覆花.jpg",
        type: [1],
      },
      {
        path: "旋覆花/090_旋覆花性状鉴别.jpg",
        type: [1],
      },
      {
        path: "旋覆花/110_旋覆花表面放大观.jpg",
        type: [1],
      },
      {
        path: "旋覆花/130_旋覆花混淆品：湖北旋覆花.jpg",
        type: [2],
      },
      {
        path: "旋覆花/150_旋覆花混淆品：山黄菊.jpg",
        type: [2],
      },
      {
        path: "旋覆花/170_旋覆花混淆品：水朝阳旋覆花.jpg",
        type: [2],
      },
      {
        path: "旋覆花/190_旋覆花混淆品：线叶旋覆花.jpg",
        type: [2],
      },
      {
        path: "旋覆花/210_旋覆花饮片.jpg",
        type: [1],
      },
      {
        path: "旋覆花/230_蜜旋覆花.jpg",
        type: [1],
      },
      {
        path: "旋覆花/250_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "昆布",
    files: [
      {
        path: "昆布/010_海带植物.jpg",
        type: [1],
      },
      {
        path: "昆布/030_昆布植物.jpg",
        type: [1],
      },
      {
        path: "昆布/050_海带药材.jpg",
        type: [1],
      },
      {
        path: "昆布/070_昆布.jpg",
        type: [1],
      },
      {
        path: "昆布/090_海带.jpg",
        type: [1],
      },
      {
        path: "昆布/110_昆布.jpg",
        type: [1],
      },
      {
        path: "昆布/130_昆布性状鉴别.jpg",
        type: [1],
      },
      {
        path: "昆布/150_昆布.jpg",
        type: [1],
      },
      {
        path: "昆布/170_广昆布.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "明党参",
    files: [
      {
        path: "明党参/010_明党参植物.jpg",
        type: [1],
      },
      {
        path: "明党参/030_明党参药材.jpg",
        type: [1],
      },
      {
        path: "明党参/050_明党参饮片.jpg",
        type: [1],
      },
      {
        path: "明党参/070_明党参.jpg",
        type: [1],
      },
      {
        path: "明党参/090_明党参.jpg",
        type: [1],
      },
      {
        path: "明党参/110_明党参.jpg",
        type: [1],
      },
      {
        path: "明党参/130_粉沙参.jpg",
        type: [1],
      },
      {
        path: "明党参/150_明党参性状鉴别.jpg",
        type: [1],
      },
      {
        path: "明党参/170_川明参.jpg",
        type: [1],
      },
      {
        path: "明党参/190_左川明党  右明党参.jpg",
        type: [1],
      },
      {
        path: "明党参/210_明党参与川明参的区别.jpg",
        type: [1],
      },
      {
        path: "明党参/230_明党参饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "景天",
    files: [
      {
        path: "景天/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "暴马子皮",
    files: [
      {
        path: "暴马子皮/010_暴马丁香植物.jpg",
        type: [1],
      },
      {
        path: "暴马子皮/030_暴马子皮药材.jpg",
        type: [1],
      },
      {
        path: "暴马子皮/050_暴马子皮药材.jpg",
        type: [1],
      },
      {
        path: "暴马子皮/070_暴马子皮.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "曾青",
    files: [
      {
        path: "曾青/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "月季花",
    files: [
      {
        path: "月季花/010_月季植物.jpg",
        type: [1],
      },
      {
        path: "月季花/030_月季花.jpg",
        type: [1],
      },
      {
        path: "月季花/050_月季花药材.jpg",
        type: [1],
      },
      {
        path: "月季花/070_月季花药材.jpg",
        type: [1],
      },
      {
        path: "月季花/090_月季花性状鉴别.jpg",
        type: [1],
      },
      {
        path: "月季花/110_月季花性状鉴别.jpg",
        type: [1],
      },
      {
        path: "月季花/130_月季花蕾.jpg",
        type: [1],
      },
      {
        path: "月季花/150_月季花与玫瑰.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "木兰",
    files: [
      {
        path: "木兰/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "木棉花",
    files: [
      {
        path: "木棉花/010_木棉植物.jpg",
        type: [1],
      },
      {
        path: "木棉花/030_木棉花.jpg",
        type: [1],
      },
      {
        path: "木棉花/050_木棉花.jpg",
        type: [1],
      },
      {
        path: "木棉花/070_木棉花.jpg",
        type: [1],
      },
      {
        path: "木棉花/090_木棉花.jpg",
        type: [1],
      },
      {
        path: "木棉花/110_木棉花.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "木槿皮",
    files: [
      {
        path: "木槿皮/010_木槿植物.jpg",
        type: [1],
      },
      {
        path: "木槿皮/030_木槿皮.jpg",
        type: [1],
      },
      {
        path: "木槿皮/050_木槿皮.jpg",
        type: [1],
      },
      {
        path: "木槿皮/070_木槿皮.jpg",
        type: [1],
      },
      {
        path: "木槿皮/090_土荆皮.jpg",
        type: [1],
      },
      {
        path: "木槿皮/110_广东土槿皮.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "木瓜",
    files: [
      {
        path: "木瓜/010_贴梗海棠花.jpg",
        type: [1],
      },
      {
        path: "木瓜/030_木瓜.jpg",
        type: [1],
      },
      {
        path: "木瓜/050_木瓜药材.jpg",
        type: [1],
      },
      {
        path: "木瓜/070_木瓜药材.jpg",
        type: [1],
      },
      {
        path: "木瓜/090_木瓜性状鉴别.jpg",
        type: [1],
      },
      {
        path: "木瓜/110_光皮木瓜.jpg",
        type: [1],
      },
      {
        path: "木瓜/130_光皮木瓜饮片.jpg",
        type: [1],
      },
      {
        path: "木瓜/150_木瓜混淆品小木瓜.jpg",
        type: [1],
      },
      {
        path: "木瓜/170_小木瓜切片.jpg",
        type: [1],
      },
      {
        path: "木瓜/190_木瓜饮片.jpg",
        type: [1],
      },
      {
        path: "木瓜/210_木瓜饮片性状.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "木芙蓉叶",
    files: [
      {
        path: "木芙蓉叶/010_木芙蓉植物.jpg",
        type: [1],
      },
      {
        path: "木芙蓉叶/030_木芙蓉叶.jpg",
        type: [1],
      },
      {
        path: "木芙蓉叶/050_木芙蓉叶药材.jpg",
        type: [1],
      },
      {
        path: "木芙蓉叶/070_木芙蓉叶药材.jpg",
        type: [1],
      },
      {
        path: "木芙蓉叶/090_木芙蓉叶药材.jpg",
        type: [1],
      },
      {
        path: "木芙蓉叶/110_木芙蓉叶.jpg",
        type: [1],
      },
      {
        path: "木芙蓉叶/130_木芙蓉叶饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "木虻",
    files: [
      {
        path: "木虻/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "木蝴蝶",
    files: [
      {
        path: "木蝴蝶/010_木蝴蝶.jpg",
        type: [1],
      },
      {
        path: "木蝴蝶/030_木蝴蝶药材.jpg",
        type: [1],
      },
      {
        path: "木蝴蝶/050_木蝴蝶性状鉴别.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "木贼",
    files: [
      {
        path: "木贼/010_木贼植物.jpg",
        type: [1],
      },
      {
        path: "木贼/030_木贼药材.jpg",
        type: [1],
      },
      {
        path: "木贼/050_木贼.jpg",
        type: [1],
      },
      {
        path: "木贼/070_木贼.jpg",
        type: [1],
      },
      {
        path: "木贼/090_木贼.jpg",
        type: [1],
      },
      {
        path: "木贼/110_木贼茎表面观.jpg",
        type: [1],
      },
      {
        path: "木贼/130_木贼性状鉴别.jpg",
        type: [1],
      },
      {
        path: "木贼/150_笔管草.jpg",
        type: [1],
      },
      {
        path: "木贼/170_笔管草表面观.jpg",
        type: [1],
      },
      {
        path: "木贼/190_节节草.jpg",
        type: [1],
      },
      {
        path: "木贼/210_节节草表面观.jpg",
        type: [1],
      },
      {
        path: "木贼/230_木贼饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "木通",
    files: [
      {
        path: "木通/000_利水渗湿药_木通.jpg",
        type: [1],
      },
      {
        path: "木通/000_利水渗湿药_木通2.jpg",
        type: [1],
      },
      {
        path: "木通/010_木通植物.jpg",
        type: [1],
      },
      {
        path: "木通/030_三叶木通植物.jpg",
        type: [1],
      },
      {
        path: "木通/050_白木通植物.jpg",
        type: [1],
      },
      {
        path: "木通/070_木通药材.jpg",
        type: [1],
      },
      {
        path: "木通/090_木通.jpg",
        type: [1],
      },
      {
        path: "木通/110_木通鉴别.jpg",
        type: [1],
      },
      {
        path: "木通/130_木通性状鉴别.jpg",
        type: [1],
      },
      {
        path: "木通/150_关木通.jpg",
        type: [1],
      },
      {
        path: "木通/170_关木通.jpg",
        type: [1],
      },
      {
        path: "木通/190_川木通.jpg",
        type: [1],
      },
      {
        path: "木通/210_川木通.jpg",
        type: [1],
      },
      {
        path: "木通/230_木通饮片.jpg",
        type: [1],
      },
      {
        path: "木通/250_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "木防己",
    files: [
      {
        path: "木防己/000_祛风湿药_防己.jpg",
        type: [1],
      },
      {
        path: "木防己/000_祛风湿药_防己2.jpg",
        type: [1],
      },
      {
        path: "木防己/010_木防己植物.jpg",
        type: [1],
      },
      {
        path: "木防己/030_木防己植物.jpg",
        type: [1],
      },
      {
        path: "木防己/050_木防己药材.jpg",
        type: [1],
      },
      {
        path: "木防己/070_木防己切面.jpg",
        type: [1],
      },
      {
        path: "木防己/090_木防己切面.jpg",
        type: [1],
      },
      {
        path: "木防己/110_木防己.jpg",
        type: [1],
      },
      {
        path: "木防己/130_木防己.jpg",
        type: [1],
      },
      {
        path: "木防己/150_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "木香",
    files: [
      {
        path: "木香/000_行气药_木香.jpg",
        type: [1],
      },
      {
        path: "木香/000_行气药_木香2.jpg",
        type: [1],
      },
      {
        path: "木香/010_木香植物.jpg",
        type: [1],
      },
      {
        path: "木香/030_木香药材.jpg",
        type: [1],
      },
      {
        path: "木香/050_木香饮片.jpg",
        type: [1],
      },
      {
        path: "木香/070_木香饮片.jpg",
        type: [1],
      },
      {
        path: "木香/090_木香.jpg",
        type: [1],
      },
      {
        path: "木香/110_木香特征.jpg",
        type: [1],
      },
      {
        path: "木香/130_木香.jpg",
        type: [1],
      },
      {
        path: "木香/150_木香性状鉴别.jpg",
        type: [1],
      },
      {
        path: "木香/170_土木香.jpg",
        type: [2],
      },
      {
        path: "木香/190_土木香.jpg",
        type: [2],
      },
      {
        path: "木香/210_总状土木香.jpg",
        type: [2],
      },
      {
        path: "木香/230_总状土木香饮片.jpg",
        type: [2],
      },
      {
        path: "木香/250_国产木香.jpg",
        type: [1],
      },
      {
        path: "木香/270_老木香.jpg",
        type: [1],
      },
      {
        path: "木香/290_新木香.jpg",
        type: [1],
      },
      {
        path: "木香/310_木香饮片.jpg",
        type: [1],
      },
      {
        path: "木香/330_油头木香.jpg",
        type: [1],
      },
      {
        path: "木香/350_铁杆木香.jpg",
        type: [1],
      },
      {
        path: "木香/370_槽子木香.jpg",
        type: [1],
      },
      {
        path: "木香/390_川木香斜切片.jpg",
        type: [1],
      },
      {
        path: "木香/410_土木香.jpg",
        type: [2],
      },
      {
        path: "木香/430_土木香横切片.jpg",
        type: [2],
      },
      {
        path: "木香/450_青木香.jpg",
        type: [2],
      },
      {
        path: "木香/470_青木香切面.jpg",
        type: [2],
      },
      {
        path: "木香/490_红木香饮片.jpg",
        type: [2],
      },
      {
        path: "木香/510_越西木香.jpg",
        type: [1],
      },
      {
        path: "木香/530_木香、川木香、土木香鉴别.jpg",
        type: [1],
      },
      {
        path: "木香/550_木香饮片.jpg",
        type: [1],
      },
      {
        path: "木香/570_煨木香.jpg",
        type: [1],
      },
      {
        path: "木香/590_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "木鳖子",
    files: [
      {
        path: "木鳖子/010_木鳖植物.jpg",
        type: [1],
      },
      {
        path: "木鳖子/030_木鳖成熟果实.jpg",
        type: [1],
      },
      {
        path: "木鳖子/050_木鳖子药材.jpg",
        type: [1],
      },
      {
        path: "木鳖子/070_木鳖子.jpg",
        type: [1],
      },
      {
        path: "木鳖子/090_木鳖子性状鉴别.jpg",
        type: [1],
      },
      {
        path: "木鳖子/110_木鳖子仁.jpg",
        type: [1],
      },
      {
        path: "木鳖子/130_木鳖子霜.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "朱砂",
    files: [
      {
        path: "朱砂/000_安神药_朱砂.jpg",
        type: [1],
      },
      {
        path: "朱砂/010_朱砂原石.jpg",
        type: [1],
      },
      {
        path: "朱砂/030_朱砂药材.jpg",
        type: [1],
      },
      {
        path: "朱砂/050_豆砂.jpg",
        type: [1],
      },
      {
        path: "朱砂/070_朱砂粉.jpg",
        type: [1],
      },
      {
        path: "朱砂/090_米砂.jpg",
        type: [1],
      },
      {
        path: "朱砂/110_镜面朱砂.jpg",
        type: [1],
      },
      {
        path: "朱砂/130_人工朱砂.jpg",
        type: [1],
      },
      {
        path: "朱砂/150_朱砂性状鉴别.jpg",
        type: [1],
      },
      {
        path: "朱砂/170_左侧为人工朱砂，不染瓶壁，右侧为染色矿物伪充朱砂，染壁.jpg",
        type: [1],
      },
      {
        path: "朱砂/190_人工朱砂.jpg",
        type: [1],
      },
      {
        path: "朱砂/210_矿物染色的伪品朱砂.jpg",
        type: [1],
      },
      {
        path: "朱砂/230_朱砂粉.jpg",
        type: [1],
      },
      {
        path: "朱砂/250_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "朱砂根",
    files: [
      {
        path: "朱砂根/010_朱砂根植物.jpg",
        type: [1],
      },
      {
        path: "朱砂根/030_朱砂根药材.jpg",
        type: [1],
      },
      {
        path: "朱砂根/050_朱砂根饮片.jpg",
        type: [1],
      },
      {
        path: "朱砂根/070_朱砂根.jpg",
        type: [1],
      },
      {
        path: "朱砂根/090_朱砂根性状鉴别.jpg",
        type: [1],
      },
      {
        path: "朱砂根/110_朱砂根饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "李根白皮",
    files: [
      {
        path: "李根白皮/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "杜仲",
    files: [
      {
        path: "杜仲/000_补虚药_杜仲.jpg",
        type: [1],
      },
      {
        path: "杜仲/010_杜仲植物.jpg",
        type: [1],
      },
      {
        path: "杜仲/030_杜仲药材.jpg",
        type: [1],
      },
      {
        path: "杜仲/050_杜仲性状鉴别.jpg",
        type: [1],
      },
      {
        path: "杜仲/070_红杜仲藤.jpg",
        type: [1],
      },
      {
        path: "杜仲/090_杜仲饮片.jpg",
        type: [1],
      },
      {
        path: "杜仲/110_盐杜仲.jpg",
        type: [1],
      },
      {
        path: "杜仲/130_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "杜仲叶",
    files: [
      {
        path: "杜仲叶/010_杜仲植物.jpg",
        type: [1],
      },
      {
        path: "杜仲叶/030_杜仲叶药材.jpg",
        type: [1],
      },
      {
        path: "杜仲叶/050_杜仲叶药材.jpg",
        type: [1],
      },
      {
        path: "杜仲叶/070_杜仲叶.jpg",
        type: [1],
      },
      {
        path: "杜仲叶/090_杜仲叶性状鉴别.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "杜衡",
    files: [
      {
        path: "杜衡/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "杠板归",
    files: [
      {
        path: "杠板归/010_杠板归植物.jpg",
        type: [1],
      },
      {
        path: "杠板归/030_杠板归药材.jpg",
        type: [1],
      },
      {
        path: "杠板归/050_杠板归饮片.jpg",
        type: [1],
      },
      {
        path: "杠板归/070_杠板归饮片.jpg",
        type: [1],
      },
      {
        path: "杠板归/090_杠板归饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "松脂",
    files: [
      {
        path: "松脂/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "松花粉",
    files: [
      {
        path: "松花粉/010_马尾松植物.jpg",
        type: [1],
      },
      {
        path: "松花粉/030_油松植物.jpg",
        type: [1],
      },
      {
        path: "松花粉/050_松花粉.jpg",
        type: [1],
      },
      {
        path: "松花粉/070_松花粉显微.jpg",
        type: [1],
      },
      {
        path: "松花粉/090_松花粉与蒲黄显微鉴别.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "松萝",
    files: [
      {
        path: "松萝/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "板蓝根",
    files: [
      {
        path: "板蓝根/010_菘蓝植物.jpg",
        type: [1],
      },
      {
        path: "板蓝根/030_板蓝根.jpg",
        type: [1],
      },
      {
        path: "板蓝根/050_板蓝根饮片.jpg",
        type: [1],
      },
      {
        path: "板蓝根/070_板蓝根饮片.jpg",
        type: [1],
      },
      {
        path: "板蓝根/090_板蓝根.jpg",
        type: [1],
      },
      {
        path: "板蓝根/110_板蓝根性状鉴别.jpg",
        type: [1],
      },
      {
        path: "板蓝根/130_板蓝根.jpg",
        type: [1],
      },
      {
        path: "板蓝根/150_南板蓝根.jpg",
        type: [1],
      },
      {
        path: "板蓝根/170_马鞭草科植物路边青的根.jpg",
        type: [1],
      },
      {
        path: "板蓝根/190_南板蓝根.jpg",
        type: [1],
      },
      {
        path: "板蓝根/210_板蓝根饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "枇杷叶",
    files: [
      {
        path: "枇杷叶/010_枇杷植物.jpg",
        type: [1],
      },
      {
        path: "枇杷叶/030_枇杷叶药材.jpg",
        type: [1],
      },
      {
        path: "枇杷叶/050_枇杷叶.jpg",
        type: [1],
      },
      {
        path: "枇杷叶/070_枇杷叶性状鉴别.jpg",
        type: [1],
      },
      {
        path: "枇杷叶/090_上：枇杷叶   下：大花五桠果叶.jpg",
        type: [1],
      },
      {
        path: "枇杷叶/110_枇杷叶饮片.jpg",
        type: [1],
      },
      {
        path: "枇杷叶/130_蜜枇杷叶.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "析蓂子",
    files: [
      {
        path: "析蓂子/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "枫香脂",
    files: [
      {
        path: "枫香脂/010_枫香树.jpg",
        type: [1],
      },
      {
        path: "枫香脂/030_枫香脂药材.jpg",
        type: [1],
      },
      {
        path: "枫香脂/050_枫香脂性状鉴别.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "枲耳实",
    files: [
      {
        path: "枲耳实/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "枳壳",
    files: [
      {
        path: "枳壳/010_酸橙.jpg",
        type: [1],
      },
      {
        path: "枳壳/030_代代花.jpg",
        type: [1],
      },
      {
        path: "枳壳/050_枳壳鲜品.jpg",
        type: [1],
      },
      {
        path: "枳壳/070_枳壳.jpg",
        type: [1],
      },
      {
        path: "枳壳/090_枳壳药材.jpg",
        type: [1],
      },
      {
        path: "枳壳/110_枳壳性状鉴别.jpg",
        type: [1],
      },
      {
        path: "枳壳/130_枳壳伪品：未成熟的柚.jpg",
        type: [1],
      },
      {
        path: "枳壳/150_左：香圆鲜果；右：枳壳鲜果.jpg",
        type: [1],
      },
      {
        path: "枳壳/170_香圆药材.jpg",
        type: [1],
      },
      {
        path: "枳壳/190_香圆金钱环.jpg",
        type: [1],
      },
      {
        path: "枳壳/210_绿衣枳壳鲜药材.jpg",
        type: [1],
      },
      {
        path: "枳壳/230_绿衣枳壳.jpg",
        type: [1],
      },
      {
        path: "枳壳/250_枳壳与青皮.jpg",
        type: [1],
      },
      {
        path: "枳壳/270_枳壳饮片.jpg",
        type: [1],
      },
      {
        path: "枳壳/290_麸炒枳壳.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "枳实",
    files: [
      {
        path: "枳实/000_行气药_枳实.jpg",
        type: [1],
      },
      {
        path: "枳实/010_酸橙植物.jpg",
        type: [1],
      },
      {
        path: "枳实/030_代代花植物.jpg",
        type: [1],
      },
      {
        path: "枳实/050_甜橙植物.jpg",
        type: [1],
      },
      {
        path: "枳实/070_枳实药材.jpg",
        type: [1],
      },
      {
        path: "枳实/090_枳实药材.jpg",
        type: [1],
      },
      {
        path: "枳实/110_枳实.jpg",
        type: [1],
      },
      {
        path: "枳实/130_枳实性状鉴别.jpg",
        type: [1],
      },
      {
        path: "枳实/150_从左向右分别是甜橙枳实、青皮、酸橙枳实、小柚子.jpg",
        type: [1],
      },
      {
        path: "枳实/170_枳实伪品：胡柚幼果.jpg",
        type: [1],
      },
      {
        path: "枳实/190_胡柚幼果.jpg",
        type: [1],
      },
      {
        path: "枳实/210_枳实饮片.jpg",
        type: [1],
      },
      {
        path: "枳实/230_麸炒枳实.jpg",
        type: [1],
      },
      {
        path: "枳实/250_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "枳椇子",
    files: [
      {
        path: "枳椇子/010_枳椇植物.jpg",
        type: [1],
      },
      {
        path: "枳椇子/030_枳椇子药材.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "枸杞子",
    files: [
      {
        path: "枸杞子/000_补虚药_枸杞子.jpg",
        type: [1],
      },
      {
        path: "枸杞子/010_枸杞植物.jpg",
        type: [1],
      },
      {
        path: "枸杞子/030_枸杞药材.jpg",
        type: [1],
      },
      {
        path: "枸杞子/050_枸杞鉴别.jpg",
        type: [1],
      },
      {
        path: "枸杞子/070_宁夏枸杞.jpg",
        type: [1],
      },
      {
        path: "枸杞子/090_不同产地的枸杞.jpg",
        type: [1],
      },
      {
        path: "枸杞子/110_枸杞熏硫对比.jpg",
        type: [1],
      },
      {
        path: "枸杞子/130_黑果枸杞.jpg",
        type: [1],
      },
      {
        path: "枸杞子/150_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "枸骨叶",
    files: [
      {
        path: "枸骨叶/010_枸骨.jpg",
        type: [1],
      },
      {
        path: "枸骨叶/030_枸骨叶药材.jpg",
        type: [1],
      },
      {
        path: "枸骨叶/050_枸骨叶.jpg",
        type: [1],
      },
      {
        path: "枸骨叶/070_枸骨叶性状鉴别.jpg",
        type: [1],
      },
      {
        path: "枸骨叶/090_枸骨叶.jpg",
        type: [1],
      },
      {
        path: "枸骨叶/110_十大功劳叶.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "柏子仁",
    files: [
      {
        path: "柏子仁/000_安神药_柏子仁.jpg",
        type: [1],
      },
      {
        path: "柏子仁/010_侧柏植物.jpg",
        type: [1],
      },
      {
        path: "柏子仁/030_柏子仁未去壳.jpg",
        type: [1],
      },
      {
        path: "柏子仁/050_柏子仁药材.jpg",
        type: [1],
      },
      {
        path: "柏子仁/070_柏子仁.jpg",
        type: [1],
      },
      {
        path: "柏子仁/090_柏子仁性状鉴别.jpg",
        type: [1],
      },
      {
        path: "柏子仁/110_柏子仁掺伪：掺大米.jpg",
        type: [2],
      },
      {
        path: "柏子仁/130_正品柏子仁和处理后的亚麻子对比.jpg",
        type: [2],
      },
      {
        path: "柏子仁/150_柏子仁伪品，刺玫果种子.jpg",
        type: [2],
      },
      {
        path: "柏子仁/170_白芝麻.jpg",
        type: [2],
      },
      {
        path: "柏子仁/190_柏子仁与混淆品.jpg",
        type: [2],
      },
      {
        path: "柏子仁/210_柏子仁与混淆品.jpg",
        type: [2],
      },
      {
        path: "柏子仁/230_柏子仁霜.jpg",
        type: [1],
      },
      {
        path: "柏子仁/250_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "柳花",
    files: [
      {
        path: "柳花/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "柴胡",
    files: [
      {
        path: "柴胡/010_柴胡植物.jpg",
        type: [1],
      },
      {
        path: "柴胡/030_狭叶柴胡植物.jpg",
        type: [1],
      },
      {
        path: "柴胡/050_北柴胡药材.jpg",
        type: [1],
      },
      {
        path: "柴胡/070_北柴胡药材.jpg",
        type: [1],
      },
      {
        path: "柴胡/090_北柴胡药材饮片.jpg",
        type: [1],
      },
      {
        path: "柴胡/110_南柴胡药材.jpg",
        type: [1],
      },
      {
        path: "柴胡/130_南柴胡药材.jpg",
        type: [1],
      },
      {
        path: "柴胡/150_南柴胡饮片.jpg",
        type: [1],
      },
      {
        path: "柴胡/170_北柴胡个子特征.jpg",
        type: [1],
      },
      {
        path: "柴胡/190_北柴胡饮片特征.jpg",
        type: [1],
      },
      {
        path: "柴胡/210_南柴胡个子特征.jpg",
        type: [1],
      },
      {
        path: "柴胡/230_南柴胡饮片特征.jpg",
        type: [1],
      },
      {
        path: "柴胡/250_北柴胡.jpg",
        type: [1],
      },
      {
        path: "柴胡/270_南柴胡.jpg",
        type: [1],
      },
      {
        path: "柴胡/290_柴胡性状鉴别.jpg",
        type: [1],
      },
      {
        path: "柴胡/310_锥叶柴胡.jpg",
        type: [2],
      },
      {
        path: "柴胡/330_锥叶柴胡.jpg",
        type: [2],
      },
      {
        path: "柴胡/350_大叶柴胡.jpg",
        type: [2],
      },
      {
        path: "柴胡/370_大叶柴胡.jpg",
        type: [2],
      },
      {
        path: "柴胡/390_竹叶柴胡.jpg",
        type: [2],
      },
      {
        path: "柴胡/410_窄竹叶柴胡.jpg",
        type: [2],
      },
      {
        path: "柴胡/430_银州柴胡.jpg",
        type: [2],
      },
      {
        path: "柴胡/450_黑柴胡.jpg",
        type: [2],
      },
      {
        path: "柴胡/470_线叶柴胡.jpg",
        type: [2],
      },
      {
        path: "柴胡/490_雾灵柴胡.jpg",
        type: [2],
      },
      {
        path: "柴胡/510_秦岭柴胡.jpg",
        type: [2],
      },
      {
        path: "柴胡/530_柴首.jpg",
        type: [2],
      },
      {
        path: "柴胡/550_九种柴胡性状比较表.jpg",
        type: [1],
      },
      {
        path: "柴胡/570_野生柴胡上部.jpg",
        type: [1],
      },
      {
        path: "柴胡/590_雾灵柴胡上部.jpg",
        type: [1],
      },
      {
        path: "柴胡/610_锥叶柴胡上部.jpg",
        type: [1],
      },
      {
        path: "柴胡/630_南柴胡上部.jpg",
        type: [1],
      },
      {
        path: "柴胡/650_南柴胡.jpg",
        type: [1],
      },
      {
        path: "柴胡/670_新疆柴胡上部.jpg",
        type: [1],
      },
      {
        path: "柴胡/690_野生柴胡中下部.jpg",
        type: [1],
      },
      {
        path: "柴胡/710_三岛柴胡.jpg",
        type: [1],
      },
      {
        path: "柴胡/730_竹叶柴胡.jpg",
        type: [1],
      },
      {
        path: "柴胡/750_藏柴胡.jpg",
        type: [1],
      },
      {
        path: "柴胡/770_北柴胡饮片.jpg",
        type: [1],
      },
      {
        path: "柴胡/790_北柴胡饮片.jpg",
        type: [1],
      },
      {
        path: "柴胡/810_醋北柴胡.jpg",
        type: [1],
      },
      {
        path: "柴胡/830_南柴胡.jpg",
        type: [1],
      },
      {
        path: "柴胡/850_醋南柴胡.jpg",
        type: [1],
      },
      {
        path: "柴胡/870_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "柿蒂",
    files: [
      {
        path: "柿蒂/010_柿植物.jpg",
        type: [1],
      },
      {
        path: "柿蒂/030_柿蒂药材.jpg",
        type: [1],
      },
      {
        path: "柿蒂/050_柿蒂.jpg",
        type: [1],
      },
      {
        path: "柿蒂/070_柿蒂性状鉴别.jpg",
        type: [1],
      },
      {
        path: "柿蒂/090_劣药 柿饼蒂.jpg",
        type: [1],
      },
      {
        path: "柿蒂/110_劣药 未成熟宿萼.jpg",
        type: [1],
      },
      {
        path: "柿蒂/130_伪品 黑枣蒂.jpg",
        type: [1],
      },
      {
        path: "柿蒂/150_柿蒂与易混品对比.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "栀子",
    files: [
      {
        path: "栀子/000_清热药_栀子.jpg",
        type: [1],
      },
      {
        path: "栀子/010_栀子植物.jpg",
        type: [1],
      },
      {
        path: "栀子/030_栀子药材.jpg",
        type: [1],
      },
      {
        path: "栀子/050_栀子性状鉴别.jpg",
        type: [1],
      },
      {
        path: "栀子/070_江西栀子.jpg",
        type: [1],
      },
      {
        path: "栀子/090_福建栀子.jpg",
        type: [1],
      },
      {
        path: "栀子/110_水栀子.jpg",
        type: [1],
      },
      {
        path: "栀子/130_水栀子与栀子对比.jpg",
        type: [1],
      },
      {
        path: "栀子/150_栀子饮片.jpg",
        type: [1],
      },
      {
        path: "栀子/170_炒栀子.jpg",
        type: [1],
      },
      {
        path: "栀子/190_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "核桃仁",
    files: [
      {
        path: "核桃仁/010_胡桃.jpg",
        type: [1],
      },
      {
        path: "核桃仁/030_核桃.jpg",
        type: [1],
      },
      {
        path: "核桃仁/050_核桃仁药材.jpg",
        type: [1],
      },
      {
        path: "核桃仁/070_核桃性状鉴别.jpg",
        type: [1],
      },
      {
        path: "核桃仁/090_分心木.jpg",
        type: [1],
      },
      {
        path: "核桃仁/110_野核桃（胡桃楸）.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "栾花",
    files: [
      {
        path: "栾花/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "桂枝",
    files: [
      {
        path: "桂枝/010_肉桂树.jpg",
        type: [1],
      },
      {
        path: "桂枝/030_桂枝药材.jpg",
        type: [1],
      },
      {
        path: "桂枝/050_桂枝斜切片.jpg",
        type: [1],
      },
      {
        path: "桂枝/070_桂枝横切片.jpg",
        type: [1],
      },
      {
        path: "桂枝/090_桂枝性状鉴别.jpg",
        type: [1],
      },
      {
        path: "桂枝/110_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "桂皮",
    files: [
      {
        path: "桂皮/010_阴香植物.jpg",
        type: [1],
      },
      {
        path: "桂皮/030_天竺桂植物.jpg",
        type: [1],
      },
      {
        path: "桂皮/050_细叶香桂植物.jpg",
        type: [1],
      },
      {
        path: "桂皮/070_川桂植物.jpg",
        type: [1],
      },
      {
        path: "桂皮/090_桂皮药材.jpg",
        type: [1],
      },
      {
        path: "桂皮/110_桂皮.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "桃仁",
    files: [
      {
        path: "桃仁/000_活血药_桃仁.jpg",
        type: [1],
      },
      {
        path: "桃仁/010_山桃树.jpg",
        type: [1],
      },
      {
        path: "桃仁/030_山桃树.jpg",
        type: [1],
      },
      {
        path: "桃仁/050_桃树.jpg",
        type: [1],
      },
      {
        path: "桃仁/070_桃树.jpg",
        type: [1],
      },
      {
        path: "桃仁/090_桃仁药材.jpg",
        type: [1],
      },
      {
        path: "桃仁/110_山桃仁药材.jpg",
        type: [1],
      },
      {
        path: "桃仁/130_桃仁性状鉴别.jpg",
        type: [1],
      },
      {
        path: "桃仁/150_桃仁与杏仁等对比.jpg",
        type: [1],
      },
      {
        path: "桃仁/170_燀桃仁.jpg",
        type: [1],
      },
      {
        path: "桃仁/190_燀山桃仁.jpg",
        type: [1],
      },
      {
        path: "桃仁/210_炒桃仁.jpg",
        type: [1],
      },
      {
        path: "桃仁/230_炒山桃仁.jpg",
        type: [1],
      },
      {
        path: "桃仁/250_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "桃枝",
    files: [
      {
        path: "桃枝/010_桃植物.jpg",
        type: [1],
      },
      {
        path: "桃枝/030_桃枝药材.jpg",
        type: [1],
      },
      {
        path: "桃枝/050_桃枝饮片.jpg",
        type: [1],
      },
      {
        path: "桃枝/070_桃枝饮片.jpg",
        type: [1],
      },
      {
        path: "桃枝/090_桃枝饮片.jpg",
        type: [1],
      },
      {
        path: "桃枝/110_桃枝饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "桐叶",
    files: [
      {
        path: "桐叶/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "桑叶",
    files: [
      {
        path: "桑叶/010_桑植物.jpg",
        type: [1],
      },
      {
        path: "桑叶/030_桑叶药材.jpg",
        type: [1],
      },
      {
        path: "桑叶/050_桑叶性状鉴别.jpg",
        type: [1],
      },
      {
        path: "桑叶/070_桑叶性状鉴别.jpg",
        type: [1],
      },
      {
        path: "桑叶/090_霜桑叶.jpg",
        type: [1],
      },
      {
        path: "桑叶/110_桑叶饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "桑寄生",
    files: [
      {
        path: "桑寄生/000_祛风湿药_桑寄生.jpg",
        type: [1],
      },
      {
        path: "桑寄生/000_祛风湿药_桑寄生2.jpg",
        type: [1],
      },
      {
        path: "桑寄生/010_桑寄生植物.jpg",
        type: [1],
      },
      {
        path: "桑寄生/030_桑寄生植物.jpg",
        type: [1],
      },
      {
        path: "桑寄生/050_桑寄生药材.jpg",
        type: [1],
      },
      {
        path: "桑寄生/070_桑寄生.jpg",
        type: [1],
      },
      {
        path: "桑寄生/090_桑寄生性状鉴别.jpg",
        type: [1],
      },
      {
        path: "桑寄生/110_扁枝槲寄生.jpg",
        type: [2],
      },
      {
        path: "桑寄生/130_毛叶桑寄生.jpg",
        type: [2],
      },
      {
        path: "桑寄生/150_槲寄生.jpg",
        type: [2],
      },
      {
        path: "桑寄生/170_桑寄生饮片.jpg",
        type: [1],
      },
      {
        path: "桑寄生/190_桑寄生饮片.jpg",
        type: [1],
      },
      {
        path: "桑寄生/210_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "桑枝",
    files: [
      {
        path: "桑枝/010_桑植物.jpg",
        type: [1],
      },
      {
        path: "桑枝/030_桑枝药材.jpg",
        type: [1],
      },
      {
        path: "桑枝/050_桑枝切片.jpg",
        type: [1],
      },
      {
        path: "桑枝/070_桑枝性状鉴别.jpg",
        type: [1],
      },
      {
        path: "桑枝/090_桑枝片.jpg",
        type: [1],
      },
      {
        path: "桑枝/110_炒桑枝.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "桑椹",
    files: [
      {
        path: "桑椹/010_桑植物.jpg",
        type: [1],
      },
      {
        path: "桑椹/030_桑椹药材.jpg",
        type: [1],
      },
      {
        path: "桑椹/050_桑椹性状鉴别.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "桑白皮",
    files: [
      {
        path: "桑白皮/000_止咳药_桑白皮.jpg",
        type: [1],
      },
      {
        path: "桑白皮/010_桑植物.jpg",
        type: [1],
      },
      {
        path: "桑白皮/030_桑白皮药材.jpg",
        type: [1],
      },
      {
        path: "桑白皮/050_桑白皮性状鉴别.jpg",
        type: [1],
      },
      {
        path: "桑白皮/070_桑白皮混淆品：构树皮.jpg",
        type: [1],
      },
      {
        path: "桑白皮/090_桑白皮混淆品：华桑.jpg",
        type: [1],
      },
      {
        path: "桑白皮/110_桑白皮混淆品：柘树皮.jpg",
        type: [1],
      },
      {
        path: "桑白皮/130_桑白皮饮片.jpg",
        type: [1],
      },
      {
        path: "桑白皮/150_蜜桑白皮.jpg",
        type: [1],
      },
      {
        path: "桑白皮/170_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "桑螵蛸",
    files: [
      {
        path: "桑螵蛸/000_收涩药_桑螵蛸.jpg",
        type: [1],
      },
      {
        path: "桑螵蛸/010_大刀螂.jpg",
        type: [1],
      },
      {
        path: "桑螵蛸/030_小刀螂.jpg",
        type: [1],
      },
      {
        path: "桑螵蛸/050_巨斧螳螂.jpg",
        type: [1],
      },
      {
        path: "桑螵蛸/070_团螵蛸.jpg",
        type: [1],
      },
      {
        path: "桑螵蛸/090_长螵蛸.jpg",
        type: [1],
      },
      {
        path: "桑螵蛸/110_黑螵蛸.jpg",
        type: [1],
      },
      {
        path: "桑螵蛸/130_桑螵蛸药材.jpg",
        type: [1],
      },
      {
        path: "桑螵蛸/150_桑螵蛸（小刀螂）.jpg",
        type: [1],
      },
      {
        path: "桑螵蛸/170_桑螵蛸性状鉴别.jpg",
        type: [1],
      },
      {
        path: "桑螵蛸/190_伪品.jpg",
        type: [1],
      },
      {
        path: "桑螵蛸/210_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "桔梗",
    files: [
      {
        path: "桔梗/000_化痰药_桔梗.jpg",
        type: [1],
      },
      {
        path: "桔梗/000_化痰药_桔梗2.jpg",
        type: [1],
      },
      {
        path: "桔梗/010_桔梗植物.jpg",
        type: [1],
      },
      {
        path: "桔梗/030_桔梗药材.jpg",
        type: [1],
      },
      {
        path: "桔梗/050_桔梗药材.jpg",
        type: [1],
      },
      {
        path: "桔梗/070_桔梗饮片.jpg",
        type: [1],
      },
      {
        path: "桔梗/090_桔梗.jpg",
        type: [1],
      },
      {
        path: "桔梗/110_桔梗性状鉴别.jpg",
        type: [1],
      },
      {
        path: "桔梗/130_丝石竹.jpg",
        type: [1],
      },
      {
        path: "桔梗/150_丝石竹切片.jpg",
        type: [1],
      },
      {
        path: "桔梗/170_南沙参.jpg",
        type: [1],
      },
      {
        path: "桔梗/190_南沙参饮片.jpg",
        type: [1],
      },
      {
        path: "桔梗/210_荠苨.jpg",
        type: [1],
      },
      {
        path: "桔梗/230_荠苨饮片.jpg",
        type: [1],
      },
      {
        path: "桔梗/250_桔梗饮片.jpg",
        type: [1],
      },
      {
        path: "桔梗/270_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "梅花",
    files: [
      {
        path: "梅花/010_梅植物.jpg",
        type: [1],
      },
      {
        path: "梅花/030_梅花药材.jpg",
        type: [1],
      },
      {
        path: "梅花/050_梅花药材.jpg",
        type: [1],
      },
      {
        path: "梅花/070_梅花性状鉴别.jpg",
        type: [1],
      },
      {
        path: "梅花/090_腊梅植物.jpg",
        type: [1],
      },
      {
        path: "梅花/110_蜡梅花药材.jpg",
        type: [1],
      },
      {
        path: "梅花/130_蜡梅花药材.jpg",
        type: [1],
      },
      {
        path: "梅花/150_蜡梅花鉴别.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "梓白皮",
    files: [
      {
        path: "梓白皮/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "棕榈",
    files: [
      {
        path: "棕榈/010_棕榈植物.jpg",
        type: [1],
      },
      {
        path: "棕榈/030_棕榈.jpg",
        type: [1],
      },
      {
        path: "棕榈/050_棕榈.jpg",
        type: [1],
      },
      {
        path: "棕榈/070_棕榈.jpg",
        type: [1],
      },
      {
        path: "棕榈/090_棕榈性状鉴别.jpg",
        type: [1],
      },
      {
        path: "棕榈/110_棕榈饮片.jpg",
        type: [1],
      },
      {
        path: "棕榈/130_棕榈炭.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "椿皮",
    files: [
      {
        path: "椿皮/010_臭椿植物.jpg",
        type: [1],
      },
      {
        path: "椿皮/030_根皮.jpg",
        type: [1],
      },
      {
        path: "椿皮/050_干皮.jpg",
        type: [1],
      },
      {
        path: "椿皮/070_椿皮.jpg",
        type: [1],
      },
      {
        path: "椿皮/090_椿皮性状鉴别.jpg",
        type: [1],
      },
      {
        path: "椿皮/110_椿皮性状鉴别.jpg",
        type: [1],
      },
      {
        path: "椿皮/130_香椿皮.jpg",
        type: [1],
      },
      {
        path: "椿皮/150_椿皮饮片.jpg",
        type: [1],
      },
      {
        path: "椿皮/170_麸炒椿皮.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "楮实子",
    files: [
      {
        path: "楮实子/010_构树.jpg",
        type: [1],
      },
      {
        path: "楮实子/030_楮实子药材.jpg",
        type: [1],
      },
      {
        path: "楮实子/050_楮实子.jpg",
        type: [1],
      },
      {
        path: "楮实子/070_楮实子性状鉴别.jpg",
        type: [1],
      },
      {
        path: "楮实子/090_楮实子放大.jpg",
        type: [1],
      },
      {
        path: "楮实子/110_山稗子.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "榆白皮",
    files: [
      {
        path: "榆白皮/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "榧子",
    files: [
      {
        path: "榧子/010_榧植物.jpg",
        type: [1],
      },
      {
        path: "榧子/030_榧子药材.jpg",
        type: [1],
      },
      {
        path: "榧子/050_榧子药材.jpg",
        type: [1],
      },
      {
        path: "榧子/070_榧子性状鉴别.jpg",
        type: [1],
      },
      {
        path: "榧子/090_三尖杉子.jpg",
        type: [1],
      },
      {
        path: "榧子/110_巴山榧树子.jpg",
        type: [1],
      },
      {
        path: "榧子/130_巴山榧树子种仁.jpg",
        type: [1],
      },
      {
        path: "榧子/150_云南榧子.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "榼藤子",
    files: [
      {
        path: "榼藤子/010_榼藤子.jpg",
        type: [1],
      },
      {
        path: "榼藤子/030_榼藤子药材.jpg",
        type: [1],
      },
      {
        path: "榼藤子/050_榼藤子药材.jpg",
        type: [1],
      },
      {
        path: "榼藤子/070_榼藤子药材.jpg",
        type: [1],
      },
      {
        path: "榼藤子/090_榼藤子种仁.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "槀本",
    files: [
      {
        path: "槀本/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "槐实",
    files: [
      {
        path: "槐实/000_止血药_槐花.jpg",
        type: [1],
      },
      {
        path: "槐实/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "槐花",
    files: [
      {
        path: "槐花/010_槐植物.jpg",
        type: [1],
      },
      {
        path: "槐花/030_槐花药材.jpg",
        type: [1],
      },
      {
        path: "槐花/050_槐米药材.jpg",
        type: [1],
      },
      {
        path: "槐花/070_槐花性状鉴别.jpg",
        type: [1],
      },
      {
        path: "槐花/090_刺槐植物.jpg",
        type: [1],
      },
      {
        path: "槐花/110_刺槐花.jpg",
        type: [1],
      },
      {
        path: "槐花/130_炒槐花.jpg",
        type: [1],
      },
      {
        path: "槐花/150_槐花炭.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "槐角",
    files: [
      {
        path: "槐角/010_槐植物.jpg",
        type: [1],
      },
      {
        path: "槐角/030_槐角药材.jpg",
        type: [1],
      },
      {
        path: "槐角/050_槐角.jpg",
        type: [1],
      },
      {
        path: "槐角/070_槐角性状鉴别.jpg",
        type: [1],
      },
      {
        path: "槐角/090_洋槐的果实.jpg",
        type: [1],
      },
      {
        path: "槐角/110_蜜槐角.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "槟榔",
    files: [
      {
        path: "槟榔/010_槟榔植物.jpg",
        type: [1],
      },
      {
        path: "槟榔/030_槟榔鲜果.jpg",
        type: [1],
      },
      {
        path: "槟榔/050_槟榔.jpg",
        type: [1],
      },
      {
        path: "槟榔/070_槟榔药材.jpg",
        type: [1],
      },
      {
        path: "槟榔/090_槟榔性状鉴别.jpg",
        type: [1],
      },
      {
        path: "槟榔/110_枣槟榔.jpg",
        type: [1],
      },
      {
        path: "槟榔/130_槟榔饮片.jpg",
        type: [1],
      },
      {
        path: "槟榔/150_炒槟榔.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "槲寄生",
    files: [
      {
        path: "槲寄生/010_槲寄生植物.jpg",
        type: [1],
      },
      {
        path: "槲寄生/030_槲寄生.jpg",
        type: [1],
      },
      {
        path: "槲寄生/050_槲寄生药材.jpg",
        type: [1],
      },
      {
        path: "槲寄生/070_槲寄生.jpg",
        type: [1],
      },
      {
        path: "槲寄生/090_槲寄生的髓常偏向一侧.jpg",
        type: [1],
      },
      {
        path: "槲寄生/110_槲寄生性状鉴别.jpg",
        type: [1],
      },
      {
        path: "槲寄生/130_扁枝槲寄生.jpg",
        type: [1],
      },
      {
        path: "槲寄生/150_扁枝槲寄生.jpg",
        type: [1],
      },
      {
        path: "槲寄生/170_槲寄生饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "樗鸡",
    files: [
      {
        path: "樗鸡/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "橘核",
    files: [
      {
        path: "橘核/010_橘植物.jpg",
        type: [1],
      },
      {
        path: "橘核/030_橘子.jpg",
        type: [1],
      },
      {
        path: "橘核/050_橘核药材.jpg",
        type: [1],
      },
      {
        path: "橘核/070_橘核伪品，柚子核，个头大，仁黄白色.jpg",
        type: [1],
      },
      {
        path: "橘核/090_盐橘核.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "橘红",
    files: [
      {
        path: "橘红/010_橘植物.jpg",
        type: [1],
      },
      {
        path: "橘红/030_橘红药材.jpg",
        type: [1],
      },
      {
        path: "橘红/050_橘红饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "檀香",
    files: [
      {
        path: "檀香/010_檀香植物.jpg",
        type: [1],
      },
      {
        path: "檀香/030_檀香药材.jpg",
        type: [1],
      },
      {
        path: "檀香/050_檀香性状鉴别.jpg",
        type: [1],
      },
      {
        path: "檀香/070_檀香.jpg",
        type: [1],
      },
      {
        path: "檀香/090_老山檀正品，香气浓郁富奶香，油性也不错，无杂质白皮因其油性好色偏红多称“红肉料”.jpg",
        type: [1],
      },
      {
        path: "檀香/110_左侧为伪品芭比檀，中间为印尼檀香新料、右侧为正品老山檀.jpg",
        type: [1],
      },
      {
        path: "檀香/130_左侧为老山檀新料，油性差，密度低，香气不明显，中间为伪品芭比檀，右侧为正品老山檀.jpg",
        type: [1],
      },
      {
        path: "檀香/150_左侧为老山檀，但油性很差，品质一般，右侧疑是非药典品“非洲红檀”.jpg",
        type: [1],
      },
      {
        path: "檀香/170_印尼檀香种植料，也为药典品正品，但一般碎料价格极低所以会掺入老山檀中.jpg",
        type: [1],
      },
      {
        path: "檀香/190_西澳檀香碎粒，为非药典品檀香.jpg",
        type: [1],
      },
      {
        path: "檀香/210_伪品檀香，纯假无掺，多为白木浸油干燥而得.jpg",
        type: [1],
      },
      {
        path: "檀香/230_檀香混淆品（印度柚木）.jpg",
        type: [1],
      },
      {
        path: "檀香/250_檀香混淆品（印度柚木）.jpg",
        type: [1],
      },
      {
        path: "檀香/270_檀香混淆品（进口绿檀）.jpg",
        type: [1],
      },
      {
        path: "檀香/290_檀香混淆品（玫瑰红檀）.jpg",
        type: [1],
      },
      {
        path: "檀香/310_伪品浸油檀香，香气差，刺鼻，密度低，还有冒油感.jpg",
        type: [1],
      },
      {
        path: "檀香/330_檀香混淆品（某种柏木）.jpg",
        type: [1],
      },
      {
        path: "檀香/350_檀香饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "款冬花",
    files: [
      {
        path: "款冬花/000_止咳药_款冬花.jpg",
        type: [1],
      },
      {
        path: "款冬花/010_款冬植物.jpg",
        type: [1],
      },
      {
        path: "款冬花/030_款冬花.jpg",
        type: [1],
      },
      {
        path: "款冬花/050_款冬花药材.jpg",
        type: [1],
      },
      {
        path: "款冬花/070_款冬花.jpg",
        type: [1],
      },
      {
        path: "款冬花/090_款冬花性状鉴别.jpg",
        type: [1],
      },
      {
        path: "款冬花/110_款冬花掺杂：掺花梗及根茎.jpg",
        type: [1],
      },
      {
        path: "款冬花/130_款冬花饮片.jpg",
        type: [1],
      },
      {
        path: "款冬花/150_蜜款冬花饮片.jpg",
        type: [1],
      },
      {
        path: "款冬花/170_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "殷孽",
    files: [
      {
        path: "殷孽/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "毛诃子",
    files: [
      {
        path: "毛诃子/010_毗黎勒植物.jpg",
        type: [1],
      },
      {
        path: "毛诃子/030_毛诃子.jpg",
        type: [1],
      },
      {
        path: "毛诃子/050_毛诃子.jpg",
        type: [1],
      },
      {
        path: "毛诃子/070_毛诃子.jpg",
        type: [1],
      },
      {
        path: "毛诃子/090_诃子.jpg",
        type: [1],
      },
      {
        path: "毛诃子/110_青果.jpg",
        type: [1],
      },
      {
        path: "毛诃子/130_毛诃子.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "水半夏",
    files: [
      {
        path: "水半夏/010_鞭檐犁头尖植物.jpg",
        type: [1],
      },
      {
        path: "水半夏/030_水半夏药材.jpg",
        type: [1],
      },
      {
        path: "水半夏/050_水半夏.jpg",
        type: [1],
      },
      {
        path: "水半夏/070_水半夏饮片.jpg",
        type: [1],
      },
      {
        path: "水半夏/090_水半夏饮片.jpg",
        type: [1],
      },
      {
        path: "水半夏/110_半夏.jpg",
        type: [1],
      },
      {
        path: "水半夏/130_水半夏.jpg",
        type: [1],
      },
      {
        path: "水半夏/150_清水半夏.jpg",
        type: [1],
      },
      {
        path: "水半夏/170_法水半夏.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "水牛角",
    files: [
      {
        path: "水牛角/010_水牛.jpg",
        type: [1],
      },
      {
        path: "水牛角/030_水牛角药材.jpg",
        type: [1],
      },
      {
        path: "水牛角/050_水牛角.jpg",
        type: [1],
      },
      {
        path: "水牛角/070_水牛角性状鉴别.jpg",
        type: [1],
      },
      {
        path: "水牛角/090_水牛角片.jpg",
        type: [1],
      },
      {
        path: "水牛角/110_水牛角丝.jpg",
        type: [1],
      },
      {
        path: "水牛角/130_提取残渣.jpg",
        type: [1],
      },
      {
        path: "水牛角/150_水牛角角塞.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "水红花子",
    files: [
      {
        path: "水红花子/010_红蓼植物.jpg",
        type: [1],
      },
      {
        path: "水红花子/030_水红花子药材.jpg",
        type: [1],
      },
      {
        path: "水红花子/050_水红花子性状鉴别.jpg",
        type: [1],
      },
      {
        path: "水红花子/070_垂序商陆种子.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "水苏",
    files: [
      {
        path: "水苏/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "水蛭",
    files: [
      {
        path: "水蛭/000_活血药_水蛭.jpg",
        type: [1],
      },
      {
        path: "水蛭/010_蚂蟥.jpg",
        type: [1],
      },
      {
        path: "水蛭/030_水蛭.jpg",
        type: [1],
      },
      {
        path: "水蛭/050_柳叶蚂蟥.jpg",
        type: [1],
      },
      {
        path: "水蛭/070_水蛭药材.jpg",
        type: [1],
      },
      {
        path: "水蛭/090_水蛭.jpg",
        type: [1],
      },
      {
        path: "水蛭/110_柳叶蚂蟥.jpg",
        type: [1],
      },
      {
        path: "水蛭/130_水蛭性状鉴别.jpg",
        type: [1],
      },
      {
        path: "水蛭/150_三种水蛭区别.jpg",
        type: [1],
      },
      {
        path: "水蛭/170_加矾水蛭.jpg",
        type: [1],
      },
      {
        path: "水蛭/190_伪品黑条.jpg",
        type: [1],
      },
      {
        path: "水蛭/210_提取过的水蛭.jpg",
        type: [1],
      },
      {
        path: "水蛭/230_伪品菲牛蛭.jpg",
        type: [1],
      },
      {
        path: "水蛭/250_伪品菲牛蛭.jpg",
        type: [1],
      },
      {
        path: "水蛭/270_水蛭切段.jpg",
        type: [1],
      },
      {
        path: "水蛭/290_烫水蛭.jpg",
        type: [1],
      },
      {
        path: "水蛭/310_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "水银",
    files: [
      {
        path: "水银/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "水靳",
    files: [
      {
        path: "水靳/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "水飞蓟",
    files: [
      {
        path: "水飞蓟/010_水飞蓟植物.jpg",
        type: [1],
      },
      {
        path: "水飞蓟/030_水飞蓟药材.jpg",
        type: [1],
      },
      {
        path: "水飞蓟/050_水飞蓟药材.jpg",
        type: [1],
      },
      {
        path: "水飞蓟/070_水飞蓟药材.jpg",
        type: [1],
      },
      {
        path: "水飞蓟/090_水飞蓟性状鉴别.jpg",
        type: [1],
      },
      {
        path: "水飞蓟/110_水飞蓟药材.jpg",
        type: [1],
      },
      {
        path: "水飞蓟/130_水飞蓟与易混品比较图.jpg",
        type: [1],
      },
      {
        path: "水飞蓟/150_水飞蓟与易混品比较表.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "沉香",
    files: [
      {
        path: "沉香/010_白木香植物.jpg",
        type: [1],
      },
      {
        path: "沉香/030_海南产.jpg",
        type: [1],
      },
      {
        path: "沉香/050_海南产.jpg",
        type: [1],
      },
      {
        path: "沉香/070_海南产.jpg",
        type: [1],
      },
      {
        path: "沉香/090_广东产.jpg",
        type: [1],
      },
      {
        path: "沉香/110_广东产.jpg",
        type: [1],
      },
      {
        path: "沉香/130_广东产.jpg",
        type: [1],
      },
      {
        path: "沉香/150_人工结香.jpg",
        type: [1],
      },
      {
        path: "沉香/170_海南产人工结香.jpg",
        type: [1],
      },
      {
        path: "沉香/190_马来西亚产.jpg",
        type: [1],
      },
      {
        path: "沉香/210_马来西亚产.jpg",
        type: [1],
      },
      {
        path: "沉香/230_印尼产.jpg",
        type: [1],
      },
      {
        path: "沉香/250_印尼产.jpg",
        type: [1],
      },
      {
        path: "沉香/270_沉香劣品.jpg",
        type: [1],
      },
      {
        path: "沉香/290_沉香劣品.jpg",
        type: [1],
      },
      {
        path: "沉香/310_沉香掺伪品.jpg",
        type: [1],
      },
      {
        path: "沉香/330_沉香掺伪品.jpg",
        type: [1],
      },
      {
        path: "沉香/350_沉香掺伪品.jpg",
        type: [1],
      },
      {
        path: "沉香/370_沉香掺伪品.jpg",
        type: [1],
      },
      {
        path: "沉香/390_沉香掺伪品.jpg",
        type: [1],
      },
      {
        path: "沉香/410_沉香掺伪品.jpg",
        type: [1],
      },
      {
        path: "沉香/430_沉香掺伪品.jpg",
        type: [1],
      },
      {
        path: "沉香/450_沉香掺伪品.jpg",
        type: [1],
      },
      {
        path: "沉香/470_沉香掺伪品.jpg",
        type: [1],
      },
      {
        path: "沉香/490_沉香掺伪品.jpg",
        type: [1],
      },
      {
        path: "沉香/510_沉香伪品.jpg",
        type: [1],
      },
      {
        path: "沉香/530_沉香伪品.jpg",
        type: [1],
      },
      {
        path: "沉香/550_沉香伪品.jpg",
        type: [1],
      },
      {
        path: "沉香/570_沉香伪品.jpg",
        type: [1],
      },
      {
        path: "沉香/590_沉香伪品.jpg",
        type: [1],
      },
      {
        path: "沉香/610_沉香伪品.jpg",
        type: [1],
      },
      {
        path: "沉香/630_沉香.jpg",
        type: [1],
      },
      {
        path: "沉香/650_沉香性状鉴别.jpg",
        type: [1],
      },
      {
        path: "沉香/670_沉香饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "沙棘",
    files: [
      {
        path: "沙棘/010_沙棘植物.jpg",
        type: [1],
      },
      {
        path: "沙棘/030_沙棘药材.jpg",
        type: [1],
      },
      {
        path: "沙棘/050_沙棘药材.jpg",
        type: [1],
      },
      {
        path: "沙棘/070_沙棘.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "沙苑子",
    files: [
      {
        path: "沙苑子/010_扁茎黄芪植物.jpg",
        type: [1],
      },
      {
        path: "沙苑子/030_沙苑子药材.jpg",
        type: [1],
      },
      {
        path: "沙苑子/050_沙苑子.jpg",
        type: [1],
      },
      {
        path: "沙苑子/070_左沙苑子 右紫云英.jpg",
        type: [1],
      },
      {
        path: "沙苑子/090_伪品：猪屎豆、光萼猪屎豆、磨盘草种子.jpg",
        type: [1],
      },
      {
        path: "沙苑子/110_盐沙苑子.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "没药",
    files: [
      {
        path: "没药/000_活血药_没药.jpg",
        type: [1],
      },
      {
        path: "没药/010_地丁树植物.jpg",
        type: [1],
      },
      {
        path: "没药/030_天然没药.jpg",
        type: [1],
      },
      {
        path: "没药/050_天然没药.jpg",
        type: [1],
      },
      {
        path: "没药/070_胶质没药.jpg",
        type: [1],
      },
      {
        path: "没药/090_胶质没药.jpg",
        type: [1],
      },
      {
        path: "没药/110_没药性状鉴别.jpg",
        type: [1],
      },
      {
        path: "没药/130_杂质检查.jpg",
        type: [1],
      },
      {
        path: "没药/150_醋没药.jpg",
        type: [1],
      },
      {
        path: "没药/170_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "油松节",
    files: [
      {
        path: "油松节/010_油松植物.jpg",
        type: [1],
      },
      {
        path: "油松节/030_马尾松植物.jpg",
        type: [1],
      },
      {
        path: "油松节/050_油松节药材.jpg",
        type: [1],
      },
      {
        path: "油松节/070_油松节饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "泽兰",
    files: [
      {
        path: "泽兰/010_泽兰植物.jpg",
        type: [1],
      },
      {
        path: "泽兰/030_泽兰.jpg",
        type: [1],
      },
      {
        path: "泽兰/050_泽兰.jpg",
        type: [1],
      },
      {
        path: "泽兰/070_泽兰.jpg",
        type: [1],
      },
      {
        path: "泽兰/090_泽兰.jpg",
        type: [1],
      },
      {
        path: "泽兰/110_泽兰.jpg",
        type: [1],
      },
      {
        path: "泽兰/130_泽兰.jpg",
        type: [1],
      },
      {
        path: "泽兰/150_泽兰性状鉴别.jpg",
        type: [1],
      },
      {
        path: "泽兰/170_地瓜儿苗.jpg",
        type: [2],
      },
      {
        path: "泽兰/190_石吊兰.jpg",
        type: [2],
      },
      {
        path: "泽兰/210_泽兰饮片.jpg",
        type: [1],
      },
      {
        path: "泽兰/230_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "泽泻",
    files: [
      {
        path: "泽泻/000_利水渗湿药_泽泻.jpg",
        type: [1],
      },
      {
        path: "泽泻/000_利水渗湿药_泽泻2.jpg",
        type: [1],
      },
      {
        path: "泽泻/010_东方泽泻.jpg",
        type: [1],
      },
      {
        path: "泽泻/030_泽泻.jpg",
        type: [1],
      },
      {
        path: "泽泻/050_泽泻药材.jpg",
        type: [1],
      },
      {
        path: "泽泻/070_泽泻药材.jpg",
        type: [1],
      },
      {
        path: "泽泻/090_泽泻饮片.jpg",
        type: [1],
      },
      {
        path: "泽泻/110_泽泻饮片.jpg",
        type: [1],
      },
      {
        path: "泽泻/130_泽泻性状鉴别.jpg",
        type: [1],
      },
      {
        path: "泽泻/150_荆三棱.jpg",
        type: [2],
      },
      {
        path: "泽泻/170_泽泻与混伪品的性状鉴别.jpg",
        type: [1],
      },
      {
        path: "泽泻/190_泽泻饮片.jpg",
        type: [1],
      },
      {
        path: "泽泻/210_盐泽泻.jpg",
        type: [1],
      },
      {
        path: "泽泻/230_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "泽漆",
    files: [
      {
        path: "泽漆/010_泽漆植物.jpg",
        type: [1],
      },
      {
        path: "泽漆/030_泽漆药材.jpg",
        type: [1],
      },
      {
        path: "泽漆/050_泽漆饮片.jpg",
        type: [1],
      },
      {
        path: "泽漆/070_泽漆饮片.jpg",
        type: [1],
      },
      {
        path: "泽漆/090_泽漆饮片.jpg",
        type: [1],
      },
      {
        path: "泽漆/110_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "洋金花",
    files: [
      {
        path: "洋金花/010_白花曼陀罗植物.jpg",
        type: [1],
      },
      {
        path: "洋金花/030_洋金花.jpg",
        type: [1],
      },
      {
        path: "洋金花/050_洋金花药材.jpg",
        type: [1],
      },
      {
        path: "洋金花/070_洋金花性状鉴别.jpg",
        type: [1],
      },
      {
        path: "洋金花/090_毛曼陀罗.jpg",
        type: [1],
      },
      {
        path: "洋金花/110_北洋金花.jpg",
        type: [1],
      },
      {
        path: "洋金花/130_曼陀罗.jpg",
        type: [1],
      },
      {
        path: "洋金花/150_洋金花、北洋金花、曼陀罗对比.jpg",
        type: [1],
      },
      {
        path: "洋金花/170_北洋金花（左）和洋金花（右）在显微镜下绒毛表面关对比。.jpg",
        type: [1],
      },
      {
        path: "洋金花/190_凌霄花.jpg",
        type: [1],
      },
      {
        path: "洋金花/210_美洲凌霄花.jpg",
        type: [1],
      },
      {
        path: "洋金花/230_美洲凌霄花.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "洪连",
    files: [
      {
        path: "洪连/010_短筒兔耳草植物.jpg",
        type: [1],
      },
      {
        path: "洪连/030_洪连药材.jpg",
        type: [1],
      },
      {
        path: "洪连/050_洪连药材.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "浙贝母",
    files: [
      {
        path: "浙贝母/010_浙贝母植物.jpg",
        type: [1],
      },
      {
        path: "浙贝母/030_大贝.jpg",
        type: [1],
      },
      {
        path: "浙贝母/050_珠贝.jpg",
        type: [1],
      },
      {
        path: "浙贝母/070_浙贝片.jpg",
        type: [1],
      },
      {
        path: "浙贝母/090_有硫非趁鲜浙贝片.jpg",
        type: [1],
      },
      {
        path: "浙贝母/110_浙贝母药材.jpg",
        type: [1],
      },
      {
        path: "浙贝母/130_浙贝母-珠贝（无硫、有硫）.jpg",
        type: [1],
      },
      {
        path: "浙贝母/150_浙贝母.jpg",
        type: [1],
      },
      {
        path: "浙贝母/170_浙贝母性状鉴别.jpg",
        type: [1],
      },
      {
        path: "浙贝母/190_湖北贝母.jpg",
        type: [1],
      },
      {
        path: "浙贝母/210_湖北贝母.jpg",
        type: [1],
      },
      {
        path: "浙贝母/230_皖贝母.jpg",
        type: [1],
      },
      {
        path: "浙贝母/250_皖贝母.jpg",
        type: [1],
      },
      {
        path: "浙贝母/270_上浙贝母（有硫）、下湖北贝母（无硫），鳞茎基部褶皱或纵沟有明显区别.jpg",
        type: [1],
      },
      {
        path: "浙贝母/290_上浙贝母（无硫）、下湖北贝母（有硫），浙贝母大贝鳞叶肥厚，湖北贝母外层单瓣鳞叶较薄，边缘尤甚。.jpg",
        type: [1],
      },
      {
        path: "浙贝母/310_浙贝母饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "浮海石浮石",
    files: [
      {
        path: "浮海石浮石/010_浮海石药材.jpg",
        type: [1],
      },
      {
        path: "浮海石浮石/030_浮海石药材.jpg",
        type: [1],
      },
      {
        path: "浮海石浮石/050_浮石药材.jpg",
        type: [1],
      },
      {
        path: "浮海石浮石/070_浮石药材.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "浮萍",
    files: [
      {
        path: "浮萍/010_紫萍.jpg",
        type: [1],
      },
      {
        path: "浮萍/030_浮萍药材.jpg",
        type: [1],
      },
      {
        path: "浮萍/050_浮萍.jpg",
        type: [1],
      },
      {
        path: "浮萍/070_浮萍.jpg",
        type: [1],
      },
      {
        path: "浮萍/090_浮萍.jpg",
        type: [1],
      },
      {
        path: "浮萍/110_大薸.jpg",
        type: [1],
      },
      {
        path: "浮萍/130_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "海桐皮",
    files: [
      {
        path: "海桐皮/010_刺桐.jpg",
        type: [1],
      },
      {
        path: "海桐皮/030_乔木刺桐.jpg",
        type: [1],
      },
      {
        path: "海桐皮/050_海桐皮（乔木刺桐）.jpg",
        type: [1],
      },
      {
        path: "海桐皮/070_海桐皮.jpg",
        type: [1],
      },
      {
        path: "海桐皮/090_木棉植物.jpg",
        type: [1],
      },
      {
        path: "海桐皮/110_木棉.jpg",
        type: [1],
      },
      {
        path: "海桐皮/130_广海桐皮.jpg",
        type: [1],
      },
      {
        path: "海桐皮/150_广海桐皮.jpg",
        type: [1],
      },
      {
        path: "海桐皮/170_樗叶花椒.jpg",
        type: [1],
      },
      {
        path: "海桐皮/190_朵椒.jpg",
        type: [1],
      },
      {
        path: "海桐皮/210_樗叶花椒.jpg",
        type: [1],
      },
      {
        path: "海桐皮/230_淅桐皮（左：樗叶花椒     右：朵椒）.jpg",
        type: [1],
      },
      {
        path: "海桐皮/250_淅桐皮药材.jpg",
        type: [1],
      },
      {
        path: "海桐皮/270_刺楸.jpg",
        type: [1],
      },
      {
        path: "海桐皮/290_川桐皮.jpg",
        type: [1],
      },
      {
        path: "海桐皮/310_川桐皮.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "海藻",
    files: [
      {
        path: "海藻/000_化痰药_海藻.jpg",
        type: [1],
      },
      {
        path: "海藻/010_海蒿子.jpg",
        type: [1],
      },
      {
        path: "海藻/030_羊栖菜.jpg",
        type: [1],
      },
      {
        path: "海藻/050_大叶海藻药材.jpg",
        type: [1],
      },
      {
        path: "海藻/070_小叶海藻药材.jpg",
        type: [1],
      },
      {
        path: "海藻/090_大叶海藻.jpg",
        type: [1],
      },
      {
        path: "海藻/110_大叶海藻.jpg",
        type: [1],
      },
      {
        path: "海藻/130_小叶海藻.jpg",
        type: [1],
      },
      {
        path: "海藻/150_小叶海藻.jpg",
        type: [1],
      },
      {
        path: "海藻/170_海藻（羊栖菜）.jpg",
        type: [1],
      },
      {
        path: "海藻/190_海藻性状鉴别.jpg",
        type: [1],
      },
      {
        path: "海藻/210_铁钉菜.jpg",
        type: [1],
      },
      {
        path: "海藻/230_铜藻.jpg",
        type: [1],
      },
      {
        path: "海藻/250_海藻饮片.jpg",
        type: [1],
      },
      {
        path: "海藻/270_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "海蛤",
    files: [
      {
        path: "海蛤/000_化痰药_海蛤壳.jpg",
        type: [1],
      },
      {
        path: "海蛤/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "海螵蛸",
    files: [
      {
        path: "海螵蛸/010_无针乌贼.jpg",
        type: [1],
      },
      {
        path: "海螵蛸/030_金乌贼.jpg",
        type: [1],
      },
      {
        path: "海螵蛸/050_无针乌贼.jpg",
        type: [1],
      },
      {
        path: "海螵蛸/070_海螵蛸：金乌贼.jpg",
        type: [1],
      },
      {
        path: "海螵蛸/090_海螵蛸：金乌贼.jpg",
        type: [1],
      },
      {
        path: "海螵蛸/110_海螵蛸性状鉴别.jpg",
        type: [1],
      },
      {
        path: "海螵蛸/130_无针乌贼.jpg",
        type: [1],
      },
      {
        path: "海螵蛸/150_海螵蛸饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "海金沙",
    files: [
      {
        path: "海金沙/010_海金沙植物.jpg",
        type: [1],
      },
      {
        path: "海金沙/030_海金沙孢子囊.jpg",
        type: [1],
      },
      {
        path: "海金沙/050_海金沙药材.jpg",
        type: [1],
      },
      {
        path: "海金沙/070_海金沙鉴别.jpg",
        type: [1],
      },
      {
        path: "海金沙/090_显微鉴别.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "海风藤",
    files: [
      {
        path: "海风藤/010_风藤植物.jpg",
        type: [1],
      },
      {
        path: "海风藤/030_海风藤药材.jpg",
        type: [1],
      },
      {
        path: "海风藤/050_海风藤饮片.jpg",
        type: [1],
      },
      {
        path: "海风藤/070_海风藤.jpg",
        type: [1],
      },
      {
        path: "海风藤/090_山蒟.jpg",
        type: [1],
      },
      {
        path: "海风藤/110_长松萝.jpg",
        type: [1],
      },
      {
        path: "海风藤/130_海风藤.jpg",
        type: [1],
      },
      {
        path: "海风藤/150_广东海风藤.jpg",
        type: [1],
      },
      {
        path: "海风藤/170_海风藤饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "海马",
    files: [
      {
        path: "海马/010_海马.jpg",
        type: [1],
      },
      {
        path: "海马/030_线纹海马.jpg",
        type: [1],
      },
      {
        path: "海马/050_海马头.jpg",
        type: [1],
      },
      {
        path: "海马/070_海马躯干.jpg",
        type: [1],
      },
      {
        path: "海马/090_刺海马（又名鰕姑，马头鱼）.jpg",
        type: [1],
      },
      {
        path: "海马/110_海马背鳍.jpg",
        type: [1],
      },
      {
        path: "海马/130_大海马.jpg",
        type: [1],
      },
      {
        path: "海马/150_三斑海马（又名水马，水雁，海狗子，斑海马）.jpg",
        type: [1],
      },
      {
        path: "海马/170_海马体侧背部.jpg",
        type: [1],
      },
      {
        path: "海马/190_小海马（海蛆）.jpg",
        type: [1],
      },
      {
        path: "海马/210_海马投影图.jpg",
        type: [1],
      },
      {
        path: "海马/230_海马雌雄.jpg",
        type: [1],
      },
      {
        path: "海马/250_太平洋海马（非药典品）.jpg",
        type: [1],
      },
      {
        path: "海马/270_增重海马腹部对光图.jpg",
        type: [1],
      },
      {
        path: "海马/290_正常海马腹部对光图.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "海龙",
    files: [
      {
        path: "海龙/010_刁海龙.jpg",
        type: [1],
      },
      {
        path: "海龙/030_刁海龙.jpg",
        type: [1],
      },
      {
        path: "海龙/050_刁海龙.jpg",
        type: [1],
      },
      {
        path: "海龙/070_拟海龙.jpg",
        type: [1],
      },
      {
        path: "海龙/090_拟海龙.jpg",
        type: [1],
      },
      {
        path: "海龙/110_尖海龙.jpg",
        type: [1],
      },
      {
        path: "海龙/130_尖海龙.jpg",
        type: [1],
      },
      {
        path: "海龙/150_尖海龙.jpg",
        type: [1],
      },
      {
        path: "海龙/170_刁海龙、拟海龙比较.jpg",
        type: [1],
      },
      {
        path: "海龙/190_三种海龙详图.jpg",
        type: [1],
      },
      {
        path: "海龙/210_宝珈海龙.jpg",
        type: [1],
      },
      {
        path: "海龙/230_宝珈海龙.jpg",
        type: [1],
      },
      {
        path: "海龙/250_多棘刁海龙.jpg",
        type: [1],
      },
      {
        path: "海龙/270_上：海龙  下：粗吻海龙.jpg",
        type: [1],
      },
      {
        path: "海龙/290_粗吻海龙.jpg",
        type: [1],
      },
      {
        path: "海龙/310_粗吻海龙躯干侧部纹理.jpg",
        type: [1],
      },
      {
        path: "海龙/330_蓝海龙.jpg",
        type: [1],
      },
      {
        path: "海龙/350_刺冠海龙.jpg",
        type: [1],
      },
      {
        path: "海龙/370_舒海龙.jpg",
        type: [1],
      },
      {
        path: "海龙/390_伪品：黑斑刁海龙.jpg",
        type: [1],
      },
      {
        path: "海龙/410_非药典品.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "淡竹叶",
    files: [
      {
        path: "淡竹叶/000_清热药_淡竹叶.jpg",
        type: [1],
      },
      {
        path: "淡竹叶/010_淡竹叶.jpg",
        type: [1],
      },
      {
        path: "淡竹叶/030_淡竹叶.jpg",
        type: [1],
      },
      {
        path: "淡竹叶/050_淡竹叶药材.jpg",
        type: [1],
      },
      {
        path: "淡竹叶/070_淡竹叶药材整株.jpg",
        type: [1],
      },
      {
        path: "淡竹叶/090_淡竹叶.jpg",
        type: [1],
      },
      {
        path: "淡竹叶/110_淡竹叶.jpg",
        type: [1],
      },
      {
        path: "淡竹叶/130_淡竹叶性状鉴别.jpg",
        type: [1],
      },
      {
        path: "淡竹叶/150_淡竹叶叶面叶脉（上面+背面）.jpg",
        type: [1],
      },
      {
        path: "淡竹叶/170_芦苇叶.jpg",
        type: [1],
      },
      {
        path: "淡竹叶/190_芦苇叶叶面叶脉（背面+上面）.jpg",
        type: [1],
      },
      {
        path: "淡竹叶/210_苦竹叶片.jpg",
        type: [1],
      },
      {
        path: "淡竹叶/230_苦竹叶叶面叶脉（上面+背面）.jpg",
        type: [1],
      },
      {
        path: "淡竹叶/250_苦竹叶片.jpg",
        type: [1],
      },
      {
        path: "淡竹叶/270_淡竹叶及伪品对比.jpg",
        type: [1],
      },
      {
        path: "淡竹叶/290_淡竹叶-苦竹叶-芦苇叶（叶基对比）.jpg",
        type: [1],
      },
      {
        path: "淡竹叶/310_淡竹叶+芦苇叶+苦竹叶（叶脉对比）.jpg",
        type: [1],
      },
      {
        path: "淡竹叶/330_淡竹叶饮片.jpg",
        type: [1],
      },
      {
        path: "淡竹叶/350_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "淡豆豉",
    files: [
      {
        path: "淡豆豉/010_大豆植物.jpg",
        type: [1],
      },
      {
        path: "淡豆豉/030_大豆.jpg",
        type: [1],
      },
      {
        path: "淡豆豉/050_淡豆豉药材.jpg",
        type: [1],
      },
      {
        path: "淡豆豉/070_淡豆豉性状鉴别.jpg",
        type: [1],
      },
      {
        path: "淡豆豉/090_左未发酵 右发酵.jpg",
        type: [1],
      },
      {
        path: "淡豆豉/110_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "淫羊藿",
    files: [
      {
        path: "淫羊藿/000_补虚药_淫羊藿.jpg",
        type: [1],
      },
      {
        path: "淫羊藿/010_淫羊藿.jpg",
        type: [1],
      },
      {
        path: "淫羊藿/030_箭叶淫羊藿.jpg",
        type: [1],
      },
      {
        path: "淫羊藿/050_柔毛淫羊藿.jpg",
        type: [1],
      },
      {
        path: "淫羊藿/070_朝鲜淫羊藿.jpg",
        type: [1],
      },
      {
        path: "淫羊藿/090_淫羊藿.jpg",
        type: [1],
      },
      {
        path: "淫羊藿/110_淫羊藿.jpg",
        type: [1],
      },
      {
        path: "淫羊藿/130_淫羊藿叶尖上下表面观.jpg",
        type: [1],
      },
      {
        path: "淫羊藿/150_箭叶淫羊藿.jpg",
        type: [1],
      },
      {
        path: "淫羊藿/170_箭叶淫羊藿叶尖上下表面观.jpg",
        type: [1],
      },
      {
        path: "淫羊藿/190_柔毛淫羊藿.jpg",
        type: [1],
      },
      {
        path: "淫羊藿/210_柔毛淫羊藿.jpg",
        type: [1],
      },
      {
        path: "淫羊藿/230_柔毛淫羊藿.jpg",
        type: [1],
      },
      {
        path: "淫羊藿/250_柔毛淫羊藿.jpg",
        type: [1],
      },
      {
        path: "淫羊藿/270_朝鲜淫羊藿.jpg",
        type: [1],
      },
      {
        path: "淫羊藿/290_朝鲜淫羊藿叶尖上下表面观.jpg",
        type: [1],
      },
      {
        path: "淫羊藿/310_朝鲜淫羊藿.jpg",
        type: [1],
      },
      {
        path: "淫羊藿/330_四种淫羊藿墨线图.jpg",
        type: [1],
      },
      {
        path: "淫羊藿/350_各种淫羊藿植物形态.jpg",
        type: [1],
      },
      {
        path: "淫羊藿/370_各种淫羊藿植物形态.jpg",
        type: [1],
      },
      {
        path: "淫羊藿/390_五种淫羊藿图片.jpg",
        type: [1],
      },
      {
        path: "淫羊藿/410_淫羊藿叶图片.jpg",
        type: [1],
      },
      {
        path: "淫羊藿/430_淫羊藿叶图片.jpg",
        type: [1],
      },
      {
        path: "淫羊藿/450_淫羊藿性状鉴别.jpg",
        type: [1],
      },
      {
        path: "淫羊藿/470_淫羊藿.jpg",
        type: [1],
      },
      {
        path: "淫羊藿/490_淫羊藿.jpg",
        type: [1],
      },
      {
        path: "淫羊藿/510_淫羊藿.jpg",
        type: [1],
      },
      {
        path: "淫羊藿/530_淫羊藿.jpg",
        type: [1],
      },
      {
        path: "淫羊藿/550_箭叶淫羊藿.jpg",
        type: [1],
      },
      {
        path: "淫羊藿/570_箭叶淫羊藿.jpg",
        type: [1],
      },
      {
        path: "淫羊藿/590_箭叶淫羊藿.jpg",
        type: [1],
      },
      {
        path: "淫羊藿/610_箭叶淫羊藿.jpg",
        type: [1],
      },
      {
        path: "淫羊藿/630_柔毛淫羊藿.jpg",
        type: [1],
      },
      {
        path: "淫羊藿/650_柔毛淫羊藿.jpg",
        type: [1],
      },
      {
        path: "淫羊藿/670_朝鲜淫羊藿.jpg",
        type: [1],
      },
      {
        path: "淫羊藿/690_朝鲜淫羊藿.jpg",
        type: [1],
      },
      {
        path: "淫羊藿/710_朝鲜淫羊藿.jpg",
        type: [1],
      },
      {
        path: "淫羊藿/730_朝鲜淫羊藿.jpg",
        type: [1],
      },
      {
        path: "淫羊藿/750_巫山淫羊藿.jpg",
        type: [1],
      },
      {
        path: "淫羊藿/770_巫山淫羊藿药材.jpg",
        type: [1],
      },
      {
        path: "淫羊藿/790_巫山淫羊藿叶.jpg",
        type: [1],
      },
      {
        path: "淫羊藿/810_宽序淫羊藿.jpg",
        type: [1],
      },
      {
        path: "淫羊藿/830_尖叶淫羊藿.jpg",
        type: [1],
      },
      {
        path: "淫羊藿/850_宝兴淫羊藿.jpg",
        type: [1],
      },
      {
        path: "淫羊藿/870_宝兴淫羊藿叶尖上下表面观.jpg",
        type: [1],
      },
      {
        path: "淫羊藿/890_湖南淫羊藿.jpg",
        type: [1],
      },
      {
        path: "淫羊藿/910_湖南淫羊藿叶尖上下表面观.jpg",
        type: [1],
      },
      {
        path: "淫羊藿/930_淫羊藿饮片.jpg",
        type: [1],
      },
      {
        path: "淫羊藿/950_炙淫羊藿.jpg",
        type: [1],
      },
      {
        path: "淫羊藿/970_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "淮木",
    files: [
      {
        path: "淮木/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "湖北贝母",
    files: [
      {
        path: "湖北贝母/010_湖北贝母植物.jpg",
        type: [1],
      },
      {
        path: "湖北贝母/030_湖北贝母药材.jpg",
        type: [1],
      },
      {
        path: "湖北贝母/050_湖北贝母药材.jpg",
        type: [1],
      },
      {
        path: "湖北贝母/070_湖北贝母.jpg",
        type: [1],
      },
      {
        path: "湖北贝母/090_湖北贝母.jpg",
        type: [1],
      },
      {
        path: "湖北贝母/110_左浙贝母，右湖北贝母.jpg",
        type: [1],
      },
      {
        path: "湖北贝母/130_左浙贝母，右湖北贝母.jpg",
        type: [1],
      },
      {
        path: "湖北贝母/150_上浙贝母（有硫）、下湖北贝母（无硫），鳞茎基部褶皱或纵沟有明显区别.jpg",
        type: [1],
      },
      {
        path: "湖北贝母/170_上浙贝母（无硫）、下湖北贝母（有硫），浙贝母大贝鳞叶肥厚，湖北贝母外层单瓣鳞叶较薄，边缘尤甚。.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "溪黄草",
    files: [
      {
        path: "溪黄草/010_线纹香茶菜植物.jpg",
        type: [1],
      },
      {
        path: "溪黄草/030_溪黄草药材.jpg",
        type: [1],
      },
      {
        path: "溪黄草/050_溪黄草饮片.jpg",
        type: [1],
      },
      {
        path: "溪黄草/070_溪黄草饮片.jpg",
        type: [1],
      },
      {
        path: "溪黄草/090_溪黄草饮片.jpg",
        type: [1],
      },
      {
        path: "溪黄草/110_溪黄草（线纹香茶菜）.jpg",
        type: [1],
      },
      {
        path: "溪黄草/130_线纹香茶菜原植物.jpg",
        type: [1],
      },
      {
        path: "溪黄草/150_纤花香茶菜原植物.jpg",
        type: [1],
      },
      {
        path: "溪黄草/170_溪黄草原植物.jpg",
        type: [1],
      },
      {
        path: "溪黄草/190_溪黄草图片.jpg",
        type: [1],
      },
      {
        path: "溪黄草/210_溪黄草饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "溲疏",
    files: [
      {
        path: "溲疏/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "滇鸡血藤",
    files: [
      {
        path: "滇鸡血藤/010_内南五味子植物.jpg",
        type: [1],
      },
      {
        path: "滇鸡血藤/030_滇鸡血藤药材.jpg",
        type: [1],
      },
      {
        path: "滇鸡血藤/050_滇鸡血藤药材.jpg",
        type: [1],
      },
      {
        path: "滇鸡血藤/070_滇鸡血藤.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "滑石",
    files: [
      {
        path: "滑石/000_利水渗湿药_滑石.jpg",
        type: [1],
      },
      {
        path: "滑石/010_滑石.jpg",
        type: [1],
      },
      {
        path: "滑石/030_滑石药材.jpg",
        type: [1],
      },
      {
        path: "滑石/050_滑石药材.jpg",
        type: [1],
      },
      {
        path: "滑石/070_滑石药材.jpg",
        type: [1],
      },
      {
        path: "滑石/090_滑石.jpg",
        type: [1],
      },
      {
        path: "滑石/110_滑石性状鉴别.jpg",
        type: [1],
      },
      {
        path: "滑石/130_滑石粉.jpg",
        type: [1],
      },
      {
        path: "滑石/150_滑石粉.jpg",
        type: [1],
      },
      {
        path: "滑石/170_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "满山红",
    files: [
      {
        path: "满山红/010_兴安杜鹃.jpg",
        type: [1],
      },
      {
        path: "满山红/030_满山红药材.jpg",
        type: [1],
      },
      {
        path: "满山红/050_满山红药材.jpg",
        type: [1],
      },
      {
        path: "满山红/070_满山红.jpg",
        type: [1],
      },
      {
        path: "满山红/090_满山红.jpg",
        type: [1],
      },
      {
        path: "满山红/110_满山红.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "漏芦禹州漏芦",
    files: [
      {
        path: "漏芦禹州漏芦/010_祁州漏芦.jpg",
        type: [1],
      },
      {
        path: "漏芦禹州漏芦/030_漏芦.jpg",
        type: [1],
      },
      {
        path: "漏芦禹州漏芦/050_漏芦饮片.jpg",
        type: [1],
      },
      {
        path: "漏芦禹州漏芦/070_漏芦饮片.jpg",
        type: [1],
      },
      {
        path: "漏芦禹州漏芦/090_漏芦.jpg",
        type: [1],
      },
      {
        path: "漏芦禹州漏芦/110_漏芦.jpg",
        type: [1],
      },
      {
        path: "漏芦禹州漏芦/130_漏芦.jpg",
        type: [1],
      },
      {
        path: "漏芦禹州漏芦/150_漏芦性状鉴别.jpg",
        type: [1],
      },
      {
        path: "漏芦禹州漏芦/170_漏芦与白头翁比较图.jpg",
        type: [1],
      },
      {
        path: "漏芦禹州漏芦/190_左：白头翁  右：漏芦.jpg",
        type: [1],
      },
      {
        path: "漏芦禹州漏芦/210_漏芦与白头翁对比表.jpg",
        type: [1],
      },
      {
        path: "漏芦禹州漏芦/230_升麻.jpg",
        type: [1],
      },
      {
        path: "漏芦禹州漏芦/250_漏芦饮片.jpg",
        type: [1],
      },
      {
        path: "漏芦禹州漏芦/270_蓝刺头.jpg",
        type: [1],
      },
      {
        path: "漏芦禹州漏芦/290_华东蓝刺头.jpg",
        type: [1],
      },
      {
        path: "漏芦禹州漏芦/310_华东蓝刺头（上）与蓝刺头（下）叶片对比.jpg",
        type: [1],
      },
      {
        path: "漏芦禹州漏芦/330_禹州漏芦药材.jpg",
        type: [1],
      },
      {
        path: "漏芦禹州漏芦/350_禹州漏芦药材.jpg",
        type: [1],
      },
      {
        path: "漏芦禹州漏芦/370_禹州漏芦性状鉴别.jpg",
        type: [1],
      },
      {
        path: "漏芦禹州漏芦/390_漏芦饮片.jpg",
        type: [1],
      },
      {
        path: "漏芦禹州漏芦/410_禹州漏芦.jpg",
        type: [1],
      },
      {
        path: "漏芦禹州漏芦/430_禹州漏芦与漏芦性状比较.jpg",
        type: [1],
      },
      {
        path: "漏芦禹州漏芦/450_禹州漏芦饮片.jpg",
        type: [1],
      },
      {
        path: "漏芦禹州漏芦/470_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "火麻仁",
    files: [
      {
        path: "火麻仁/000_泻下药_火麻仁.jpg",
        type: [1],
      },
      {
        path: "火麻仁/010_大麻植物.jpg",
        type: [1],
      },
      {
        path: "火麻仁/030_火麻仁药材.jpg",
        type: [1],
      },
      {
        path: "火麻仁/050_火麻仁.jpg",
        type: [1],
      },
      {
        path: "火麻仁/070_火麻仁性状鉴别.jpg",
        type: [1],
      },
      {
        path: "火麻仁/090_火麻仁饮片.jpg",
        type: [1],
      },
      {
        path: "火麻仁/110_炒火麻仁.jpg",
        type: [1],
      },
      {
        path: "火麻仁/130_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "灯心草",
    files: [
      {
        path: "灯心草/010_灯心草植物.jpg",
        type: [1],
      },
      {
        path: "灯心草/030_灯心草药材.jpg",
        type: [1],
      },
      {
        path: "灯心草/050_灯心草药材.jpg",
        type: [1],
      },
      {
        path: "灯心草/070_灯心草.jpg",
        type: [1],
      },
      {
        path: "灯心草/090_灯心草性状鉴别.jpg",
        type: [1],
      },
      {
        path: "灯心草/110_左：通草  中：小通草  右：灯心草大小比较.jpg",
        type: [1],
      },
      {
        path: "灯心草/130_灯心草段.jpg",
        type: [1],
      },
      {
        path: "灯心草/150_灯心炭.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "灵芝",
    files: [
      {
        path: "灵芝/010_真菌赤芝.jpg",
        type: [1],
      },
      {
        path: "灵芝/030_真菌紫芝.jpg",
        type: [1],
      },
      {
        path: "灵芝/050_赤芝.jpg",
        type: [1],
      },
      {
        path: "灵芝/070_紫芝.jpg",
        type: [1],
      },
      {
        path: "灵芝/090_栽培品.jpg",
        type: [1],
      },
      {
        path: "灵芝/110_灵芝切片.jpg",
        type: [1],
      },
      {
        path: "灵芝/130_灵芝性状鉴别.jpg",
        type: [1],
      },
      {
        path: "灵芝/150_树舌.jpg",
        type: [2],
      },
      {
        path: "灵芝/170_层叠树舌.jpg",
        type: [2],
      },
      {
        path: "灵芝/190_红缘层孔.jpg",
        type: [2],
      },
      {
        path: "灵芝/210_肉色栓菌.jpg",
        type: [2],
      },
      {
        path: "灵芝/230_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "炉甘石",
    files: [
      {
        path: "炉甘石/010_菱锌矿石.jpg",
        type: [1],
      },
      {
        path: "炉甘石/030_炉甘石药材.jpg",
        type: [1],
      },
      {
        path: "炉甘石/050_炉甘石性状鉴别.jpg",
        type: [1],
      },
      {
        path: "炉甘石/070_煅炉甘石.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "熊胆",
    files: [
      {
        path: "熊胆/010_黑熊.jpg",
        type: [1],
      },
      {
        path: "熊胆/030_棕熊.jpg",
        type: [1],
      },
      {
        path: "熊胆/050_熊胆.jpg",
        type: [1],
      },
      {
        path: "熊胆/070_熊胆.jpg",
        type: [1],
      },
      {
        path: "熊胆/090_熊胆.jpg",
        type: [1],
      },
      {
        path: "熊胆/110_熊胆.jpg",
        type: [1],
      },
      {
        path: "熊胆/130_熊胆药材.jpg",
        type: [1],
      },
      {
        path: "熊胆/150_熊胆伪品：假熊胆.jpg",
        type: [1],
      },
      {
        path: "熊胆/170_胆仁.jpg",
        type: [1],
      },
      {
        path: "熊胆/190_熊胆粉.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "熊脂",
    files: [
      {
        path: "熊脂/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "燕屎",
    files: [
      {
        path: "燕屎/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "燕窝",
    files: [
      {
        path: "燕窝/010_金丝燕.jpg",
        type: [1],
      },
      {
        path: "燕窝/030_燕窝.jpg",
        type: [1],
      },
      {
        path: "燕窝/050_燕窝药材.jpg",
        type: [1],
      },
      {
        path: "燕窝/070_燕窝药材.jpg",
        type: [1],
      },
      {
        path: "燕窝/090_血燕.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "爵床",
    files: [
      {
        path: "爵床/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "片姜黄",
    files: [
      {
        path: "片姜黄/010_温郁金植物.jpg",
        type: [1],
      },
      {
        path: "片姜黄/030_片姜黄、郁金、莪术、姜黄的来源.jpg",
        type: [1],
      },
      {
        path: "片姜黄/050_片姜黄.jpg",
        type: [1],
      },
      {
        path: "片姜黄/070_片姜黄.jpg",
        type: [1],
      },
      {
        path: "片姜黄/090_片姜黄.jpg",
        type: [1],
      },
      {
        path: "片姜黄/110_片姜黄.jpg",
        type: [1],
      },
      {
        path: "片姜黄/130_姜黄饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "牙子",
    files: [
      {
        path: "牙子/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "牛扁",
    files: [
      {
        path: "牛扁/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "牛膝",
    files: [
      {
        path: "牛膝/000_活血药_川牛膝饮片.jpg",
        type: [1],
      },
      {
        path: "牛膝/000_活血药_怀牛膝.jpg",
        type: [1],
      },
      {
        path: "牛膝/000_活血药_牛膝.jpg",
        type: [1],
      },
      {
        path: "牛膝/010_牛膝植物.jpg",
        type: [1],
      },
      {
        path: "牛膝/030_牛膝药材.jpg",
        type: [1],
      },
      {
        path: "牛膝/050_牛膝药材.jpg",
        type: [1],
      },
      {
        path: "牛膝/070_牛膝饮片.jpg",
        type: [1],
      },
      {
        path: "牛膝/090_牛膝.jpg",
        type: [1],
      },
      {
        path: "牛膝/110_牛膝性状鉴别.jpg",
        type: [1],
      },
      {
        path: "牛膝/130_牛膝与川牛膝个子货比较.jpg",
        type: [1],
      },
      {
        path: "牛膝/150_牛膝药材及切片.jpg",
        type: [1],
      },
      {
        path: "牛膝/170_川牛膝药材及切片.jpg",
        type: [1],
      },
      {
        path: "牛膝/190_牛膝与川牛膝饮片比较.jpg",
        type: [1],
      },
      {
        path: "牛膝/210_红牛膝.jpg",
        type: [1],
      },
      {
        path: "牛膝/230_土牛膝.jpg",
        type: [1],
      },
      {
        path: "牛膝/250_土牛膝饮片.jpg",
        type: [1],
      },
      {
        path: "牛膝/270_味牛膝.jpg",
        type: [1],
      },
      {
        path: "牛膝/290_白牛膝.jpg",
        type: [1],
      },
      {
        path: "牛膝/310_牛膝饮片.jpg",
        type: [1],
      },
      {
        path: "牛膝/330_酒牛膝.jpg",
        type: [1],
      },
      {
        path: "牛膝/350_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "牛蒡子",
    files: [
      {
        path: "牛蒡子/010_牛蒡植物.jpg",
        type: [1],
      },
      {
        path: "牛蒡子/030_牛蒡子药材.jpg",
        type: [1],
      },
      {
        path: "牛蒡子/050_牛蒡子药材.jpg",
        type: [1],
      },
      {
        path: "牛蒡子/070_牛蒡子性状鉴别.jpg",
        type: [1],
      },
      {
        path: "牛蒡子/090_伪品大鳍蓟.jpg",
        type: [1],
      },
      {
        path: "牛蒡子/110_炒牛蒡子.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "牛角鳃",
    files: [
      {
        path: "牛角鳃/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "牛黄",
    files: [
      {
        path: "牛黄/000_熄风止痉药_牛黄.jpg",
        type: [1],
      },
      {
        path: "牛黄/010_牛.jpg",
        type: [1],
      },
      {
        path: "牛黄/030_牛黄药材.jpg",
        type: [1],
      },
      {
        path: "牛黄/050_牛黄性状鉴别.jpg",
        type: [1],
      },
      {
        path: "牛黄/070_牛黄鉴别要点.jpg",
        type: [1],
      },
      {
        path: "牛黄/090_牛黄鉴别要点.jpg",
        type: [1],
      },
      {
        path: "牛黄/110_天然牛黄常见伪品.jpg",
        type: [2],
      },
      {
        path: "牛黄/130_天然牛黄常见伪品.jpg",
        type: [2],
      },
      {
        path: "牛黄/150_天然牛黄常见伪品.jpg",
        type: [2],
      },
      {
        path: "牛黄/170_天然牛黄常见伪品.jpg",
        type: [2],
      },
      {
        path: "牛黄/190_天然牛黄常见伪品.jpg",
        type: [2],
      },
      {
        path: "牛黄/210_猪黄.jpg",
        type: [2],
      },
      {
        path: "牛黄/230_水牛黄.jpg",
        type: [1],
      },
      {
        path: "牛黄/250_牛羊草结或毛结.jpg",
        type: [2],
      },
      {
        path: "牛黄/270_人工牛黄.jpg",
        type: [1],
      },
      {
        path: "牛黄/290_人工牛黄.jpg",
        type: [1],
      },
      {
        path: "牛黄/310_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "牡丹皮",
    files: [
      {
        path: "牡丹皮/000_清热药_牡丹皮.jpg",
        type: [1],
      },
      {
        path: "牡丹皮/000_清热药_牡丹皮2.jpg",
        type: [1],
      },
      {
        path: "牡丹皮/010_牡丹植物.jpg",
        type: [1],
      },
      {
        path: "牡丹皮/030_连丹皮.jpg",
        type: [1],
      },
      {
        path: "牡丹皮/050_刮丹皮.jpg",
        type: [1],
      },
      {
        path: "牡丹皮/070_牡丹皮性状鉴别.jpg",
        type: [1],
      },
      {
        path: "牡丹皮/090_牡丹皮.jpg",
        type: [1],
      },
      {
        path: "牡丹皮/110_牡丹皮饮片（原丹).jpg",
        type: [1],
      },
      {
        path: "牡丹皮/130_牡丹皮饮片（刮丹).jpg",
        type: [1],
      },
      {
        path: "牡丹皮/150_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "牡狗阴茎",
    files: [
      {
        path: "牡狗阴茎/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "牡荆叶",
    files: [
      {
        path: "牡荆叶/010_牡荆植物.jpg",
        type: [1],
      },
      {
        path: "牡荆叶/030_牡荆叶药材.jpg",
        type: [1],
      },
      {
        path: "牡荆叶/050_牡荆叶药材.jpg",
        type: [1],
      },
      {
        path: "牡荆叶/070_牡荆叶性状鉴别.jpg",
        type: [1],
      },
      {
        path: "牡荆叶/090_黄荆叶，全缘.jpg",
        type: [1],
      },
      {
        path: "牡荆叶/110_牡荆叶，有锯齿.jpg",
        type: [1],
      },
      {
        path: "牡荆叶/130_荆条.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "牡蛎",
    files: [
      {
        path: "牡蛎/000_平肝潜阳_牡蛎.jpg",
        type: [1],
      },
      {
        path: "牡蛎/010_长牡蛎.jpg",
        type: [1],
      },
      {
        path: "牡蛎/030_大连湾牡蛎.jpg",
        type: [1],
      },
      {
        path: "牡蛎/050_近江牡蛎.jpg",
        type: [1],
      },
      {
        path: "牡蛎/070_牡蛎药材.jpg",
        type: [1],
      },
      {
        path: "牡蛎/090_牡蛎性状鉴别.jpg",
        type: [1],
      },
      {
        path: "牡蛎/110_三种牡蛎区别.jpg",
        type: [1],
      },
      {
        path: "牡蛎/130_牡蛎.jpg",
        type: [1],
      },
      {
        path: "牡蛎/150_煅牡蛎.jpg",
        type: [1],
      },
      {
        path: "牡蛎/170_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "牵牛子",
    files: [
      {
        path: "牵牛子/010_裂叶牵牛植物.jpg",
        type: [1],
      },
      {
        path: "牵牛子/030_圆叶牵牛植物.jpg",
        type: [1],
      },
      {
        path: "牵牛子/050_白丑.jpg",
        type: [1],
      },
      {
        path: "牵牛子/070_黑丑.jpg",
        type: [1],
      },
      {
        path: "牵牛子/090_牵牛子性状鉴别.jpg",
        type: [1],
      },
      {
        path: "牵牛子/110_炒牵牛子.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "犀角",
    files: [
      {
        path: "犀角/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "狗脊",
    files: [
      {
        path: "狗脊/000_祛风湿药_狗脊.jpg",
        type: [1],
      },
      {
        path: "狗脊/000_祛风湿药_狗脊2.jpg",
        type: [1],
      },
      {
        path: "狗脊/010_金毛狗脊植物.jpg",
        type: [1],
      },
      {
        path: "狗脊/030_狗脊药材.jpg",
        type: [1],
      },
      {
        path: "狗脊/050_狗脊药材.jpg",
        type: [1],
      },
      {
        path: "狗脊/070_狗脊饮片.jpg",
        type: [1],
      },
      {
        path: "狗脊/090_生狗脊饮片.jpg",
        type: [1],
      },
      {
        path: "狗脊/110_熟狗脊饮片.jpg",
        type: [1],
      },
      {
        path: "狗脊/130_烫狗脊.jpg",
        type: [1],
      },
      {
        path: "狗脊/150_狗脊特征鉴别.jpg",
        type: [1],
      },
      {
        path: "狗脊/170_狗脊.jpg",
        type: [1],
      },
      {
        path: "狗脊/190_狗脊性状鉴别.jpg",
        type: [1],
      },
      {
        path: "狗脊/210_狗脊蕨.jpg",
        type: [1],
      },
      {
        path: "狗脊/230_蜈蚣草.jpg",
        type: [1],
      },
      {
        path: "狗脊/250_狗脊饮片.jpg",
        type: [1],
      },
      {
        path: "狗脊/270_烫狗脊.jpg",
        type: [1],
      },
      {
        path: "狗脊/290_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "独活",
    files: [
      {
        path: "独活/000_祛风湿药_独活.jpg",
        type: [1],
      },
      {
        path: "独活/010_重齿毛当归.jpg",
        type: [1],
      },
      {
        path: "独活/030_独活药材.jpg",
        type: [1],
      },
      {
        path: "独活/050_独活药材.jpg",
        type: [1],
      },
      {
        path: "独活/070_独活饮片.jpg",
        type: [1],
      },
      {
        path: "独活/090_独活饮片.jpg",
        type: [1],
      },
      {
        path: "独活/110_独活鉴别特征.jpg",
        type: [1],
      },
      {
        path: "独活/130_独活.jpg",
        type: [1],
      },
      {
        path: "独活/150_独活性状鉴别.jpg",
        type: [1],
      },
      {
        path: "独活/170_香独活.jpg",
        type: [2],
      },
      {
        path: "独活/190_牛尾独活.jpg",
        type: [2],
      },
      {
        path: "独活/210_牛尾独活饮片.jpg",
        type: [2],
      },
      {
        path: "独活/230_山独活.jpg",
        type: [2],
      },
      {
        path: "独活/250_山独活饮片.jpg",
        type: [2],
      },
      {
        path: "独活/270_九眼独活.jpg",
        type: [2],
      },
      {
        path: "独活/290_九眼独活饮片.jpg",
        type: [2],
      },
      {
        path: "独活/310_新疆羌活.jpg",
        type: [2],
      },
      {
        path: "独活/330_独活、羌活、当归比较表.jpg",
        type: [1],
      },
      {
        path: "独活/350_独活饮片.jpg",
        type: [1],
      },
      {
        path: "独活/370_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "独脚金",
    files: [
      {
        path: "独脚金/010_独脚金植物.jpg",
        type: [1],
      },
      {
        path: "独脚金/030_独脚金.jpg",
        type: [1],
      },
      {
        path: "独脚金/050_独脚金药材.jpg",
        type: [1],
      },
      {
        path: "独脚金/070_独脚金药材.jpg",
        type: [1],
      },
      {
        path: "独脚金/090_独脚金药材.jpg",
        type: [1],
      },
      {
        path: "独脚金/110_独脚金药材.jpg",
        type: [1],
      },
      {
        path: "独脚金/130_独脚金药材.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "狼毒",
    files: [
      {
        path: "狼毒/010_月腺大戟.jpg",
        type: [1],
      },
      {
        path: "狼毒/030_狼毒大戟.jpg",
        type: [1],
      },
      {
        path: "狼毒/050_月腺大戟.jpg",
        type: [1],
      },
      {
        path: "狼毒/070_狼毒大戟.jpg",
        type: [1],
      },
      {
        path: "狼毒/090_狼毒药材.jpg",
        type: [1],
      },
      {
        path: "狼毒/110_月腺大戟.jpg",
        type: [1],
      },
      {
        path: "狼毒/130_狼毒大戟.jpg",
        type: [1],
      },
      {
        path: "狼毒/150_月腺大戟切面.jpg",
        type: [1],
      },
      {
        path: "狼毒/170_狼毒性状鉴别.jpg",
        type: [1],
      },
      {
        path: "狼毒/190_瑞香狼毒.jpg",
        type: [1],
      },
      {
        path: "狼毒/210_海芋.jpg",
        type: [1],
      },
      {
        path: "狼毒/230_生狼毒.jpg",
        type: [1],
      },
      {
        path: "狼毒/250_醋狼毒.jpg",
        type: [1],
      },
      {
        path: "狼毒/270_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "猪牙皂",
    files: [
      {
        path: "猪牙皂/010_皂荚植物.jpg",
        type: [1],
      },
      {
        path: "猪牙皂/030_猪牙皂药材.jpg",
        type: [1],
      },
      {
        path: "猪牙皂/050_猪牙皂.jpg",
        type: [1],
      },
      {
        path: "猪牙皂/070_猪牙皂性状鉴别.jpg",
        type: [1],
      },
      {
        path: "猪牙皂/090_大皂角.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "猪肤",
    files: [
      {
        path: "猪肤/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "猪胆",
    files: [
      {
        path: "猪胆/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "猪苓",
    files: [
      {
        path: "猪苓/000_利水渗湿药_猪苓.jpg",
        type: [1],
      },
      {
        path: "猪苓/010_真菌猪苓.jpg",
        type: [1],
      },
      {
        path: "猪苓/030_猪苓药.jpg",
        type: [1],
      },
      {
        path: "猪苓/050_猪苓性状鉴别.jpg",
        type: [1],
      },
      {
        path: "猪苓/070_猪苓.jpg",
        type: [1],
      },
      {
        path: "猪苓/090_掺增重粉.jpg",
        type: [1],
      },
      {
        path: "猪苓/110_提取.jpg",
        type: [1],
      },
      {
        path: "猪苓/130_金荞麦.jpg",
        type: [1],
      },
      {
        path: "猪苓/150_香菇菌柄.jpg",
        type: [1],
      },
      {
        path: "猪苓/170_香菇菌柄与猪苓对比.jpg",
        type: [1],
      },
      {
        path: "猪苓/190_猪苓与提取残渣对比.jpg",
        type: [1],
      },
      {
        path: "猪苓/210_左香菇，右猪苓.jpg",
        type: [1],
      },
      {
        path: "猪苓/230_猪苓片泡水.jpg",
        type: [1],
      },
      {
        path: "猪苓/250_伪品猪苓饮片.jpg",
        type: [1],
      },
      {
        path: "猪苓/270_上为正品猪苓  下为伪品.jpg",
        type: [1],
      },
      {
        path: "猪苓/290_猪苓饮片.jpg",
        type: [1],
      },
      {
        path: "猪苓/310_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "猫爪草",
    files: [
      {
        path: "猫爪草/010_小毛茛植物.jpg",
        type: [1],
      },
      {
        path: "猫爪草/030_猫爪草药材.jpg",
        type: [1],
      },
      {
        path: "猫爪草/050_猫爪草药材.jpg",
        type: [1],
      },
      {
        path: "猫爪草/070_猫爪草.jpg",
        type: [1],
      },
      {
        path: "猫爪草/090_猫爪草.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "玄参",
    files: [
      {
        path: "玄参/000_清热药_玄参.jpg",
        type: [1],
      },
      {
        path: "玄参/000_清热药_玄参2.jpg",
        type: [1],
      },
      {
        path: "玄参/010_玄参植物.jpg",
        type: [1],
      },
      {
        path: "玄参/030_玄参药材.jpg",
        type: [1],
      },
      {
        path: "玄参/050_玄参药材.jpg",
        type: [1],
      },
      {
        path: "玄参/070_玄参饮片.jpg",
        type: [1],
      },
      {
        path: "玄参/090_玄参.jpg",
        type: [1],
      },
      {
        path: "玄参/110_玄参性状鉴别.jpg",
        type: [1],
      },
      {
        path: "玄参/130_玄参饮片.jpg",
        type: [1],
      },
      {
        path: "玄参/150_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "玄明粉",
    files: [
      {
        path: "玄明粉/010_芒硝.jpg",
        type: [1],
      },
      {
        path: "玄明粉/030_玄明粉药材.jpg",
        type: [1],
      },
      {
        path: "玄明粉/050_玄明粉性状鉴别.jpg",
        type: [1],
      },
      {
        path: "玄明粉/070_硼砂.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "玉泉",
    files: [
      {
        path: "玉泉/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "玉竹",
    files: [
      {
        path: "玉竹/000_补虚药_玉竹.jpg",
        type: [1],
      },
      {
        path: "玉竹/010_玉竹植物.jpg",
        type: [1],
      },
      {
        path: "玉竹/030_玉竹药材.jpg",
        type: [1],
      },
      {
        path: "玉竹/050_玉竹鉴别.jpg",
        type: [1],
      },
      {
        path: "玉竹/070_玉竹鉴别.jpg",
        type: [1],
      },
      {
        path: "玉竹/090_粗毛玉竹.jpg",
        type: [2],
      },
      {
        path: "玉竹/110_毛筒玉竹.jpg",
        type: [2],
      },
      {
        path: "玉竹/130_康定玉竹.jpg",
        type: [2],
      },
      {
        path: "玉竹/150_竹根七.jpg",
        type: [2],
      },
      {
        path: "玉竹/170_玉竹纵切片.jpg",
        type: [1],
      },
      {
        path: "玉竹/190_玉竹饮片.jpg",
        type: [1],
      },
      {
        path: "玉竹/210_制玉竹饮片.jpg",
        type: [1],
      },
      {
        path: "玉竹/230_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "玉米须",
    files: [
      {
        path: "玉米须/010_玉蜀黍植物.jpg",
        type: [1],
      },
      {
        path: "玉米须/030_玉米须药材.jpg",
        type: [1],
      },
      {
        path: "玉米须/050_玉米须药材.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "王不留行",
    files: [
      {
        path: "王不留行/010_麦蓝菜植物.jpg",
        type: [1],
      },
      {
        path: "王不留行/030_王不留行药材.jpg",
        type: [1],
      },
      {
        path: "王不留行/050_王不留行放大.jpg",
        type: [1],
      },
      {
        path: "王不留行/070_王不留行性状鉴别.jpg",
        type: [1],
      },
      {
        path: "王不留行/090_油菜种子.jpg",
        type: [2],
      },
      {
        path: "王不留行/110_左为小巢菜，右为四籽野豌豆.jpg",
        type: [2],
      },
      {
        path: "王不留行/130_王不留行.jpg",
        type: [1],
      },
      {
        path: "王不留行/150_广东王不留行.jpg",
        type: [1],
      },
      {
        path: "王不留行/170_炒王不留行.jpg",
        type: [1],
      },
      {
        path: "王不留行/190_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "王孙",
    files: [
      {
        path: "王孙/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "王瓜",
    files: [
      {
        path: "王瓜/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "玛卡",
    files: [
      {
        path: "玛卡/010_印加萝卜原植物.jpg",
        type: [1],
      },
      {
        path: "玛卡/030_印加萝卜原植物.jpg",
        type: [1],
      },
      {
        path: "玛卡/050_玛卡.jpg",
        type: [1],
      },
      {
        path: "玛卡/070_玛卡.jpg",
        type: [1],
      },
      {
        path: "玛卡/090_玛卡.jpg",
        type: [1],
      },
      {
        path: "玛卡/110_玛卡.jpg",
        type: [1],
      },
      {
        path: "玛卡/130_玛卡.jpg",
        type: [1],
      },
      {
        path: "玛卡/150_玛卡片.jpg",
        type: [1],
      },
      {
        path: "玛卡/170_进口玛卡.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "玫瑰花",
    files: [
      {
        path: "玫瑰花/010_玫瑰植物.jpg",
        type: [1],
      },
      {
        path: "玫瑰花/030_玫瑰花.jpg",
        type: [1],
      },
      {
        path: "玫瑰花/050_玫瑰花药材.jpg",
        type: [1],
      },
      {
        path: "玫瑰花/070_玫瑰花.jpg",
        type: [1],
      },
      {
        path: "玫瑰花/090_玫瑰花性状鉴别.jpg",
        type: [1],
      },
      {
        path: "玫瑰花/110_玫瑰花性状鉴别.jpg",
        type: [1],
      },
      {
        path: "玫瑰花/130_玫瑰花鉴别要点.jpg",
        type: [1],
      },
      {
        path: "玫瑰花/150_月季花鉴别要点.jpg",
        type: [1],
      },
      {
        path: "玫瑰花/170_玫瑰花、月季花对比.jpg",
        type: [1],
      },
      {
        path: "玫瑰花/190_玫瑰花与伪品（野玫瑰）对比.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "珍珠",
    files: [
      {
        path: "珍珠/010_马氏珍珠贝.jpg",
        type: [1],
      },
      {
        path: "珍珠/030_三角帆蚌.jpg",
        type: [1],
      },
      {
        path: "珍珠/050_褶纹冠蚌.jpg",
        type: [1],
      },
      {
        path: "珍珠/070_珍珠药材.jpg",
        type: [1],
      },
      {
        path: "珍珠/090_珍珠药材.jpg",
        type: [1],
      },
      {
        path: "珍珠/110_珍珠粉.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "珍珠母",
    files: [
      {
        path: "珍珠母/010_马氏珍珠贝.jpg",
        type: [1],
      },
      {
        path: "珍珠母/030_三角帆蚌.jpg",
        type: [1],
      },
      {
        path: "珍珠母/050_褶纹冠蚌.jpg",
        type: [1],
      },
      {
        path: "珍珠母/070_三角帆蚌壳面.jpg",
        type: [1],
      },
      {
        path: "珍珠母/090_三角帆蚌壳内面.jpg",
        type: [1],
      },
      {
        path: "珍珠母/110_褶纹冠蚌壳面.jpg",
        type: [1],
      },
      {
        path: "珍珠母/130_褶纹冠蚌壳内面.jpg",
        type: [1],
      },
      {
        path: "珍珠母/150_马氏珍珠贝.jpg",
        type: [1],
      },
      {
        path: "珍珠母/170_珍珠母性状鉴别.jpg",
        type: [1],
      },
      {
        path: "珍珠母/190_左伪右真.jpg",
        type: [1],
      },
      {
        path: "珍珠母/210_伪品珍珠母.jpg",
        type: [1],
      },
      {
        path: "珍珠母/230_伪品珍珠母.jpg",
        type: [1],
      },
      {
        path: "珍珠母/250_1、2号假，3号.jpg",
        type: [1],
      },
      {
        path: "珍珠母/270_伪品珍珠母.jpg",
        type: [1],
      },
      {
        path: "珍珠母/290_伪品珍珠母.jpg",
        type: [1],
      },
      {
        path: "珍珠母/310_伪品珍珠母.jpg",
        type: [1],
      },
      {
        path: "珍珠母/330_伪品珍珠母.jpg",
        type: [1],
      },
      {
        path: "珍珠母/350_珍珠母.jpg",
        type: [1],
      },
      {
        path: "珍珠母/370_煅珍珠母.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "珠子参",
    files: [
      {
        path: "珠子参/010_珠子参植物.jpg",
        type: [1],
      },
      {
        path: "珠子参/030_羽叶三七植物.jpg",
        type: [1],
      },
      {
        path: "珠子参/050_珠子参药材.jpg",
        type: [1],
      },
      {
        path: "珠子参/070_珠子参药材.jpg",
        type: [1],
      },
      {
        path: "珠子参/090_珠子参.jpg",
        type: [1],
      },
      {
        path: "珠子参/110_珠子参药材.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "理石",
    files: [
      {
        path: "理石/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "琥珀",
    files: [
      {
        path: "琥珀/010_松树树脂.jpg",
        type: [1],
      },
      {
        path: "琥珀/030_煤珀来源于煤块.jpg",
        type: [1],
      },
      {
        path: "琥珀/050_琥珀药材.jpg",
        type: [1],
      },
      {
        path: "琥珀/070_煤珀.jpg",
        type: [1],
      },
      {
        path: "琥珀/090_煤珀.jpg",
        type: [1],
      },
      {
        path: "琥珀/110_松香.jpg",
        type: [1],
      },
      {
        path: "琥珀/130_伪品橄榄树脂.jpg",
        type: [1],
      },
      {
        path: "琥珀/150_伪品橄榄树脂.jpg",
        type: [1],
      },
      {
        path: "琥珀/170_伪品橄榄树脂.jpg",
        type: [1],
      },
      {
        path: "琥珀/190_正品琥珀与伪品橄榄树脂.jpg",
        type: [1],
      },
      {
        path: "琥珀/210_真品琥珀硬，不易研碎；真品煤珀稍容易些；橄榄树脂极易研碎，轻研即成粉末.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "瓜子金",
    files: [
      {
        path: "瓜子金/010_瓜子金植物.jpg",
        type: [1],
      },
      {
        path: "瓜子金/030_瓜子金鲜品.jpg",
        type: [1],
      },
      {
        path: "瓜子金/050_瓜子金药材.jpg",
        type: [1],
      },
      {
        path: "瓜子金/070_瓜子金药材.jpg",
        type: [1],
      },
      {
        path: "瓜子金/090_瓜子金药材.jpg",
        type: [1],
      },
      {
        path: "瓜子金/110_瓜子金.jpg",
        type: [1],
      },
      {
        path: "瓜子金/130_瓜子金饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "瓜蒂",
    files: [
      {
        path: "瓜蒂/000_涌吐药_瓜蒂.jpg",
        type: [1],
      },
      {
        path: "瓜蒂/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "瓜蒌",
    files: [
      {
        path: "瓜蒌/000_化痰药_瓜蒌.jpg",
        type: [1],
      },
      {
        path: "瓜蒌/010_栝楼植物.jpg",
        type: [1],
      },
      {
        path: "瓜蒌/030_双边栝楼.jpg",
        type: [1],
      },
      {
        path: "瓜蒌/050_瓜蒌药材.jpg",
        type: [1],
      },
      {
        path: "瓜蒌/070_瓜蒌性状鉴别.jpg",
        type: [1],
      },
      {
        path: "瓜蒌/090_瓜蒌饮片.jpg",
        type: [1],
      },
      {
        path: "瓜蒌/110_瓜蒌皮（双边栝楼）.jpg",
        type: [1],
      },
      {
        path: "瓜蒌/130_瓜蒌皮.jpg",
        type: [1],
      },
      {
        path: "瓜蒌/150_瓜蒌皮性状鉴别.jpg",
        type: [1],
      },
      {
        path: "瓜蒌/170_瓜蒌皮饮片.jpg",
        type: [1],
      },
      {
        path: "瓜蒌/190_瓜蒌子.jpg",
        type: [1],
      },
      {
        path: "瓜蒌/210_双边栝楼.jpg",
        type: [1],
      },
      {
        path: "瓜蒌/230_双边栝楼.jpg",
        type: [1],
      },
      {
        path: "瓜蒌/250_瓜蒌子性状鉴别.jpg",
        type: [1],
      },
      {
        path: "瓜蒌/270_栝蒌与双边栝蒌的区别.jpg",
        type: [1],
      },
      {
        path: "瓜蒌/290_单边瓜蒌子.jpg",
        type: [1],
      },
      {
        path: "瓜蒌/310_长萼栝楼种子.jpg",
        type: [1],
      },
      {
        path: "瓜蒌/330_几种不同瓜蒌子的对比.jpg",
        type: [1],
      },
      {
        path: "瓜蒌/350_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "瓦松",
    files: [
      {
        path: "瓦松/010_瓦松植物.jpg",
        type: [1],
      },
      {
        path: "瓦松/030_瓦松药材.jpg",
        type: [1],
      },
      {
        path: "瓦松/050_瓦松药材.jpg",
        type: [1],
      },
      {
        path: "瓦松/070_瓦松药材.jpg",
        type: [1],
      },
      {
        path: "瓦松/090_瓦松药材.jpg",
        type: [1],
      },
      {
        path: "瓦松/110_瓦松.jpg",
        type: [1],
      },
      {
        path: "瓦松/130_瓦松.jpg",
        type: [1],
      },
      {
        path: "瓦松/150_日本瓦松.jpg",
        type: [1],
      },
      {
        path: "瓦松/170_日本瓦松.jpg",
        type: [1],
      },
      {
        path: "瓦松/190_瓦松饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "瓦楞子",
    files: [
      {
        path: "瓦楞子/010_毛蚶.jpg",
        type: [1],
      },
      {
        path: "瓦楞子/030_泥蚶.jpg",
        type: [1],
      },
      {
        path: "瓦楞子/050_魁蚶.jpg",
        type: [1],
      },
      {
        path: "瓦楞子/070_毛蚶.jpg",
        type: [1],
      },
      {
        path: "瓦楞子/090_泥蚶.jpg",
        type: [1],
      },
      {
        path: "瓦楞子/110_魁蚶.jpg",
        type: [1],
      },
      {
        path: "瓦楞子/130_瓦楞子药材.jpg",
        type: [1],
      },
      {
        path: "瓦楞子/150_瓦楞子性状鉴别.jpg",
        type: [1],
      },
      {
        path: "瓦楞子/170_胀毛蚶.jpg",
        type: [1],
      },
      {
        path: "瓦楞子/190_结蚶.jpg",
        type: [1],
      },
      {
        path: "瓦楞子/210_瓦楞子.jpg",
        type: [1],
      },
      {
        path: "瓦楞子/230_煅瓦楞子.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "甘松",
    files: [
      {
        path: "甘松/010_甘松植物.jpg",
        type: [1],
      },
      {
        path: "甘松/030_甘松药材.jpg",
        type: [1],
      },
      {
        path: "甘松/050_甘松药材.jpg",
        type: [1],
      },
      {
        path: "甘松/070_甘松.jpg",
        type: [1],
      },
      {
        path: "甘松/090_甘松.jpg",
        type: [1],
      },
      {
        path: "甘松/110_甘松性状鉴别.jpg",
        type: [1],
      },
      {
        path: "甘松/130_甘松饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "甘草",
    files: [
      {
        path: "甘草/000_补虚药_甘草.jpg",
        type: [1],
      },
      {
        path: "甘草/010_甘草植物.jpg",
        type: [1],
      },
      {
        path: "甘草/030_光果甘草植物.jpg",
        type: [1],
      },
      {
        path: "甘草/050_胀果甘草植物.jpg",
        type: [1],
      },
      {
        path: "甘草/070_甘草药材.jpg",
        type: [1],
      },
      {
        path: "甘草/090_胀果甘草药材.jpg",
        type: [1],
      },
      {
        path: "甘草/110_光果甘草药材.jpg",
        type: [1],
      },
      {
        path: "甘草/130_甘草性状鉴别.jpg",
        type: [1],
      },
      {
        path: "甘草/150_刺果甘草.jpg",
        type: [2],
      },
      {
        path: "甘草/170_苦甘草.jpg",
        type: [2],
      },
      {
        path: "甘草/190_甘草饮片.jpg",
        type: [1],
      },
      {
        path: "甘草/210_炙甘草饮片.jpg",
        type: [1],
      },
      {
        path: "甘草/230_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "甘遂",
    files: [
      {
        path: "甘遂/000_泻下药_甘遂.jpg",
        type: [1],
      },
      {
        path: "甘遂/010_甘遂植物.jpg",
        type: [1],
      },
      {
        path: "甘遂/030_甘遂药材.jpg",
        type: [1],
      },
      {
        path: "甘遂/050_甘遂.jpg",
        type: [1],
      },
      {
        path: "甘遂/070_甘遂.jpg",
        type: [1],
      },
      {
        path: "甘遂/090_甘遂性状鉴别.jpg",
        type: [1],
      },
      {
        path: "甘遂/110_醋甘遂.jpg",
        type: [1],
      },
      {
        path: "甘遂/130_甘遂真伪对比.jpg",
        type: [1],
      },
      {
        path: "甘遂/150_甘遂真伪断面对比.jpg",
        type: [1],
      },
      {
        path: "甘遂/170_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "甜地丁",
    files: [
      {
        path: "甜地丁/010_米口袋植物.jpg",
        type: [1],
      },
      {
        path: "甜地丁/030_甜地丁药材.jpg",
        type: [1],
      },
      {
        path: "甜地丁/050_甜地丁药材.jpg",
        type: [1],
      },
      {
        path: "甜地丁/070_甜地丁饮片.jpg",
        type: [1],
      },
      {
        path: "甜地丁/090_苦地丁.jpg",
        type: [1],
      },
      {
        path: "甜地丁/110_甜地丁.jpg",
        type: [1],
      },
      {
        path: "甜地丁/130_紫花地丁.jpg",
        type: [1],
      },
      {
        path: "甜地丁/150_甜地丁饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "甜瓜子",
    files: [
      {
        path: "甜瓜子/010_甜瓜植物.jpg",
        type: [1],
      },
      {
        path: "甜瓜子/030_甜瓜子.jpg",
        type: [1],
      },
      {
        path: "甜瓜子/050_甜瓜子.jpg",
        type: [1],
      },
      {
        path: "甜瓜子/070_甜瓜子.jpg",
        type: [1],
      },
      {
        path: "甜瓜子/090_甜瓜子.jpg",
        type: [1],
      },
      {
        path: "甜瓜子/110_甜瓜子.jpg",
        type: [1],
      },
      {
        path: "甜瓜子/130_黄瓜子.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "生姜",
    files: [
      {
        path: "生姜/000_止血药_炮姜.jpg",
        type: [1],
      },
      {
        path: "生姜/000_温里药_干姜.jpg",
        type: [1],
      },
      {
        path: "生姜/010_姜植物.jpg",
        type: [1],
      },
      {
        path: "生姜/030_生姜药材.jpg",
        type: [1],
      },
      {
        path: "生姜/050_生姜性状鉴别.jpg",
        type: [1],
      },
      {
        path: "生姜/070_生姜片.jpg",
        type: [1],
      },
      {
        path: "生姜/090_姜皮.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "田基黄",
    files: [
      {
        path: "田基黄/010_地耳草植物.jpg",
        type: [1],
      },
      {
        path: "田基黄/030_田基黄药材.jpg",
        type: [1],
      },
      {
        path: "田基黄/050_田基黄饮片.jpg",
        type: [1],
      },
      {
        path: "田基黄/070_田基黄饮片.jpg",
        type: [1],
      },
      {
        path: "田基黄/090_田基黄.jpg",
        type: [1],
      },
      {
        path: "田基黄/110_田基黄.jpg",
        type: [1],
      },
      {
        path: "田基黄/130_田基黄.jpg",
        type: [1],
      },
      {
        path: "田基黄/150_田基黄饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "番泻叶",
    files: [
      {
        path: "番泻叶/010_狭叶番泻.jpg",
        type: [1],
      },
      {
        path: "番泻叶/030_尖叶番泻.jpg",
        type: [1],
      },
      {
        path: "番泻叶/050_狭叶番泻.jpg",
        type: [1],
      },
      {
        path: "番泻叶/070_狭叶番泻.jpg",
        type: [1],
      },
      {
        path: "番泻叶/090_尖叶番泻.jpg",
        type: [1],
      },
      {
        path: "番泻叶/110_尖叶番泻.jpg",
        type: [1],
      },
      {
        path: "番泻叶/130_狭叶番泻、 尖叶番泻墨线图.jpg",
        type: [1],
      },
      {
        path: "番泻叶/150_番泻叶药材.jpg",
        type: [1],
      },
      {
        path: "番泻叶/170_狭叶番泻.jpg",
        type: [1],
      },
      {
        path: "番泻叶/190_番泻叶性状鉴别.jpg",
        type: [1],
      },
      {
        path: "番泻叶/210_耳叶番泻叶.jpg",
        type: [1],
      },
      {
        path: "番泻叶/230_耳叶番泻叶.jpg",
        type: [1],
      },
      {
        path: "番泻叶/250_番泻叶及伪品墨线图.jpg",
        type: [1],
      },
      {
        path: "番泻叶/270_左：番泻叶    右：耳叶番泻叶.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "白兔藿",
    files: [
      {
        path: "白兔藿/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "白前",
    files: [
      {
        path: "白前/000_化痰药_白前.jpg",
        type: [1],
      },
      {
        path: "白前/000_化痰药_白前2.jpg",
        type: [1],
      },
      {
        path: "白前/010_柳叶白前植物.jpg",
        type: [1],
      },
      {
        path: "白前/030_芫花叶白前植物.jpg",
        type: [1],
      },
      {
        path: "白前/050_柳叶白前药材.jpg",
        type: [1],
      },
      {
        path: "白前/070_芫花叶白前药材.jpg",
        type: [1],
      },
      {
        path: "白前/090_白前性状鉴别.jpg",
        type: [1],
      },
      {
        path: "白前/110_龙须菜.jpg",
        type: [1],
      },
      {
        path: "白前/130_瓦草.jpg",
        type: [1],
      },
      {
        path: "白前/150_白射干.jpg",
        type: [1],
      },
      {
        path: "白前/170_华北白前.jpg",
        type: [1],
      },
      {
        path: "白前/190_徐长卿性状鉴别.jpg",
        type: [1],
      },
      {
        path: "白前/210_徐长卿.jpg",
        type: [1],
      },
      {
        path: "白前/230_柳叶白前饮片.jpg",
        type: [1],
      },
      {
        path: "白前/250_芫花叶白前饮片.jpg",
        type: [1],
      },
      {
        path: "白前/270_蜜白前.jpg",
        type: [1],
      },
      {
        path: "白前/290_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "白及",
    files: [
      {
        path: "白及/000_止血药_白芨.jpg",
        type: [1],
      },
      {
        path: "白及/000_止血药_白芨2.jpg",
        type: [1],
      },
      {
        path: "白及/010_白及植物.jpg",
        type: [1],
      },
      {
        path: "白及/030_白及鲜品.jpg",
        type: [1],
      },
      {
        path: "白及/050_白及药材.jpg",
        type: [1],
      },
      {
        path: "白及/070_白及性状鉴别.jpg",
        type: [1],
      },
      {
        path: "白及/090_小白及.jpg",
        type: [1],
      },
      {
        path: "白及/110_白及伪品.jpg",
        type: [1],
      },
      {
        path: "白及/130_白及伪品.jpg",
        type: [1],
      },
      {
        path: "白及/150_白及伪品.jpg",
        type: [1],
      },
      {
        path: "白及/170_白及伪品.jpg",
        type: [1],
      },
      {
        path: "白及/190_白及伪品.jpg",
        type: [1],
      },
      {
        path: "白及/210_白及伪品.jpg",
        type: [1],
      },
      {
        path: "白及/230_白及伪品.jpg",
        type: [1],
      },
      {
        path: "白及/250_白芨正品.jpg",
        type: [1],
      },
      {
        path: "白及/270_白芨伪品.jpg",
        type: [1],
      },
      {
        path: "白及/290_白及饮片.jpg",
        type: [1],
      },
      {
        path: "白及/310_白及饮片.jpg",
        type: [1],
      },
      {
        path: "白及/330_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "白垩",
    files: [
      {
        path: "白垩/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "白头翁",
    files: [
      {
        path: "白头翁/000_清热药_白头翁.jpg",
        type: [1],
      },
      {
        path: "白头翁/000_清热药_白头翁2.jpg",
        type: [1],
      },
      {
        path: "白头翁/010_白头翁植物.jpg",
        type: [1],
      },
      {
        path: "白头翁/030_白头翁鲜药.jpg",
        type: [1],
      },
      {
        path: "白头翁/050_白头翁药材.jpg",
        type: [1],
      },
      {
        path: "白头翁/070_白头翁药材.jpg",
        type: [1],
      },
      {
        path: "白头翁/090_白头翁药材饮得.jpg",
        type: [1],
      },
      {
        path: "白头翁/110_白头翁.jpg",
        type: [1],
      },
      {
        path: "白头翁/130_白头翁性状.jpg",
        type: [1],
      },
      {
        path: "白头翁/150_白头翁性状鉴别.jpg",
        type: [1],
      },
      {
        path: "白头翁/170_白头翁药材性状.jpg",
        type: [1],
      },
      {
        path: "白头翁/190_白头翁饮片特征.jpg",
        type: [1],
      },
      {
        path: "白头翁/210_白头翁饮片.jpg",
        type: [1],
      },
      {
        path: "白头翁/230_白头翁伪品.jpg",
        type: [1],
      },
      {
        path: "白头翁/250_白头翁伪品.jpg",
        type: [1],
      },
      {
        path: "白头翁/270_白头翁.jpg",
        type: [1],
      },
      {
        path: "白头翁/290_大火草.jpg",
        type: [1],
      },
      {
        path: "白头翁/310_大火草.jpg",
        type: [1],
      },
      {
        path: "白头翁/330_大火草切片.jpg",
        type: [1],
      },
      {
        path: "白头翁/350_委陵菜.jpg",
        type: [1],
      },
      {
        path: "白头翁/370_委陵菜.jpg",
        type: [1],
      },
      {
        path: "白头翁/390_翻白草.jpg",
        type: [1],
      },
      {
        path: "白头翁/410_北白头翁.jpg",
        type: [1],
      },
      {
        path: "白头翁/430_漏芦.jpg",
        type: [1],
      },
      {
        path: "白头翁/450_漏芦.jpg",
        type: [1],
      },
      {
        path: "白头翁/470_甘肃白头翁.jpg",
        type: [1],
      },
      {
        path: "白头翁/490_四川白头翁.jpg",
        type: [1],
      },
      {
        path: "白头翁/510_白头翁.jpg",
        type: [1],
      },
      {
        path: "白头翁/530_声色草.jpg",
        type: [1],
      },
      {
        path: "白头翁/550_白头翁饮片.jpg",
        type: [1],
      },
      {
        path: "白头翁/570_白头翁饮片.jpg",
        type: [1],
      },
      {
        path: "白头翁/590_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "白屈菜",
    files: [
      {
        path: "白屈菜/010_白屈菜植物.jpg",
        type: [1],
      },
      {
        path: "白屈菜/030_白屈菜.jpg",
        type: [1],
      },
      {
        path: "白屈菜/050_白屈菜.jpg",
        type: [1],
      },
      {
        path: "白屈菜/070_白屈菜.jpg",
        type: [1],
      },
      {
        path: "白屈菜/090_白屈菜.jpg",
        type: [1],
      },
      {
        path: "白屈菜/110_白屈菜饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "白扁豆",
    files: [
      {
        path: "白扁豆/010_扁豆植物.jpg",
        type: [1],
      },
      {
        path: "白扁豆/030_白扁豆药材.jpg",
        type: [1],
      },
      {
        path: "白扁豆/050_白扁豆.jpg",
        type: [1],
      },
      {
        path: "白扁豆/070_白扁豆性状鉴别.jpg",
        type: [1],
      },
      {
        path: "白扁豆/090_缅甸白扁豆.jpg",
        type: [1],
      },
      {
        path: "白扁豆/110_左进口白扁豆  右四川白扁豆.jpg",
        type: [1],
      },
      {
        path: "白扁豆/130_炒白扁豆.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "白敛",
    files: [
      {
        path: "白敛/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "白术",
    files: [
      {
        path: "白术/000_补虚药_白术.jpg",
        type: [1],
      },
      {
        path: "白术/010_白术植物.jpg",
        type: [1],
      },
      {
        path: "白术/030_白术药材（亳白术）.jpg",
        type: [1],
      },
      {
        path: "白术/050_白术药材（浙白术）.jpg",
        type: [1],
      },
      {
        path: "白术/070_白术性状鉴别.jpg",
        type: [1],
      },
      {
        path: "白术/090_菊三七.jpg",
        type: [2],
      },
      {
        path: "白术/110_白芍根头片.jpg",
        type: [2],
      },
      {
        path: "白术/130_土木香片.jpg",
        type: [2],
      },
      {
        path: "白术/150_白术饮片.jpg",
        type: [1],
      },
      {
        path: "白术/170_麸炒白术饮片.jpg",
        type: [1],
      },
      {
        path: "白术/190_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "白果",
    files: [
      {
        path: "白果/010_银杏植物.jpg",
        type: [1],
      },
      {
        path: "白果/030_白果药材.jpg",
        type: [1],
      },
      {
        path: "白果/050_白果.jpg",
        type: [1],
      },
      {
        path: "白果/070_白果性状鉴别.jpg",
        type: [1],
      },
      {
        path: "白果/090_白果长霉变质.jpg",
        type: [1],
      },
      {
        path: "白果/110_白果仁.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "白棘",
    files: [
      {
        path: "白棘/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "白石英",
    files: [
      {
        path: "白石英/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "白矾",
    files: [
      {
        path: "白矾/000_功毒杀虫_白矾.jpg",
        type: [1],
      },
      {
        path: "白矾/010_明矾石.jpg",
        type: [1],
      },
      {
        path: "白矾/030_白矾药材.jpg",
        type: [1],
      },
      {
        path: "白矾/050_白矾药材.jpg",
        type: [1],
      },
      {
        path: "白矾/070_白矾性状鉴别.jpg",
        type: [1],
      },
      {
        path: "白矾/090_明矾与伪品铵明矾.jpg",
        type: [1],
      },
      {
        path: "白矾/110_枯矾.jpg",
        type: [1],
      },
      {
        path: "白矾/130_枯矾.jpg",
        type: [1],
      },
      {
        path: "白矾/150_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "白芍",
    files: [
      {
        path: "白芍/000_清热药_赤芍.jpg",
        type: [1],
      },
      {
        path: "白芍/000_清热药_赤芍2.jpg",
        type: [1],
      },
      {
        path: "白芍/000_补虚药_白芍.jpg",
        type: [1],
      },
      {
        path: "白芍/010_白芍植物.jpg",
        type: [1],
      },
      {
        path: "白芍/030_白芍植物.jpg",
        type: [1],
      },
      {
        path: "白芍/050_白芍药材.jpg",
        type: [1],
      },
      {
        path: "白芍/070_白芍性状鉴别.jpg",
        type: [1],
      },
      {
        path: "白芍/090_亳白芍.jpg",
        type: [1],
      },
      {
        path: "白芍/110_川白芍.jpg",
        type: [1],
      },
      {
        path: "白芍/130_杭白芍.jpg",
        type: [1],
      },
      {
        path: "白芍/150_毛果芍药.jpg",
        type: [1],
      },
      {
        path: "白芍/170_伪品云白芍.jpg",
        type: [1],
      },
      {
        path: "白芍/190_白芍饮片.jpg",
        type: [1],
      },
      {
        path: "白芍/210_炒白芍.jpg",
        type: [1],
      },
      {
        path: "白芍/230_酒白芍.jpg",
        type: [1],
      },
      {
        path: "白芍/250_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "白花蛇舌草",
    files: [
      {
        path: "白花蛇舌草/010_白花蛇舌草.jpg",
        type: [1],
      },
      {
        path: "白花蛇舌草/030_蒴果.jpg",
        type: [1],
      },
      {
        path: "白花蛇舌草/050_白花蛇舌草药材.jpg",
        type: [1],
      },
      {
        path: "白花蛇舌草/070_白花蛇舌草.jpg",
        type: [1],
      },
      {
        path: "白花蛇舌草/090_白花蛇舌草.jpg",
        type: [1],
      },
      {
        path: "白花蛇舌草/110_白花蛇舌草.jpg",
        type: [1],
      },
      {
        path: "白花蛇舌草/130_白花蛇舌草性状鉴别.jpg",
        type: [1],
      },
      {
        path: "白花蛇舌草/150_水线草植物.jpg",
        type: [1],
      },
      {
        path: "白花蛇舌草/170_纤花耳草.jpg",
        type: [1],
      },
      {
        path: "白花蛇舌草/190_白花蛇舌草及伪品比较.jpg",
        type: [1],
      },
      {
        path: "白花蛇舌草/210_白花蛇舌草.jpg",
        type: [1],
      },
      {
        path: "白花蛇舌草/230_伞房花蛇舌草.jpg",
        type: [1],
      },
      {
        path: "白花蛇舌草/250_白花蛇舌草饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "白芷",
    files: [
      {
        path: "白芷/010_白芷植物.jpg",
        type: [1],
      },
      {
        path: "白芷/030_杭白芷植物.jpg",
        type: [1],
      },
      {
        path: "白芷/050_白芷药材.jpg",
        type: [1],
      },
      {
        path: "白芷/070_杭白芷药材.jpg",
        type: [1],
      },
      {
        path: "白芷/090_白芷性状鉴别.jpg",
        type: [1],
      },
      {
        path: "白芷/110_祈白芷.jpg",
        type: [1],
      },
      {
        path: "白芷/130_禹白芷.jpg",
        type: [1],
      },
      {
        path: "白芷/150_杭白芷.jpg",
        type: [1],
      },
      {
        path: "白芷/170_川白芷.jpg",
        type: [1],
      },
      {
        path: "白芷/190_香白芷.jpg",
        type: [1],
      },
      {
        path: "白芷/210_岩白芷.jpg",
        type: [1],
      },
      {
        path: "白芷/230_白芷饮片.jpg",
        type: [1],
      },
      {
        path: "白芷/250_杭白芷饮片.jpg",
        type: [1],
      },
      {
        path: "白芷/270_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "白英",
    files: [
      {
        path: "白英/010_白英植物.jpg",
        type: [1],
      },
      {
        path: "白英/030_白英药材.jpg",
        type: [1],
      },
      {
        path: "白英/050_白英药材.jpg",
        type: [1],
      },
      {
        path: "白英/070_白英.jpg",
        type: [1],
      },
      {
        path: "白英/090_寻骨风.jpg",
        type: [1],
      },
      {
        path: "白英/110_白英饮片.jpg",
        type: [1],
      },
      {
        path: "白英/130_白英饮片.jpg",
        type: [1],
      },
      {
        path: "白英/150_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "白茅根",
    files: [
      {
        path: "白茅根/000_止血药_白茅根.jpg",
        type: [1],
      },
      {
        path: "白茅根/010_白茅植物.jpg",
        type: [1],
      },
      {
        path: "白茅根/030_鲜白茅根.jpg",
        type: [1],
      },
      {
        path: "白茅根/050_白茅根药材.jpg",
        type: [1],
      },
      {
        path: "白茅根/070_白茅根表面及断面观.jpg",
        type: [1],
      },
      {
        path: "白茅根/090_白茅根性状鉴别.jpg",
        type: [1],
      },
      {
        path: "白茅根/110_白草.jpg",
        type: [1],
      },
      {
        path: "白茅根/130_白茅根饮片.jpg",
        type: [1],
      },
      {
        path: "白茅根/150_茅根炭.jpg",
        type: [1],
      },
      {
        path: "白茅根/170_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "白蒿",
    files: [
      {
        path: "白蒿/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "白蔹",
    files: [
      {
        path: "白蔹/010_白蔹植物.jpg",
        type: [1],
      },
      {
        path: "白蔹/030_白蔹纵片.jpg",
        type: [1],
      },
      {
        path: "白蔹/050_白蔹纵片.jpg",
        type: [1],
      },
      {
        path: "白蔹/070_白蔹横片.jpg",
        type: [1],
      },
      {
        path: "白蔹/090_白蔹横片.jpg",
        type: [1],
      },
      {
        path: "白蔹/110_白蔹.jpg",
        type: [1],
      },
      {
        path: "白蔹/130_白蔹性状鉴别.jpg",
        type: [1],
      },
      {
        path: "白蔹/150_茅瓜.jpg",
        type: [1],
      },
      {
        path: "白蔹/170_茅瓜.jpg",
        type: [1],
      },
      {
        path: "白蔹/190_耳叶牛皮消.jpg",
        type: [1],
      },
      {
        path: "白蔹/210_耳叶牛皮消.jpg",
        type: [1],
      },
      {
        path: "白蔹/230_青羊参.jpg",
        type: [1],
      },
      {
        path: "白蔹/250_青羊参表面及切面观.jpg",
        type: [1],
      },
      {
        path: "白蔹/270_白蔹饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "白薇",
    files: [
      {
        path: "白薇/010_白薇植物.jpg",
        type: [1],
      },
      {
        path: "白薇/030_蔓生白薇.jpg",
        type: [1],
      },
      {
        path: "白薇/050_白薇药材.jpg",
        type: [1],
      },
      {
        path: "白薇/070_蔓生白薇药材.jpg",
        type: [1],
      },
      {
        path: "白薇/090_白薇药材.jpg",
        type: [1],
      },
      {
        path: "白薇/110_白薇性状鉴别.jpg",
        type: [1],
      },
      {
        path: "白薇/130_伪品竹灵消.jpg",
        type: [1],
      },
      {
        path: "白薇/150_徐长卿.jpg",
        type: [1],
      },
      {
        path: "白薇/170_毛大丁草.jpg",
        type: [1],
      },
      {
        path: "白薇/190_宝锋草.jpg",
        type: [1],
      },
      {
        path: "白薇/210_紫花合掌消.jpg",
        type: [1],
      },
      {
        path: "白薇/230_白薇饮片.jpg",
        type: [1],
      },
      {
        path: "白薇/250_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "白附子",
    files: [
      {
        path: "白附子/010_独角莲植物.jpg",
        type: [1],
      },
      {
        path: "白附子/030_白附子药材.jpg",
        type: [1],
      },
      {
        path: "白附子/050_白附子药材.jpg",
        type: [1],
      },
      {
        path: "白附子/070_白附子药材.jpg",
        type: [1],
      },
      {
        path: "白附子/090_白附子切片.jpg",
        type: [1],
      },
      {
        path: "白附子/110_白附子.jpg",
        type: [1],
      },
      {
        path: "白附子/130_白附子切片.jpg",
        type: [1],
      },
      {
        path: "白附子/150_白附子性状鉴别.jpg",
        type: [1],
      },
      {
        path: "白附子/170_关白附母根.jpg",
        type: [1],
      },
      {
        path: "白附子/190_关白附子根.jpg",
        type: [1],
      },
      {
        path: "白附子/210_生白附子.jpg",
        type: [1],
      },
      {
        path: "白附子/230_制白附子.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "白青",
    files: [
      {
        path: "白青/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "白颈蚯蚓",
    files: [
      {
        path: "白颈蚯蚓/000_熄风止痉药_地龙.jpg",
        type: [1],
      },
      {
        path: "白颈蚯蚓/000_熄风止痉药_地龙2.jpg",
        type: [1],
      },
      {
        path: "白颈蚯蚓/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "白首乌",
    files: [
      {
        path: "白首乌/010_耳叶牛皮消.jpg",
        type: [1],
      },
      {
        path: "白首乌/030_隔山牛皮消.jpg",
        type: [1],
      },
      {
        path: "白首乌/050_戟叶牛皮消.jpg",
        type: [1],
      },
      {
        path: "白首乌/070_耳叶牛皮消.jpg",
        type: [1],
      },
      {
        path: "白首乌/090_耳叶牛皮消.jpg",
        type: [1],
      },
      {
        path: "白首乌/110_隔山牛皮消.jpg",
        type: [1],
      },
      {
        path: "白首乌/130_隔山牛皮消.jpg",
        type: [1],
      },
      {
        path: "白首乌/150_隔山牛皮消.jpg",
        type: [1],
      },
      {
        path: "白首乌/170_戟叶牛皮消.jpg",
        type: [1],
      },
      {
        path: "白首乌/190_白首乌饮片.jpg",
        type: [1],
      },
      {
        path: "白首乌/210_隔山消.jpg",
        type: [1],
      },
      {
        path: "白首乌/230_耳叶牛皮消.jpg",
        type: [1],
      },
      {
        path: "白首乌/250_耳叶牛皮消表面观.jpg",
        type: [1],
      },
      {
        path: "白首乌/270_戟叶牛皮消.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "白马茎",
    files: [
      {
        path: "白马茎/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "白鲜皮",
    files: [
      {
        path: "白鲜皮/000_清热药_白鲜皮.jpg",
        type: [1],
      },
      {
        path: "白鲜皮/010_白鲜植物.jpg",
        type: [1],
      },
      {
        path: "白鲜皮/030_白鲜皮药材.jpg",
        type: [1],
      },
      {
        path: "白鲜皮/050_白鲜皮药材.jpg",
        type: [1],
      },
      {
        path: "白鲜皮/070_白鲜皮性状鉴别.jpg",
        type: [1],
      },
      {
        path: "白鲜皮/090_鹅绒藤皮.jpg",
        type: [1],
      },
      {
        path: "白鲜皮/110_白鲜皮劣药：木心未去掉.jpg",
        type: [1],
      },
      {
        path: "白鲜皮/130_白鲜皮饮片.jpg",
        type: [1],
      },
      {
        path: "白鲜皮/150_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "百合",
    files: [
      {
        path: "百合/000_补虚药_百合.jpg",
        type: [1],
      },
      {
        path: "百合/010_卷丹植物.jpg",
        type: [1],
      },
      {
        path: "百合/030_百合植物.jpg",
        type: [1],
      },
      {
        path: "百合/050_细叶百合植物.jpg",
        type: [1],
      },
      {
        path: "百合/070_百合药材.jpg",
        type: [1],
      },
      {
        path: "百合/090_卷丹药材.jpg",
        type: [1],
      },
      {
        path: "百合/110_细叶百合药材.jpg",
        type: [1],
      },
      {
        path: "百合/130_百合性状鉴别.jpg",
        type: [1],
      },
      {
        path: "百合/150_兰州百合（食用甜百合-甘肃省地方标准收载）.jpg",
        type: [1],
      },
      {
        path: "百合/170_蜜百合饮片.jpg",
        type: [1],
      },
      {
        path: "百合/190_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "百部",
    files: [
      {
        path: "百部/010_直立百部植物.jpg",
        type: [1],
      },
      {
        path: "百部/030_蔓生百部植物.jpg",
        type: [1],
      },
      {
        path: "百部/050_对叶百部植物.jpg",
        type: [1],
      },
      {
        path: "百部/070_直立百部.jpg",
        type: [1],
      },
      {
        path: "百部/090_蔓生百部.jpg",
        type: [1],
      },
      {
        path: "百部/110_对叶百部.jpg",
        type: [1],
      },
      {
        path: "百部/130_百部.jpg",
        type: [1],
      },
      {
        path: "百部/150_百部饮片.jpg",
        type: [1],
      },
      {
        path: "百部/170_直立百部.jpg",
        type: [1],
      },
      {
        path: "百部/190_蔓生百部.jpg",
        type: [1],
      },
      {
        path: "百部/210_对叶百部.jpg",
        type: [1],
      },
      {
        path: "百部/230_三种百部性状比较.jpg",
        type: [1],
      },
      {
        path: "百部/250_百部特征.jpg",
        type: [1],
      },
      {
        path: "百部/270_百部性状鉴别.jpg",
        type: [1],
      },
      {
        path: "百部/290_肥厚石刁柏.jpg",
        type: [1],
      },
      {
        path: "百部/310_羊齿天门冬.jpg",
        type: [1],
      },
      {
        path: "百部/330_百部饮片.jpg",
        type: [1],
      },
      {
        path: "百部/350_蜜百部.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "皂荚",
    files: [
      {
        path: "皂荚/000_化痰药_皂角.jpg",
        type: [1],
      },
      {
        path: "皂荚/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "皂角刺",
    files: [
      {
        path: "皂角刺/010_皂荚植物.jpg",
        type: [1],
      },
      {
        path: "皂角刺/030_皂角刺药材.jpg",
        type: [1],
      },
      {
        path: "皂角刺/050_皂角刺.jpg",
        type: [1],
      },
      {
        path: "皂角刺/070_皂角刺性状鉴别.jpg",
        type: [1],
      },
      {
        path: "皂角刺/090_日本皂角刺.jpg",
        type: [1],
      },
      {
        path: "皂角刺/110_皂角刺与日本皂角刺对比图.jpg",
        type: [1],
      },
      {
        path: "皂角刺/130_野皂角刺.jpg",
        type: [1],
      },
      {
        path: "皂角刺/150_野皂角刺.jpg",
        type: [1],
      },
      {
        path: "皂角刺/170_伪品酸枣刺.jpg",
        type: [1],
      },
      {
        path: "皂角刺/190_皂角刺饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "益智",
    files: [
      {
        path: "益智/010_益智植物.jpg",
        type: [1],
      },
      {
        path: "益智/030_益智花.jpg",
        type: [1],
      },
      {
        path: "益智/050_益智.jpg",
        type: [1],
      },
      {
        path: "益智/070_益智药材.jpg",
        type: [1],
      },
      {
        path: "益智/090_益智性状鉴别.jpg",
        type: [1],
      },
      {
        path: "益智/110_益智仁.jpg",
        type: [1],
      },
      {
        path: "益智/130_盐益智仁.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "益母草",
    files: [
      {
        path: "益母草/000_活血药_益母草.jpg",
        type: [1],
      },
      {
        path: "益母草/010_益母草植物.jpg",
        type: [1],
      },
      {
        path: "益母草/030_鲜益母草.jpg",
        type: [1],
      },
      {
        path: "益母草/050_鲜益母草.jpg",
        type: [1],
      },
      {
        path: "益母草/070_干益母草.jpg",
        type: [1],
      },
      {
        path: "益母草/090_益母草.jpg",
        type: [1],
      },
      {
        path: "益母草/110_益母草.jpg",
        type: [1],
      },
      {
        path: "益母草/130_益母草.jpg",
        type: [1],
      },
      {
        path: "益母草/150_夏至草.jpg",
        type: [1],
      },
      {
        path: "益母草/170_益母草.jpg",
        type: [1],
      },
      {
        path: "益母草/190_益母草性状鉴别.jpg",
        type: [1],
      },
      {
        path: "益母草/210_夏至草.jpg",
        type: [1],
      },
      {
        path: "益母草/230_夏至草.jpg",
        type: [2],
      },
      {
        path: "益母草/250_脓疮草.jpg",
        type: [2],
      },
      {
        path: "益母草/270_益母草饮片.jpg",
        type: [1],
      },
      {
        path: "益母草/290_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "盖草",
    files: [
      {
        path: "盖草/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "瞿麦",
    files: [
      {
        path: "瞿麦/000_利水渗湿药_瞿麦.jpg",
        type: [1],
      },
      {
        path: "瞿麦/010_瞿麦植物.jpg",
        type: [1],
      },
      {
        path: "瞿麦/030_石竹植物.jpg",
        type: [1],
      },
      {
        path: "瞿麦/050_瞿麦.jpg",
        type: [1],
      },
      {
        path: "瞿麦/070_石竹.jpg",
        type: [1],
      },
      {
        path: "瞿麦/090_瞿麦.jpg",
        type: [1],
      },
      {
        path: "瞿麦/110_石竹.jpg",
        type: [1],
      },
      {
        path: "瞿麦/130_石竹.jpg",
        type: [1],
      },
      {
        path: "瞿麦/150_瞿麦性状鉴别.jpg",
        type: [1],
      },
      {
        path: "瞿麦/170_瞿麦饮片.jpg",
        type: [1],
      },
      {
        path: "瞿麦/190_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "知母",
    files: [
      {
        path: "知母/000_清热药_知母.jpg",
        type: [1],
      },
      {
        path: "知母/010_知母植物.jpg",
        type: [1],
      },
      {
        path: "知母/030_毛知母药材.jpg",
        type: [1],
      },
      {
        path: "知母/050_毛知母药材.jpg",
        type: [1],
      },
      {
        path: "知母/070_光知母.jpg",
        type: [1],
      },
      {
        path: "知母/090_性状鉴别.jpg",
        type: [1],
      },
      {
        path: "知母/110_知母伪品.jpg",
        type: [1],
      },
      {
        path: "知母/130_知母饮片.jpg",
        type: [1],
      },
      {
        path: "知母/150_知母商品.jpg",
        type: [1],
      },
      {
        path: "知母/170_盐知母饮片.jpg",
        type: [1],
      },
      {
        path: "知母/190_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "矮地茶",
    files: [
      {
        path: "矮地茶/010_紫金牛植物.jpg",
        type: [1],
      },
      {
        path: "矮地茶/030_矮地茶药材.jpg",
        type: [1],
      },
      {
        path: "矮地茶/050_矮地茶.jpg",
        type: [1],
      },
      {
        path: "矮地茶/070_矮地茶.jpg",
        type: [1],
      },
      {
        path: "矮地茶/090_地枇杷.jpg",
        type: [1],
      },
      {
        path: "矮地茶/110_左：矮地茶   右：九节龙.jpg",
        type: [1],
      },
      {
        path: "矮地茶/130_左：小紫金牛   右：波叶紫金牛.jpg",
        type: [1],
      },
      {
        path: "矮地茶/150_矮地茶饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "石上柏",
    files: [
      {
        path: "石上柏/010_深绿卷柏.jpg",
        type: [1],
      },
      {
        path: "石上柏/030_深绿卷柏.jpg",
        type: [1],
      },
      {
        path: "石上柏/050_石上柏药材.jpg",
        type: [1],
      },
      {
        path: "石上柏/070_石上柏药材.jpg",
        type: [1],
      },
      {
        path: "石上柏/090_石上柏.jpg",
        type: [1],
      },
      {
        path: "石上柏/110_岩柏草.jpg",
        type: [1],
      },
      {
        path: "石上柏/130_翠云草.jpg",
        type: [1],
      },
      {
        path: "石上柏/150_石上柏与混洧品对比图.jpg",
        type: [1],
      },
      {
        path: "石上柏/170_石上柏饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "石决明",
    files: [
      {
        path: "石决明/010_杂色鲍.jpg",
        type: [1],
      },
      {
        path: "石决明/030_皱纹盘鲍.jpg",
        type: [1],
      },
      {
        path: "石决明/050_羊鲍.jpg",
        type: [1],
      },
      {
        path: "石决明/070_杂色鲍.jpg",
        type: [1],
      },
      {
        path: "石决明/090_皱纹盘鲍.jpg",
        type: [1],
      },
      {
        path: "石决明/110_羊鲍.jpg",
        type: [1],
      },
      {
        path: "石决明/130_澳洲鲍.jpg",
        type: [1],
      },
      {
        path: "石决明/150_耳鲍.jpg",
        type: [1],
      },
      {
        path: "石决明/170_耳鲍.jpg",
        type: [1],
      },
      {
        path: "石决明/190_白鲍.jpg",
        type: [1],
      },
      {
        path: "石决明/210_石决明药材.jpg",
        type: [1],
      },
      {
        path: "石决明/230_商品石决明性状对比.jpg",
        type: [1],
      },
      {
        path: "石决明/250_石决明性状鉴别.jpg",
        type: [1],
      },
      {
        path: "石决明/270_石决明性状鉴别.jpg",
        type: [1],
      },
      {
        path: "石决明/290_半纹盘鲍.jpg",
        type: [1],
      },
      {
        path: "石决明/310_石决明混有牡蛎碎块.jpg",
        type: [1],
      },
      {
        path: "石决明/330_石决明.jpg",
        type: [1],
      },
      {
        path: "石决明/350_煅石决明.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "石吊兰",
    files: [
      {
        path: "石吊兰/010_吊石苣苔植物.jpg",
        type: [1],
      },
      {
        path: "石吊兰/030_石吊兰.jpg",
        type: [1],
      },
      {
        path: "石吊兰/050_石吊兰.jpg",
        type: [1],
      },
      {
        path: "石吊兰/070_石吊兰.jpg",
        type: [1],
      },
      {
        path: "石吊兰/090_石吊兰.jpg",
        type: [1],
      },
      {
        path: "石吊兰/110_石吊兰.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "石斛",
    files: [
      {
        path: "石斛/000_补虚药_石斛.jpg",
        type: [1],
      },
      {
        path: "石斛/010_金钗石斛植物.jpg",
        type: [1],
      },
      {
        path: "石斛/030_霍山石斛植物.jpg",
        type: [1],
      },
      {
        path: "石斛/050_鼓槌石斛植物.jpg",
        type: [1],
      },
      {
        path: "石斛/070_流苏石斛植物.jpg",
        type: [1],
      },
      {
        path: "石斛/090_鲜石斛.jpg",
        type: [1],
      },
      {
        path: "石斛/110_金钗石斛.jpg",
        type: [1],
      },
      {
        path: "石斛/130_鼓槌石斛.jpg",
        type: [1],
      },
      {
        path: "石斛/150_流苏石斛.jpg",
        type: [1],
      },
      {
        path: "石斛/170_流苏石斛.jpg",
        type: [1],
      },
      {
        path: "石斛/190_霍山石斛与流苏石斛对比.jpg",
        type: [1],
      },
      {
        path: "石斛/210_石斛性状鉴别.jpg",
        type: [1],
      },
      {
        path: "石斛/230_石斛性状鉴别.jpg",
        type: [1],
      },
      {
        path: "石斛/250_粉花石斛原植物.jpg",
        type: [1],
      },
      {
        path: "石斛/270_粉花石斛.jpg",
        type: [1],
      },
      {
        path: "石斛/290_粉花石斛.jpg",
        type: [1],
      },
      {
        path: "石斛/310_马鞭石斛.jpg",
        type: [1],
      },
      {
        path: "石斛/330_束花石斛.jpg",
        type: [1],
      },
      {
        path: "石斛/350_束花石斛.jpg",
        type: [1],
      },
      {
        path: "石斛/370_金钗石斛原植物.jpg",
        type: [1],
      },
      {
        path: "石斛/390_金钗石斛.jpg",
        type: [1],
      },
      {
        path: "石斛/410_金钗石斛（鲜品）.jpg",
        type: [1],
      },
      {
        path: "石斛/430_铁皮石斛原植物.jpg",
        type: [1],
      },
      {
        path: "石斛/450_铁皮石斛.jpg",
        type: [1],
      },
      {
        path: "石斛/470_铁皮石斛（耳环）.jpg",
        type: [1],
      },
      {
        path: "石斛/490_铁皮石斛鲜品.jpg",
        type: [1],
      },
      {
        path: "石斛/510_细叶石斛.jpg",
        type: [2],
      },
      {
        path: "石斛/530_细叶石斛表面观.jpg",
        type: [2],
      },
      {
        path: "石斛/550_重唇石斛原植物.jpg",
        type: [2],
      },
      {
        path: "石斛/570_聚石斛.jpg",
        type: [2],
      },
      {
        path: "石斛/590_细茎石斛原植物.jpg",
        type: [2],
      },
      {
        path: "石斛/610_细茎石斛.jpg",
        type: [2],
      },
      {
        path: "石斛/630_戟叶全金斛.jpg",
        type: [2],
      },
      {
        path: "石斛/650_云南石仙桃.jpg",
        type: [2],
      },
      {
        path: "石斛/670_干石斛饮片.jpg",
        type: [1],
      },
      {
        path: "石斛/690_鲜石斛.jpg",
        type: [1],
      },
      {
        path: "石斛/710_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "石榴皮",
    files: [
      {
        path: "石榴皮/010_石榴植物.jpg",
        type: [1],
      },
      {
        path: "石榴皮/030_石榴皮药材.jpg",
        type: [1],
      },
      {
        path: "石榴皮/050_石榴皮.jpg",
        type: [1],
      },
      {
        path: "石榴皮/070_石榴皮饮片.jpg",
        type: [1],
      },
      {
        path: "石榴皮/090_石榴皮炭.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "石灰",
    files: [
      {
        path: "石灰/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "石膏",
    files: [
      {
        path: "石膏/000_清热药_石膏.jpg",
        type: [1],
      },
      {
        path: "石膏/010_石膏矿石.jpg",
        type: [1],
      },
      {
        path: "石膏/030_石膏药材.jpg",
        type: [1],
      },
      {
        path: "石膏/050_石膏.jpg",
        type: [1],
      },
      {
        path: "石膏/070_石膏性状鉴别.jpg",
        type: [1],
      },
      {
        path: "石膏/090_生石膏粉.jpg",
        type: [1],
      },
      {
        path: "石膏/110_煅石膏.jpg",
        type: [1],
      },
      {
        path: "石膏/130_煅石膏粉.jpg",
        type: [1],
      },
      {
        path: "石膏/150_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "石苇",
    files: [
      {
        path: "石苇/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "石莲苦石莲",
    files: [
      {
        path: "石莲苦石莲/010_莲植物.jpg",
        type: [1],
      },
      {
        path: "石莲苦石莲/030_石莲子药材.jpg",
        type: [1],
      },
      {
        path: "石莲苦石莲/050_石莲子与苦石莲比较.jpg",
        type: [1],
      },
      {
        path: "石莲苦石莲/070_南蛇勒植物.jpg",
        type: [1],
      },
      {
        path: "石莲苦石莲/090_苦石莲药材.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "石菖蒲",
    files: [
      {
        path: "石菖蒲/000_开窍药_石菖蒲.jpg",
        type: [1],
      },
      {
        path: "石菖蒲/000_开窍药_石菖蒲2.jpg",
        type: [1],
      },
      {
        path: "石菖蒲/010_石菖蒲.jpg",
        type: [1],
      },
      {
        path: "石菖蒲/030_石菖蒲鲜根.jpg",
        type: [1],
      },
      {
        path: "石菖蒲/050_石菖蒲药材.jpg",
        type: [1],
      },
      {
        path: "石菖蒲/070_石菖蒲药材.jpg",
        type: [1],
      },
      {
        path: "石菖蒲/090_石菖蒲饮片.jpg",
        type: [1],
      },
      {
        path: "石菖蒲/110_石菖蒲.jpg",
        type: [1],
      },
      {
        path: "石菖蒲/130_石菖蒲.jpg",
        type: [1],
      },
      {
        path: "石菖蒲/150_石菖蒲性状鉴别.jpg",
        type: [1],
      },
      {
        path: "石菖蒲/170_岩白菜根茎.jpg",
        type: [2],
      },
      {
        path: "石菖蒲/190_九节菖蒲.jpg",
        type: [1],
      },
      {
        path: "石菖蒲/210_水菖蒲.jpg",
        type: [1],
      },
      {
        path: "石菖蒲/230_石菖蒲与水菖蒲对比.jpg",
        type: [1],
      },
      {
        path: "石菖蒲/250_左：水菖蒲 右：石菖蒲.jpg",
        type: [1],
      },
      {
        path: "石菖蒲/270_石菖蒲饮片.jpg",
        type: [1],
      },
      {
        path: "石菖蒲/290_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "石蚕",
    files: [
      {
        path: "石蚕/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "石见穿",
    files: [
      {
        path: "石见穿/010_华鼠尾草植物.jpg",
        type: [1],
      },
      {
        path: "石见穿/030_石见穿.jpg",
        type: [1],
      },
      {
        path: "石见穿/050_石见穿.jpg",
        type: [1],
      },
      {
        path: "石见穿/070_石见穿.jpg",
        type: [1],
      },
      {
        path: "石见穿/090_石见穿.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "石钟乳",
    files: [
      {
        path: "石钟乳/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "石长生",
    files: [
      {
        path: "石长生/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "石韦",
    files: [
      {
        path: "石韦/010_庐山石韦.jpg",
        type: [1],
      },
      {
        path: "石韦/030_石韦.jpg",
        type: [1],
      },
      {
        path: "石韦/050_有柄石韦.jpg",
        type: [1],
      },
      {
        path: "石韦/070_庐山石韦.jpg",
        type: [1],
      },
      {
        path: "石韦/090_石韦.jpg",
        type: [1],
      },
      {
        path: "石韦/110_有柄石韦.jpg",
        type: [1],
      },
      {
        path: "石韦/130_石韦药材.jpg",
        type: [1],
      },
      {
        path: "石韦/150_庐山石韦.jpg",
        type: [1],
      },
      {
        path: "石韦/170_有柄石韦.jpg",
        type: [1],
      },
      {
        path: "石韦/190_庐山石韦.jpg",
        type: [1],
      },
      {
        path: "石韦/210_石韦.jpg",
        type: [1],
      },
      {
        path: "石韦/230_有柄石韦.jpg",
        type: [1],
      },
      {
        path: "石韦/250_石韦性状鉴别.jpg",
        type: [1],
      },
      {
        path: "石韦/270_庐山石韦.jpg",
        type: [1],
      },
      {
        path: "石韦/290_庐山石韦叶下表面观.jpg",
        type: [1],
      },
      {
        path: "石韦/310_石韦.jpg",
        type: [1],
      },
      {
        path: "石韦/330_石韦叶尖表面观.jpg",
        type: [1],
      },
      {
        path: "石韦/350_有柄石韦.jpg",
        type: [1],
      },
      {
        path: "石韦/370_有柄石韦叶表面观.jpg",
        type: [1],
      },
      {
        path: "石韦/390_北京石韦.jpg",
        type: [1],
      },
      {
        path: "石韦/410_北京石韦叶表面观.jpg",
        type: [1],
      },
      {
        path: "石韦/430_西南石韦.jpg",
        type: [1],
      },
      {
        path: "石韦/450_西南石韦叶表面观.jpg",
        type: [1],
      },
      {
        path: "石韦/470_毡毛石韦.jpg",
        type: [1],
      },
      {
        path: "石韦/490_矩圆石韦.jpg",
        type: [1],
      },
      {
        path: "石韦/510_光石韦.jpg",
        type: [1],
      },
      {
        path: "石韦/530_石韦饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "石龙芮",
    files: [
      {
        path: "石龙芮/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "砂仁",
    files: [
      {
        path: "砂仁/010_阳春砂植物.jpg",
        type: [1],
      },
      {
        path: "砂仁/030_阳春砂果实.jpg",
        type: [1],
      },
      {
        path: "砂仁/050_绿壳砂植物.jpg",
        type: [1],
      },
      {
        path: "砂仁/070_海南砂植物.jpg",
        type: [1],
      },
      {
        path: "砂仁/090_阳春砂药材.jpg",
        type: [1],
      },
      {
        path: "砂仁/110_海南砂.jpg",
        type: [1],
      },
      {
        path: "砂仁/130_砂仁性状鉴别.jpg",
        type: [1],
      },
      {
        path: "砂仁/150_砂仁伪品：海南假砂仁.jpg",
        type: [1],
      },
      {
        path: "砂仁/170_砂仁伪品：长序砂仁.jpg",
        type: [1],
      },
      {
        path: "砂仁/190_长序砂仁.jpg",
        type: [1],
      },
      {
        path: "砂仁/210_砂仁伪品：疣果砂仁.jpg",
        type: [1],
      },
      {
        path: "砂仁/230_砂仁伪品：艳山姜.jpg",
        type: [1],
      },
      {
        path: "砂仁/250_砂仁及伪品.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "硝石",
    files: [
      {
        path: "硝石/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "硫黄",
    files: [
      {
        path: "硫黄/000_功毒杀虫_硫磺.jpg",
        type: [1],
      },
      {
        path: "硫黄/010_自然硫矿石.jpg",
        type: [1],
      },
      {
        path: "硫黄/030_硫黄药材.jpg",
        type: [1],
      },
      {
        path: "硫黄/050_硫黄药材.jpg",
        type: [1],
      },
      {
        path: "硫黄/070_硫黄.jpg",
        type: [1],
      },
      {
        path: "硫黄/090_制硫黄.jpg",
        type: [1],
      },
      {
        path: "硫黄/110_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "磁石",
    files: [
      {
        path: "磁石/000_安神药_磁石.jpg",
        type: [1],
      },
      {
        path: "磁石/010_磁铁矿.jpg",
        type: [1],
      },
      {
        path: "磁石/030_磁石药材.jpg",
        type: [1],
      },
      {
        path: "磁石/050_磁石.jpg",
        type: [1],
      },
      {
        path: "磁石/070_磁石性状鉴别.jpg",
        type: [1],
      },
      {
        path: "磁石/090_磁石与伪磁石.jpg",
        type: [1],
      },
      {
        path: "磁石/110_煅磁石.jpg",
        type: [1],
      },
      {
        path: "磁石/130_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "礜石",
    files: [
      {
        path: "礜石/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "祖师麻",
    files: [
      {
        path: "祖师麻/010_黄瑞香植物.jpg",
        type: [1],
      },
      {
        path: "祖师麻/030_祖师麻.jpg",
        type: [1],
      },
      {
        path: "祖师麻/050_祖师麻.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "神曲",
    files: [
      {
        path: "神曲/000_消食药_神曲.jpg",
        type: [1],
      },
      {
        path: "神曲/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "禹余粮",
    files: [
      {
        path: "禹余粮/010_褐铁矿.jpg",
        type: [1],
      },
      {
        path: "禹余粮/030_禹余粮.jpg",
        type: [1],
      },
      {
        path: "禹余粮/050_禹余粮.jpg",
        type: [1],
      },
      {
        path: "禹余粮/070_禹余粮.jpg",
        type: [1],
      },
      {
        path: "禹余粮/090_禹余粮.jpg",
        type: [1],
      },
      {
        path: "禹余粮/110_禹余粮.jpg",
        type: [1],
      },
      {
        path: "禹余粮/130_禹余粮.jpg",
        type: [1],
      },
      {
        path: "禹余粮/150_禹余粮与煅禹余粮.jpg",
        type: [1],
      },
      {
        path: "禹余粮/170_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "秦椒",
    files: [
      {
        path: "秦椒/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "秦皮",
    files: [
      {
        path: "秦皮/000_清热药_秦皮.jpg",
        type: [1],
      },
      {
        path: "秦皮/000_清热药_秦皮2.jpg",
        type: [1],
      },
      {
        path: "秦皮/010_白蜡树植物.jpg",
        type: [1],
      },
      {
        path: "秦皮/030_枝皮.jpg",
        type: [1],
      },
      {
        path: "秦皮/050_干皮.jpg",
        type: [1],
      },
      {
        path: "秦皮/070_秦皮(白蜡树）.jpg",
        type: [1],
      },
      {
        path: "秦皮/090_秦皮（尖叶白蜡树）.jpg",
        type: [1],
      },
      {
        path: "秦皮/110_秦皮（苦枥白蜡树）.jpg",
        type: [1],
      },
      {
        path: "秦皮/130_秦皮（宿柱白蜡树）.jpg",
        type: [1],
      },
      {
        path: "秦皮/150_秦皮性状鉴别.jpg",
        type: [1],
      },
      {
        path: "秦皮/170_胡桃楸皮.jpg",
        type: [1],
      },
      {
        path: "秦皮/190_秦皮伪品.jpg",
        type: [1],
      },
      {
        path: "秦皮/210_伪品合欢皮.jpg",
        type: [1],
      },
      {
        path: "秦皮/230_秦皮饮片.jpg",
        type: [1],
      },
      {
        path: "秦皮/250_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "秦艽",
    files: [
      {
        path: "秦艽/000_祛风湿药_秦艽.jpg",
        type: [1],
      },
      {
        path: "秦艽/010_秦艽植物.jpg",
        type: [1],
      },
      {
        path: "秦艽/030_麻花秦艽植物.jpg",
        type: [1],
      },
      {
        path: "秦艽/050_粗茎秦艽植物.jpg",
        type: [1],
      },
      {
        path: "秦艽/070_小秦艽植物.jpg",
        type: [1],
      },
      {
        path: "秦艽/090_秦艽.jpg",
        type: [1],
      },
      {
        path: "秦艽/110_麻花艽.jpg",
        type: [1],
      },
      {
        path: "秦艽/130_小秦艽.jpg",
        type: [1],
      },
      {
        path: "秦艽/150_秦艽.jpg",
        type: [1],
      },
      {
        path: "秦艽/170_麻花秦艽.jpg",
        type: [1],
      },
      {
        path: "秦艽/190_小秦艽.jpg",
        type: [1],
      },
      {
        path: "秦艽/210_粗茎秦艽.jpg",
        type: [1],
      },
      {
        path: "秦艽/230_不同基源秦艽比较图.jpg",
        type: [1],
      },
      {
        path: "秦艽/250_秦艽性状鉴别.jpg",
        type: [1],
      },
      {
        path: "秦艽/270_三种秦艽的性状区别.jpg",
        type: [1],
      },
      {
        path: "秦艽/290_西藏黑秦艽.jpg",
        type: [1],
      },
      {
        path: "秦艽/310_黑大艽.jpg",
        type: [1],
      },
      {
        path: "秦艽/330_红秦艽.jpg",
        type: [1],
      },
      {
        path: "秦艽/350_黄秦艽.jpg",
        type: [1],
      },
      {
        path: "秦艽/370_五台秦艽.jpg",
        type: [1],
      },
      {
        path: "秦艽/390_独一味.jpg",
        type: [1],
      },
      {
        path: "秦艽/410_秦艽正品与伪品比较鉴别.jpg",
        type: [1],
      },
      {
        path: "秦艽/430_秦艽饮片.jpg",
        type: [1],
      },
      {
        path: "秦艽/450_家种秦艽饮片.jpg",
        type: [1],
      },
      {
        path: "秦艽/470_粗茎秦艽饮片.jpg",
        type: [1],
      },
      {
        path: "秦艽/490_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "积雪草",
    files: [
      {
        path: "积雪草/010_积雪草植物.jpg",
        type: [1],
      },
      {
        path: "积雪草/030_积雪草.jpg",
        type: [1],
      },
      {
        path: "积雪草/050_积雪草.jpg",
        type: [1],
      },
      {
        path: "积雪草/070_积雪草.jpg",
        type: [1],
      },
      {
        path: "积雪草/090_积雪草.jpg",
        type: [1],
      },
      {
        path: "积雪草/110_天胡荽.jpg",
        type: [1],
      },
      {
        path: "积雪草/130_活血丹.jpg",
        type: [1],
      },
      {
        path: "积雪草/150_马蹄金.jpg",
        type: [1],
      },
      {
        path: "积雪草/170_金钱草.jpg",
        type: [1],
      },
      {
        path: "积雪草/190_积雪草.jpg",
        type: [1],
      },
      {
        path: "积雪草/210_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "稻芽",
    files: [
      {
        path: "稻芽/010_稻植物.jpg",
        type: [1],
      },
      {
        path: "稻芽/030_稻芽药材.jpg",
        type: [1],
      },
      {
        path: "稻芽/050_稻芽性状鉴别.jpg",
        type: [1],
      },
      {
        path: "稻芽/070_稻芽.jpg",
        type: [1],
      },
      {
        path: "稻芽/090_稻芽.jpg",
        type: [1],
      },
      {
        path: "稻芽/110_易混淆品（谷芽）.jpg",
        type: [1],
      },
      {
        path: "稻芽/130_炒稻芽.jpg",
        type: [1],
      },
      {
        path: "稻芽/150_焦稻芽.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "空青",
    files: [
      {
        path: "空青/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "穿山甲",
    files: [
      {
        path: "穿山甲/010_穿山甲.jpg",
        type: [1],
      },
      {
        path: "穿山甲/030_穿山甲种类.jpg",
        type: [1],
      },
      {
        path: "穿山甲/050_不同部位穿山甲.jpg",
        type: [1],
      },
      {
        path: "穿山甲/070_穿山甲药材.jpg",
        type: [1],
      },
      {
        path: "穿山甲/090_穿山甲.jpg",
        type: [1],
      },
      {
        path: "穿山甲/110_中国穿山甲.jpg",
        type: [1],
      },
      {
        path: "穿山甲/130_马来穿山甲.jpg",
        type: [1],
      },
      {
        path: "穿山甲/150_树穿山甲.jpg",
        type: [1],
      },
      {
        path: "穿山甲/170_印度穿山甲.jpg",
        type: [1],
      },
      {
        path: "穿山甲/190_印度穿山甲与大穿山甲.jpg",
        type: [1],
      },
      {
        path: "穿山甲/210_印度穿山甲与大穿山甲.jpg",
        type: [1],
      },
      {
        path: "穿山甲/230_伪品：南非穿山甲.jpg",
        type: [1],
      },
      {
        path: "穿山甲/250_伪品：树穿山甲.jpg",
        type: [1],
      },
      {
        path: "穿山甲/270_炮猪蹄甲.jpg",
        type: [1],
      },
      {
        path: "穿山甲/290_掺盐的炮山甲.jpg",
        type: [1],
      },
      {
        path: "穿山甲/310_炮山甲.jpg",
        type: [1],
      },
      {
        path: "穿山甲/330_醋山甲.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "穿山龙",
    files: [
      {
        path: "穿山龙/010_穿龙薯蓣.jpg",
        type: [1],
      },
      {
        path: "穿山龙/030_穿山龙药材.jpg",
        type: [1],
      },
      {
        path: "穿山龙/050_穿山龙药材.jpg",
        type: [1],
      },
      {
        path: "穿山龙/070_穿山龙药材.jpg",
        type: [1],
      },
      {
        path: "穿山龙/090_穿山龙饮片.jpg",
        type: [1],
      },
      {
        path: "穿山龙/110_切片颜色及淡棕色的点状维管束.jpg",
        type: [1],
      },
      {
        path: "穿山龙/130_穿山龙.jpg",
        type: [1],
      },
      {
        path: "穿山龙/150_常山.jpg",
        type: [1],
      },
      {
        path: "穿山龙/170_穿山龙饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "穿心莲",
    files: [
      {
        path: "穿心莲/010_穿心莲.jpg",
        type: [1],
      },
      {
        path: "穿心莲/030_穿心莲药材.jpg",
        type: [1],
      },
      {
        path: "穿心莲/050_穿心莲药材.jpg",
        type: [1],
      },
      {
        path: "穿心莲/070_穿心莲.jpg",
        type: [1],
      },
      {
        path: "穿心莲/090_穿心莲茎叶.jpg",
        type: [1],
      },
      {
        path: "穿心莲/110_穿心莲性状鉴别.jpg",
        type: [1],
      },
      {
        path: "穿心莲/130_穿心莲饮片.jpg",
        type: [1],
      },
      {
        path: "穿心莲/150_穿心莲饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "穿破石",
    files: [
      {
        path: "穿破石/010_构棘植物.jpg",
        type: [1],
      },
      {
        path: "穿破石/030_柘植物.jpg",
        type: [1],
      },
      {
        path: "穿破石/050_穿破石药材.jpg",
        type: [1],
      },
      {
        path: "穿破石/070_穿破石药材.jpg",
        type: [1],
      },
      {
        path: "穿破石/090_穿破石药材.jpg",
        type: [1],
      },
      {
        path: "穿破石/110_穿破石饮片.jpg",
        type: [1],
      },
      {
        path: "穿破石/130_穿破石饮片.jpg",
        type: [1],
      },
      {
        path: "穿破石/150_穿破石饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "竹节参",
    files: [
      {
        path: "竹节参/010_竹节参植物.jpg",
        type: [1],
      },
      {
        path: "竹节参/030_竹节参药材.jpg",
        type: [1],
      },
      {
        path: "竹节参/050_竹节参药材.jpg",
        type: [1],
      },
      {
        path: "竹节参/070_竹节参.jpg",
        type: [1],
      },
      {
        path: "竹节参/090_竹节参.jpg",
        type: [1],
      },
      {
        path: "竹节参/110_竹节参表面观.jpg",
        type: [1],
      },
      {
        path: "竹节参/130_明三七.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "竹茹",
    files: [
      {
        path: "竹茹/010_青秆竹植物.jpg",
        type: [1],
      },
      {
        path: "竹茹/030_大头典竹植物.jpg",
        type: [1],
      },
      {
        path: "竹茹/050_淡竹植物.jpg",
        type: [1],
      },
      {
        path: "竹茹/070_竹茹药材.jpg",
        type: [1],
      },
      {
        path: "竹茹/090_竹茹性状鉴别.jpg",
        type: [1],
      },
      {
        path: "竹茹/110_竹茹饮片.jpg",
        type: [1],
      },
      {
        path: "竹茹/130_姜竹茹.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "筋骨草",
    files: [
      {
        path: "筋骨草/010_筋骨草植物.jpg",
        type: [1],
      },
      {
        path: "筋骨草/030_筋骨草药材.jpg",
        type: [1],
      },
      {
        path: "筋骨草/050_筋骨草.jpg",
        type: [1],
      },
      {
        path: "筋骨草/070_多花筋骨草.jpg",
        type: [1],
      },
      {
        path: "筋骨草/090_多花筋骨草.jpg",
        type: [1],
      },
      {
        path: "筋骨草/110_美花筋骨草.jpg",
        type: [1],
      },
      {
        path: "筋骨草/130_美花筋骨草.jpg",
        type: [1],
      },
      {
        path: "筋骨草/150_筋骨草饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "粉、绵萆薢",
    files: [
      {
        path: "粉、绵萆薢/000_利水渗湿药_萆薢.jpg",
        type: [1],
      },
      {
        path: "粉、绵萆薢/010_粉背薯蓣植物.jpg",
        type: [1],
      },
      {
        path: "粉、绵萆薢/030_粉萆薢药材.jpg",
        type: [1],
      },
      {
        path: "粉、绵萆薢/050_粉萆薢饮片.jpg",
        type: [1],
      },
      {
        path: "粉、绵萆薢/070_粉萆薢.jpg",
        type: [1],
      },
      {
        path: "粉、绵萆薢/090_粉萆薢性状鉴别.jpg",
        type: [1],
      },
      {
        path: "粉、绵萆薢/110_绵萆薢植物.jpg",
        type: [1],
      },
      {
        path: "粉、绵萆薢/130_福州薯蓣植物.jpg",
        type: [1],
      },
      {
        path: "粉、绵萆薢/150_绵萆薢饮片.jpg",
        type: [1],
      },
      {
        path: "粉、绵萆薢/170_绵萆薢饮片.jpg",
        type: [1],
      },
      {
        path: "粉、绵萆薢/190_绵萆薢.jpg",
        type: [1],
      },
      {
        path: "粉、绵萆薢/210_福州绵萆薢.jpg",
        type: [1],
      },
      {
        path: "粉、绵萆薢/230_绵萆薢性状鉴别.jpg",
        type: [1],
      },
      {
        path: "粉、绵萆薢/250_粉萆薢与绵萆薢的区别.jpg",
        type: [1],
      },
      {
        path: "粉、绵萆薢/270_纤细薯蓣.jpg",
        type: [1],
      },
      {
        path: "粉、绵萆薢/290_纤细薯蓣.jpg",
        type: [1],
      },
      {
        path: "粉、绵萆薢/310_山萆薢.jpg",
        type: [1],
      },
      {
        path: "粉、绵萆薢/330_穿山龙.jpg",
        type: [1],
      },
      {
        path: "粉、绵萆薢/350_红萆薢.jpg",
        type: [1],
      },
      {
        path: "粉、绵萆薢/370_萆薢与混伪品性状比较表.jpg",
        type: [1],
      },
      {
        path: "粉、绵萆薢/390_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "粉钖",
    files: [
      {
        path: "粉钖/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "粟米",
    files: [
      {
        path: "粟米/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "粳米",
    files: [
      {
        path: "粳米/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "糯稻根",
    files: [
      {
        path: "糯稻根/010_糯稻植物.jpg",
        type: [1],
      },
      {
        path: "糯稻根/030_糯稻根.jpg",
        type: [1],
      },
      {
        path: "糯稻根/050_糯稻根.jpg",
        type: [1],
      },
      {
        path: "糯稻根/070_糯稻根.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "紫参",
    files: [
      {
        path: "紫参/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "紫珠叶",
    files: [
      {
        path: "紫珠叶/010_杜虹花.jpg",
        type: [1],
      },
      {
        path: "紫珠叶/030_杜虹花.jpg",
        type: [1],
      },
      {
        path: "紫珠叶/050_紫珠叶药材.jpg",
        type: [1],
      },
      {
        path: "紫珠叶/070_紫珠叶.jpg",
        type: [1],
      },
      {
        path: "紫珠叶/090_紫珠叶.jpg",
        type: [1],
      },
      {
        path: "紫珠叶/110_杜虹花标本.jpg",
        type: [1],
      },
      {
        path: "紫珠叶/130_六种紫珠检索表.jpg",
        type: [1],
      },
      {
        path: "紫珠叶/150_六种紫珠性状比较.jpg",
        type: [1],
      },
      {
        path: "紫珠叶/170_六种紫珠性状比较.jpg",
        type: [1],
      },
      {
        path: "紫珠叶/190_六种紫珠性状比较.jpg",
        type: [1],
      },
      {
        path: "紫珠叶/210_六种紫珠性状比较.jpg",
        type: [1],
      },
      {
        path: "紫珠叶/230_紫珠叶饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "紫石英",
    files: [
      {
        path: "紫石英/010_萤石.jpg",
        type: [1],
      },
      {
        path: "紫石英/030_紫石英药材.jpg",
        type: [1],
      },
      {
        path: "紫石英/050_紫石英药材.jpg",
        type: [1],
      },
      {
        path: "紫石英/070_紫石英药材.jpg",
        type: [1],
      },
      {
        path: "紫石英/090_紫石英.jpg",
        type: [1],
      },
      {
        path: "紫石英/110_紫石英性状鉴别.jpg",
        type: [1],
      },
      {
        path: "紫石英/130_白石英.jpg",
        type: [1],
      },
      {
        path: "紫石英/150_此品杂质较多，不透明，质很次.jpg",
        type: [1],
      },
      {
        path: "紫石英/170_伪品紫石英.jpg",
        type: [1],
      },
      {
        path: "紫石英/190_紫石英.jpg",
        type: [1],
      },
      {
        path: "紫石英/210_煅紫石英.jpg",
        type: [1],
      },
      {
        path: "紫石英/230_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "紫花前胡",
    files: [
      {
        path: "紫花前胡/010_紫花前胡.jpg",
        type: [1],
      },
      {
        path: "紫花前胡/030_紫花前胡药材.jpg",
        type: [1],
      },
      {
        path: "紫花前胡/050_紫花前胡饮片.jpg",
        type: [1],
      },
      {
        path: "紫花前胡/070_紫花前胡饮片.jpg",
        type: [1],
      },
      {
        path: "紫花前胡/090_紫花前胡饮片.jpg",
        type: [1],
      },
      {
        path: "紫花前胡/110_紫花前胡.jpg",
        type: [1],
      },
      {
        path: "紫花前胡/130_紫花前胡.jpg",
        type: [1],
      },
      {
        path: "紫花前胡/150_白花前胡、紫花前胡比较.jpg",
        type: [1],
      },
      {
        path: "紫花前胡/170_紫花前胡性状鉴别.jpg",
        type: [1],
      },
      {
        path: "紫花前胡/190_石防风.jpg",
        type: [1],
      },
      {
        path: "紫花前胡/210_前胡伪品，短片藁本.jpg",
        type: [1],
      },
      {
        path: "紫花前胡/230_短片藁本.jpg",
        type: [1],
      },
      {
        path: "紫花前胡/250_华中前胡.jpg",
        type: [1],
      },
      {
        path: "紫花前胡/270_云前胡.jpg",
        type: [1],
      },
      {
        path: "紫花前胡/290_云前胡.jpg",
        type: [1],
      },
      {
        path: "紫花前胡/310_毛前胡.jpg",
        type: [1],
      },
      {
        path: "紫花前胡/330_毛前胡.jpg",
        type: [1],
      },
      {
        path: "紫花前胡/350_紫花前胡饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "紫花地丁",
    files: [
      {
        path: "紫花地丁/010_紫花地丁.jpg",
        type: [1],
      },
      {
        path: "紫花地丁/030_紫花地丁药材.jpg",
        type: [1],
      },
      {
        path: "紫花地丁/050_紫花地丁.jpg",
        type: [1],
      },
      {
        path: "紫花地丁/070_紫花地丁与鲜品.jpg",
        type: [1],
      },
      {
        path: "紫花地丁/090_紫花地丁性状鉴别.jpg",
        type: [1],
      },
      {
        path: "紫花地丁/110_白花地丁.jpg",
        type: [1],
      },
      {
        path: "紫花地丁/130_白花地丁.jpg",
        type: [1],
      },
      {
        path: "紫花地丁/150_犁头草.jpg",
        type: [1],
      },
      {
        path: "紫花地丁/170_犁头草.jpg",
        type: [1],
      },
      {
        path: "紫花地丁/190_紫花地丁.jpg",
        type: [1],
      },
      {
        path: "紫花地丁/210_广地丁.jpg",
        type: [1],
      },
      {
        path: "紫花地丁/230_紫花地丁饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "紫苏叶",
    files: [
      {
        path: "紫苏叶/010_紫苏.jpg",
        type: [1],
      },
      {
        path: "紫苏叶/030_紫苏叶药材.jpg",
        type: [1],
      },
      {
        path: "紫苏叶/050_紫苏叶药材.jpg",
        type: [1],
      },
      {
        path: "紫苏叶/070_紫苏叶.jpg",
        type: [1],
      },
      {
        path: "紫苏叶/090_紫苏叶性状鉴别.jpg",
        type: [1],
      },
      {
        path: "紫苏叶/110_紫苏叶混伪品：白苏.jpg",
        type: [1],
      },
      {
        path: "紫苏叶/130_紫苏叶饮片.jpg",
        type: [1],
      },
      {
        path: "紫苏叶/150_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "紫苏子",
    files: [
      {
        path: "紫苏子/010_紫苏植物.jpg",
        type: [1],
      },
      {
        path: "紫苏子/030_紫苏子药材.jpg",
        type: [1],
      },
      {
        path: "紫苏子/050_紫苏子放大.jpg",
        type: [1],
      },
      {
        path: "紫苏子/070_紫苏子性状鉴别.jpg",
        type: [1],
      },
      {
        path: "紫苏子/090_伪品：白苏子.jpg",
        type: [1],
      },
      {
        path: "紫苏子/110_石荠苧.jpg",
        type: [1],
      },
      {
        path: "紫苏子/130_1为家种紫苏子，2为野生紫苏子，3是伪品石荠苧，4是伪品小鱼仙草子.jpg",
        type: [1],
      },
      {
        path: "紫苏子/150_炒紫苏子.jpg",
        type: [1],
      },
      {
        path: "紫苏子/170_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "紫苏梗",
    files: [
      {
        path: "紫苏梗/010_紫苏.jpg",
        type: [1],
      },
      {
        path: "紫苏梗/030_紫苏梗药材.jpg",
        type: [1],
      },
      {
        path: "紫苏梗/050_紫苏梗药材.jpg",
        type: [1],
      },
      {
        path: "紫苏梗/070_紫苏梗杂质.jpg",
        type: [1],
      },
      {
        path: "紫苏梗/090_紫苏梗.jpg",
        type: [1],
      },
      {
        path: "紫苏梗/110_紫苏梗性状鉴别.jpg",
        type: [1],
      },
      {
        path: "紫苏梗/130_紫苏梗饮片.jpg",
        type: [1],
      },
      {
        path: "紫苏梗/150_紫苏梗饮片.jpg",
        type: [1],
      },
      {
        path: "紫苏梗/170_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "紫苑",
    files: [
      {
        path: "紫苑/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "紫荆皮",
    files: [
      {
        path: "紫荆皮/010_紫荆植物.jpg",
        type: [1],
      },
      {
        path: "紫荆皮/030_紫荆皮药材.jpg",
        type: [1],
      },
      {
        path: "紫荆皮/050_紫荆皮.jpg",
        type: [1],
      },
      {
        path: "紫荆皮/070_余甘子皮.jpg",
        type: [1],
      },
      {
        path: "紫荆皮/090_紫金皮.jpg",
        type: [1],
      },
      {
        path: "紫荆皮/110_昆明山海棠皮.jpg",
        type: [1],
      },
      {
        path: "紫荆皮/130_紫荆皮及混淆品来源.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "紫草",
    files: [
      {
        path: "紫草/000_清热药_紫草.jpg",
        type: [1],
      },
      {
        path: "紫草/010_新疆紫草植物.jpg",
        type: [1],
      },
      {
        path: "紫草/030_内蒙紫草植物.jpg",
        type: [1],
      },
      {
        path: "紫草/050_新疆紫草（软紫草）.jpg",
        type: [1],
      },
      {
        path: "紫草/070_内蒙紫草.jpg",
        type: [1],
      },
      {
        path: "紫草/090_硬紫草.jpg",
        type: [1],
      },
      {
        path: "紫草/110_紫草.jpg",
        type: [1],
      },
      {
        path: "紫草/130_紫草.jpg",
        type: [1],
      },
      {
        path: "紫草/150_新疆紫草、内蒙紫草区别.jpg",
        type: [1],
      },
      {
        path: "紫草/170_新疆紫草细节.jpg",
        type: [1],
      },
      {
        path: "紫草/190_新疆紫草.jpg",
        type: [1],
      },
      {
        path: "紫草/210_新疆紫草.jpg",
        type: [1],
      },
      {
        path: "紫草/230_蒙古紫草.jpg",
        type: [1],
      },
      {
        path: "紫草/250_硬紫草.jpg",
        type: [1],
      },
      {
        path: "紫草/270_硬紫草.jpg",
        type: [1],
      },
      {
        path: "紫草/290_紫草特征.jpg",
        type: [1],
      },
      {
        path: "紫草/310_紫草性状鉴别.jpg",
        type: [1],
      },
      {
        path: "紫草/330_三种紫草区别.jpg",
        type: [1],
      },
      {
        path: "紫草/350_滇紫草.jpg",
        type: [1],
      },
      {
        path: "紫草/370_藏紫草.jpg",
        type: [1],
      },
      {
        path: "紫草/390_露蕊紫草.jpg",
        type: [1],
      },
      {
        path: "紫草/410_北紫草.jpg",
        type: [1],
      },
      {
        path: "紫草/430_新疆紫草.jpg",
        type: [1],
      },
      {
        path: "紫草/450_内蒙紫草.jpg",
        type: [1],
      },
      {
        path: "紫草/470_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "紫菀",
    files: [
      {
        path: "紫菀/010_紫菀植物.jpg",
        type: [1],
      },
      {
        path: "紫菀/030_紫菀药材.jpg",
        type: [1],
      },
      {
        path: "紫菀/050_紫菀药材.jpg",
        type: [1],
      },
      {
        path: "紫菀/070_紫菀药材.jpg",
        type: [1],
      },
      {
        path: "紫菀/090_紫菀.jpg",
        type: [1],
      },
      {
        path: "紫菀/110_紫菀性状鉴别.jpg",
        type: [1],
      },
      {
        path: "紫菀/130_滇紫菀.jpg",
        type: [1],
      },
      {
        path: "紫菀/150_毛紫菀.jpg",
        type: [1],
      },
      {
        path: "紫菀/170_光紫菀.jpg",
        type: [1],
      },
      {
        path: "紫菀/190_山紫菀.jpg",
        type: [1],
      },
      {
        path: "紫菀/210_路边青.jpg",
        type: [1],
      },
      {
        path: "紫菀/230_紫菀饮片.jpg",
        type: [1],
      },
      {
        path: "紫菀/250_蜜紫菀.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "紫萁贯众",
    files: [
      {
        path: "紫萁贯众/000_清热药_贯众.jpg",
        type: [1],
      },
      {
        path: "紫萁贯众/000_清热药_贯众2.jpg",
        type: [1],
      },
      {
        path: "紫萁贯众/000_清热药_贯众3.jpg",
        type: [1],
      },
      {
        path: "紫萁贯众/010_紫萁植物.jpg",
        type: [1],
      },
      {
        path: "紫萁贯众/030_紫萁贯众药材.jpg",
        type: [1],
      },
      {
        path: "紫萁贯众/050_紫萁贯众药材.jpg",
        type: [1],
      },
      {
        path: "紫萁贯众/070_紫萁贯众药材.jpg",
        type: [1],
      },
      {
        path: "紫萁贯众/090_紫萁贯众饮片.jpg",
        type: [1],
      },
      {
        path: "紫萁贯众/110_紫萁贯众饮片.jpg",
        type: [1],
      },
      {
        path: "紫萁贯众/130_紫其贯众.jpg",
        type: [1],
      },
      {
        path: "紫萁贯众/150_紫其贯众.jpg",
        type: [1],
      },
      {
        path: "紫萁贯众/170_紫萁贯众叶柄基部横切面简图.jpg",
        type: [1],
      },
      {
        path: "紫萁贯众/190_苏铁蕨.jpg",
        type: [1],
      },
      {
        path: "紫萁贯众/210_紫萁贯众饮片.jpg",
        type: [1],
      },
      {
        path: "紫萁贯众/230_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "紫贝齿",
    files: [
      {
        path: "紫贝齿/010_阿拉伯绶贝.jpg",
        type: [1],
      },
      {
        path: "紫贝齿/030_紫贝齿背面.jpg",
        type: [1],
      },
      {
        path: "紫贝齿/050_紫贝齿腹面.jpg",
        type: [1],
      },
      {
        path: "紫贝齿/070_紫贝齿药材.jpg",
        type: [1],
      },
      {
        path: "紫贝齿/090_紫贝齿.jpg",
        type: [1],
      },
      {
        path: "紫贝齿/110_煅紫贝齿.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "红参",
    files: [
      {
        path: "红参/010_人参原植物.jpg",
        type: [1],
      },
      {
        path: "红参/030_人参植物.jpg",
        type: [1],
      },
      {
        path: "红参/050_鲜人参.jpg",
        type: [1],
      },
      {
        path: "红参/070_红参.jpg",
        type: [1],
      },
      {
        path: "红参/090_国产红参.jpg",
        type: [1],
      },
      {
        path: "红参/110_朝鲜红参.jpg",
        type: [1],
      },
      {
        path: "红参/130_红参正品：石柱参.jpg",
        type: [1],
      },
      {
        path: "红参/150_北朝鲜红参天20支.jpg",
        type: [1],
      },
      {
        path: "红参/170_北朝鲜红参地20支.jpg",
        type: [1],
      },
      {
        path: "红参/190_南朝鲜红参.jpg",
        type: [1],
      },
      {
        path: "红参/210_朝鲜红参仿制品.jpg",
        type: [1],
      },
      {
        path: "红参/230_朝鲜红参仿制品：垂序商陆.jpg",
        type: [1],
      },
      {
        path: "红参/250_朝鲜红参仿制品：紫茉莉.jpg",
        type: [1],
      },
      {
        path: "红参/270_朝鲜红参拼接品.jpg",
        type: [1],
      },
      {
        path: "红参/290_红参伪品：垂序商陆.jpg",
        type: [1],
      },
      {
        path: "红参/310_红参伪品：华山参.jpg",
        type: [1],
      },
      {
        path: "红参/330_红参伪品：桔梗.jpg",
        type: [1],
      },
      {
        path: "红参/350_红参伪品：栌兰.jpg",
        type: [1],
      },
      {
        path: "红参/370_红参伪品：沙参.jpg",
        type: [1],
      },
      {
        path: "红参/390_红参伪品：山莴苣.jpg",
        type: [1],
      },
      {
        path: "红参/410_红参伪品：商陆.jpg",
        type: [1],
      },
      {
        path: "红参/430_红参饮片.jpg",
        type: [1],
      },
      {
        path: "红参/450_加糖红参饮片与不加糖红参饮片性状.jpg",
        type: [1],
      },
      {
        path: "红参/470_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "红大戟",
    files: [
      {
        path: "红大戟/000_泻下药_京大戟.jpg",
        type: [1],
      },
      {
        path: "红大戟/000_泻下药_京大戟2.jpg",
        type: [1],
      },
      {
        path: "红大戟/010_红大戟植物.jpg",
        type: [1],
      },
      {
        path: "红大戟/030_红大戟药材.jpg",
        type: [1],
      },
      {
        path: "红大戟/050_红大戟药材.jpg",
        type: [1],
      },
      {
        path: "红大戟/070_红大戟饮片.jpg",
        type: [1],
      },
      {
        path: "红大戟/090_红大戟.jpg",
        type: [1],
      },
      {
        path: "红大戟/110_红大戟性状鉴别.jpg",
        type: [1],
      },
      {
        path: "红大戟/130_京大戟.jpg",
        type: [1],
      },
      {
        path: "红大戟/150_京大戟饮片.jpg",
        type: [1],
      },
      {
        path: "红大戟/170_草大戟.jpg",
        type: [1],
      },
      {
        path: "红大戟/190_绵大戟.jpg",
        type: [1],
      },
      {
        path: "红大戟/210_京大戟饮片.jpg",
        type: [1],
      },
      {
        path: "红大戟/230_红大戟饮片.jpg",
        type: [1],
      },
      {
        path: "红大戟/250_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "红景天",
    files: [
      {
        path: "红景天/010_大花红景天植物.jpg",
        type: [1],
      },
      {
        path: "红景天/030_红景天药材.jpg",
        type: [1],
      },
      {
        path: "红景天/050_红景天药材.jpg",
        type: [1],
      },
      {
        path: "红景天/070_红景天饮片.jpg",
        type: [1],
      },
      {
        path: "红景天/090_红景天饮片.jpg",
        type: [1],
      },
      {
        path: "红景天/110_红景天带外皮.jpg",
        type: [1],
      },
      {
        path: "红景天/130_红景天去外皮.jpg",
        type: [1],
      },
      {
        path: "红景天/150_红景天切片.jpg",
        type: [1],
      },
      {
        path: "红景天/170_红景天性状鉴别.jpg",
        type: [1],
      },
      {
        path: "红景天/190_大花红景天.jpg",
        type: [2],
      },
      {
        path: "红景天/210_长鞭红景天.jpg",
        type: [2],
      },
      {
        path: "红景天/230_圣地红景天全株.jpg",
        type: [2],
      },
      {
        path: "红景天/250_狭叶红景天.jpg",
        type: [2],
      },
      {
        path: "红景天/270_伪品红景天（俗称一口红）.jpg",
        type: [2],
      },
      {
        path: "红景天/290_混淆品小花红景天.jpg",
        type: [2],
      },
      {
        path: "红景天/310_红景天与小花红景天对比.jpg",
        type: [2],
      },
      {
        path: "红景天/330_红景天饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "红曲",
    files: [
      {
        path: "红曲/010_红曲药材.jpg",
        type: [1],
      },
      {
        path: "红曲/030_红曲药材.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "红粉",
    files: [
      {
        path: "红粉/010_红粉药材.jpg",
        type: [1],
      },
      {
        path: "红粉/030_红粉药材.jpg",
        type: [1],
      },
      {
        path: "红粉/050_红粉.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "红芪",
    files: [
      {
        path: "红芪/010_多序岩黄芪植物.jpg",
        type: [1],
      },
      {
        path: "红芪/030_红芪药材.jpg",
        type: [1],
      },
      {
        path: "红芪/050_红芪药材.jpg",
        type: [1],
      },
      {
        path: "红芪/070_红芪饮片.jpg",
        type: [1],
      },
      {
        path: "红芪/090_红芪饮片.jpg",
        type: [1],
      },
      {
        path: "红芪/110_红芪性状鉴别.jpg",
        type: [1],
      },
      {
        path: "红芪/130_唐古特岩黄芪.jpg",
        type: [1],
      },
      {
        path: "红芪/150_太白岩黄芪.jpg",
        type: [1],
      },
      {
        path: "红芪/170_刺果甘草.jpg",
        type: [1],
      },
      {
        path: "红芪/190_锦鸡儿.jpg",
        type: [1],
      },
      {
        path: "红芪/210_锦鸡儿表面切面观.jpg",
        type: [1],
      },
      {
        path: "红芪/230_圆叶锦葵.jpg",
        type: [1],
      },
      {
        path: "红芪/250_紫苜蓿.jpg",
        type: [1],
      },
      {
        path: "红芪/270_紫苜蓿断面观.jpg",
        type: [1],
      },
      {
        path: "红芪/290_梭果黄芪.jpg",
        type: [1],
      },
      {
        path: "红芪/310_梭果黄芪断面观.jpg",
        type: [1],
      },
      {
        path: "红芪/330_欧蜀葵.jpg",
        type: [1],
      },
      {
        path: "红芪/350_欧蜀葵切面观.jpg",
        type: [1],
      },
      {
        path: "红芪/370_四川黄芪.jpg",
        type: [1],
      },
      {
        path: "红芪/390_单蕊黄芪.jpg",
        type: [1],
      },
      {
        path: "红芪/410_东俄洛黄芪.jpg",
        type: [1],
      },
      {
        path: "红芪/430_多花黄芪.jpg",
        type: [1],
      },
      {
        path: "红芪/450_金翼黄芪.jpg",
        type: [1],
      },
      {
        path: "红芪/470_蜀葵.jpg",
        type: [1],
      },
      {
        path: "红芪/490_蓝花棘豆.jpg",
        type: [1],
      },
      {
        path: "红芪/510_红芪片.jpg",
        type: [1],
      },
      {
        path: "红芪/530_炙红芪.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "红花",
    files: [
      {
        path: "红花/000_活血药_红花.jpg",
        type: [1],
      },
      {
        path: "红花/010_红花植物.jpg",
        type: [1],
      },
      {
        path: "红花/030_红花.jpg",
        type: [1],
      },
      {
        path: "红花/050_红花药材.jpg",
        type: [1],
      },
      {
        path: "红花/070_红花花序.jpg",
        type: [1],
      },
      {
        path: "红花/090_红花性状鉴别.jpg",
        type: [1],
      },
      {
        path: "红花/110_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "红花龙胆",
    files: [
      {
        path: "红花龙胆/010_红花龙胆植物.jpg",
        type: [1],
      },
      {
        path: "红花龙胆/030_红花龙胆药材.jpg",
        type: [1],
      },
      {
        path: "红花龙胆/050_红花龙胆药材.jpg",
        type: [1],
      },
      {
        path: "红花龙胆/070_红花龙胆药材.jpg",
        type: [1],
      },
      {
        path: "红花龙胆/090_红花龙胆.jpg",
        type: [1],
      },
      {
        path: "红花龙胆/110_红花龙胆花表面观.jpg",
        type: [1],
      },
      {
        path: "红花龙胆/130_红花龙胆叶表面观.jpg",
        type: [1],
      },
      {
        path: "红花龙胆/150_红花龙胆饮片.jpg",
        type: [1],
      },
      {
        path: "红花龙胆/170_红花龙胆饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "红豆蔻",
    files: [
      {
        path: "红豆蔻/010_大高良姜植物.jpg",
        type: [1],
      },
      {
        path: "红豆蔻/030_大高良姜果实.jpg",
        type: [1],
      },
      {
        path: "红豆蔻/050_红豆蔻药材.jpg",
        type: [1],
      },
      {
        path: "红豆蔻/070_红豆蔻.jpg",
        type: [1],
      },
      {
        path: "红豆蔻/090_红豆蔻性状鉴别.jpg",
        type: [1],
      },
      {
        path: "红豆蔻/110_华山姜.jpg",
        type: [1],
      },
      {
        path: "红豆蔻/130_伪品：多花山姜.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "红黄白药子",
    files: [
      {
        path: "红黄白药子/010_红药子、黄药子、薯莨性状对比表.jpg",
        type: [1],
      },
      {
        path: "红黄白药子/030_毛脉蓼.jpg",
        type: [1],
      },
      {
        path: "红黄白药子/050_红药子饮片.jpg",
        type: [1],
      },
      {
        path: "红黄白药子/070_红药子.jpg",
        type: [1],
      },
      {
        path: "红黄白药子/090_红药子.jpg",
        type: [1],
      },
      {
        path: "红黄白药子/110_红药子饮片.jpg",
        type: [1],
      },
      {
        path: "红黄白药子/130_黄独植物.jpg",
        type: [1],
      },
      {
        path: "红黄白药子/150_新鲜黄药子.jpg",
        type: [1],
      },
      {
        path: "红黄白药子/170_黄药子药材.jpg",
        type: [1],
      },
      {
        path: "红黄白药子/190_黄药子饮片.jpg",
        type: [1],
      },
      {
        path: "红黄白药子/210_黄药子饮片.jpg",
        type: [1],
      },
      {
        path: "红黄白药子/230_黄药子.jpg",
        type: [1],
      },
      {
        path: "红黄白药子/250_黄药子.jpg",
        type: [1],
      },
      {
        path: "红黄白药子/270_黄药子.jpg",
        type: [1],
      },
      {
        path: "红黄白药子/290_鬼灯擎.jpg",
        type: [1],
      },
      {
        path: "红黄白药子/310_毛脉蓼.jpg",
        type: [1],
      },
      {
        path: "红黄白药子/330_翼蓼.jpg",
        type: [1],
      },
      {
        path: "红黄白药子/350_黄药子与伪品对比表.jpg",
        type: [1],
      },
      {
        path: "红黄白药子/370_薯莨植物.jpg",
        type: [1],
      },
      {
        path: "红黄白药子/390_薯莨鲜个.jpg",
        type: [1],
      },
      {
        path: "红黄白药子/410_薯莨.jpg",
        type: [1],
      },
      {
        path: "红黄白药子/430_薯莨饮片.jpg",
        type: [1],
      },
      {
        path: "红黄白药子/450_薯莨饮片.jpg",
        type: [1],
      },
      {
        path: "红黄白药子/470_薯莨.jpg",
        type: [1],
      },
      {
        path: "红黄白药子/490_头花千金藤.jpg",
        type: [1],
      },
      {
        path: "红黄白药子/510_白药子药材.jpg",
        type: [1],
      },
      {
        path: "红黄白药子/530_白药子饮片.jpg",
        type: [1],
      },
      {
        path: "红黄白药子/550_白药子饮片.jpg",
        type: [1],
      },
      {
        path: "红黄白药子/570_白药子.jpg",
        type: [1],
      },
      {
        path: "红黄白药子/590_白药子饮片.jpg",
        type: [1],
      },
      {
        path: "红黄白药子/610_千金藤.jpg",
        type: [1],
      },
      {
        path: "红黄白药子/630_滇白药.jpg",
        type: [1],
      },
      {
        path: "红黄白药子/650_翼蓼.jpg",
        type: [1],
      },
      {
        path: "红黄白药子/670_掌叶栝楼.jpg",
        type: [1],
      },
      {
        path: "红黄白药子/690_卷叶黄精.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "细辛",
    files: [
      {
        path: "细辛/010_北细辛植物.jpg",
        type: [1],
      },
      {
        path: "细辛/030_汉城细辛植物.jpg",
        type: [1],
      },
      {
        path: "细辛/050_华细辛植物.jpg",
        type: [1],
      },
      {
        path: "细辛/070_北细辛药材.jpg",
        type: [1],
      },
      {
        path: "细辛/090_汉城细辛药材.jpg",
        type: [1],
      },
      {
        path: "细辛/110_华细辛药材.jpg",
        type: [1],
      },
      {
        path: "细辛/130_细辛性状鉴别.jpg",
        type: [1],
      },
      {
        path: "细辛/150_伪品.jpg",
        type: [2],
      },
      {
        path: "细辛/170_伪品.jpg",
        type: [2],
      },
      {
        path: "细辛/190_杜衡.jpg",
        type: [2],
      },
      {
        path: "细辛/210_单叶细辛.jpg",
        type: [2],
      },
      {
        path: "细辛/230_大叶马蹄香.jpg",
        type: [2],
      },
      {
        path: "细辛/250_小叶马蹄香.jpg",
        type: [2],
      },
      {
        path: "细辛/270_丝穗金粟兰.jpg",
        type: [2],
      },
      {
        path: "细辛/290_鹿蹄橐吾.jpg",
        type: [2],
      },
      {
        path: "细辛/310_山慈菇.jpg",
        type: [2],
      },
      {
        path: "细辛/330_细辛饮片.jpg",
        type: [1],
      },
      {
        path: "细辛/350_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "络石藤",
    files: [
      {
        path: "络石藤/000_祛风湿药_络石藤.jpg",
        type: [1],
      },
      {
        path: "络石藤/010_络石植物.jpg",
        type: [1],
      },
      {
        path: "络石藤/030_络石藤药材.jpg",
        type: [1],
      },
      {
        path: "络石藤/050_络石藤.jpg",
        type: [1],
      },
      {
        path: "络石藤/070_络石藤性状鉴别.jpg",
        type: [1],
      },
      {
        path: "络石藤/090_络石藤.jpg",
        type: [1],
      },
      {
        path: "络石藤/110_广东络石藤.jpg",
        type: [1],
      },
      {
        path: "络石藤/130_络石藤药材.jpg",
        type: [1],
      },
      {
        path: "络石藤/150_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "绞股蓝",
    files: [
      {
        path: "绞股蓝/010_绞股蓝植物.jpg",
        type: [1],
      },
      {
        path: "绞股蓝/030_绞股蓝药材.jpg",
        type: [1],
      },
      {
        path: "绞股蓝/050_绞股蓝.jpg",
        type: [1],
      },
      {
        path: "绞股蓝/070_绞股蓝.jpg",
        type: [1],
      },
      {
        path: "绞股蓝/090_绞股蓝.jpg",
        type: [1],
      },
      {
        path: "绞股蓝/110_绞股蓝性状鉴别.jpg",
        type: [1],
      },
      {
        path: "绞股蓝/130_绞股蓝.jpg",
        type: [1],
      },
      {
        path: "绞股蓝/150_乌蔹莓.jpg",
        type: [1],
      },
      {
        path: "绞股蓝/170_绞股蓝与乌蔹莓的小叶比较.jpg",
        type: [1],
      },
      {
        path: "绞股蓝/190_绞股蓝与乌蔹莓的卷须着生位置对比.jpg",
        type: [1],
      },
      {
        path: "绞股蓝/210_绞股蓝与乌蔹莓花序类型对比.jpg",
        type: [1],
      },
      {
        path: "绞股蓝/230_绞股蓝与乌蔹莓果实类型对比.jpg",
        type: [1],
      },
      {
        path: "绞股蓝/250_绞股蓝与乌蔹莓口味对比.jpg",
        type: [1],
      },
      {
        path: "绞股蓝/270_绞股蓝饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "续断",
    files: [
      {
        path: "续断/000_补虚药_续断.jpg",
        type: [1],
      },
      {
        path: "续断/010_川续断植物.jpg",
        type: [1],
      },
      {
        path: "续断/030_续断药材.jpg",
        type: [1],
      },
      {
        path: "续断/050_续断饮片.jpg",
        type: [1],
      },
      {
        path: "续断/070_续断特征.jpg",
        type: [1],
      },
      {
        path: "续断/090_续断饮片特征.jpg",
        type: [1],
      },
      {
        path: "续断/110_续断.jpg",
        type: [1],
      },
      {
        path: "续断/130_续断性状鉴别.jpg",
        type: [1],
      },
      {
        path: "续断/150_伪品糙苏.jpg",
        type: [2],
      },
      {
        path: "续断/170_土木香片.jpg",
        type: [2],
      },
      {
        path: "续断/190_牛蒡根.jpg",
        type: [2],
      },
      {
        path: "续断/210_续断片.jpg",
        type: [1],
      },
      {
        path: "续断/230_酒续断.jpg",
        type: [1],
      },
      {
        path: "续断/250_盐续断.jpg",
        type: [1],
      },
      {
        path: "续断/270_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "绵马贯众",
    files: [
      {
        path: "绵马贯众/000_清热药_贯众.jpg",
        type: [1],
      },
      {
        path: "绵马贯众/000_清热药_贯众2.jpg",
        type: [1],
      },
      {
        path: "绵马贯众/000_清热药_贯众3.jpg",
        type: [1],
      },
      {
        path: "绵马贯众/010_粗茎鳞毛蕨.jpg",
        type: [1],
      },
      {
        path: "绵马贯众/030_绵马贯众药材.jpg",
        type: [1],
      },
      {
        path: "绵马贯众/050_绵马贯众饮片.jpg",
        type: [1],
      },
      {
        path: "绵马贯众/070_绵马贯众特征.jpg",
        type: [1],
      },
      {
        path: "绵马贯众/090_绵马贯众饮片.jpg",
        type: [1],
      },
      {
        path: "绵马贯众/110_绵马贯众.jpg",
        type: [1],
      },
      {
        path: "绵马贯众/130_绵马贯众叶柄基部横切面简图.jpg",
        type: [1],
      },
      {
        path: "绵马贯众/150_绵马贯众性状鉴别.jpg",
        type: [1],
      },
      {
        path: "绵马贯众/170_华南紫箕.jpg",
        type: [1],
      },
      {
        path: "绵马贯众/190_华南紫箕.jpg",
        type: [1],
      },
      {
        path: "绵马贯众/210_乌毛蕨.jpg",
        type: [1],
      },
      {
        path: "绵马贯众/230_苏铁蕨.jpg",
        type: [1],
      },
      {
        path: "绵马贯众/250_苏铁蕨.jpg",
        type: [1],
      },
      {
        path: "绵马贯众/270_紫其贯众.jpg",
        type: [1],
      },
      {
        path: "绵马贯众/290_紫其贯众.jpg",
        type: [1],
      },
      {
        path: "绵马贯众/310_紫萁贯众叶柄基部横切面简图.jpg",
        type: [1],
      },
      {
        path: "绵马贯众/330_狗脊贯众.jpg",
        type: [1],
      },
      {
        path: "绵马贯众/350_荚果蕨贯众.jpg",
        type: [1],
      },
      {
        path: "绵马贯众/370_狗脊贯众叶柄基部横切面简图                                                         荚果蕨贯众.jpg",
        type: [1],
      },
      {
        path: "绵马贯众/390_峨眉蕨.jpg",
        type: [1],
      },
      {
        path: "绵马贯众/410_小贯众.jpg",
        type: [1],
      },
      {
        path: "绵马贯众/430_峨眉蕨贯众                                            小贯众.jpg",
        type: [1],
      },
      {
        path: "绵马贯众/450_峨眉蕨贯众                                                 小贯众.jpg",
        type: [1],
      },
      {
        path: "绵马贯众/470_布郎耳蕨.jpg",
        type: [1],
      },
      {
        path: "绵马贯众/490_对马耳蕨.jpg",
        type: [1],
      },
      {
        path: "绵马贯众/510_桂皮紫其.jpg",
        type: [1],
      },
      {
        path: "绵马贯众/530_绵马贯众饮片.jpg",
        type: [1],
      },
      {
        path: "绵马贯众/550_绵马贯众炭.jpg",
        type: [1],
      },
      {
        path: "绵马贯众/570_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "罂粟壳",
    files: [
      {
        path: "罂粟壳/010_罂粟植物.jpg",
        type: [1],
      },
      {
        path: "罂粟壳/030_罂粟壳.jpg",
        type: [1],
      },
      {
        path: "罂粟壳/050_罂粟壳药材.jpg",
        type: [1],
      },
      {
        path: "罂粟壳/070_罂粟壳性状鉴别.jpg",
        type: [1],
      },
      {
        path: "罂粟壳/090_罂粟壳饮片.jpg",
        type: [1],
      },
      {
        path: "罂粟壳/110_蜜罂粟壳.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "罗汉果",
    files: [
      {
        path: "罗汉果/010_罗汉果植物.jpg",
        type: [1],
      },
      {
        path: "罗汉果/030_罗汉果药材.jpg",
        type: [1],
      },
      {
        path: "罗汉果/050_罗汉果.jpg",
        type: [1],
      },
      {
        path: "罗汉果/070_罗汉果性状鉴别.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "羊桃",
    files: [
      {
        path: "羊桃/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "羊泉",
    files: [
      {
        path: "羊泉/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "羊踯躅",
    files: [
      {
        path: "羊踯躅/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "羊蹄草",
    files: [
      {
        path: "羊蹄草/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "羌活",
    files: [
      {
        path: "羌活/010_羌活植物.jpg",
        type: [1],
      },
      {
        path: "羌活/030_宽叶羌活植物.jpg",
        type: [1],
      },
      {
        path: "羌活/050_蚕羌.jpg",
        type: [1],
      },
      {
        path: "羌活/070_竹节羌.jpg",
        type: [1],
      },
      {
        path: "羌活/090_条羌.jpg",
        type: [1],
      },
      {
        path: "羌活/110_大头羌.jpg",
        type: [1],
      },
      {
        path: "羌活/130_羌活药材.jpg",
        type: [1],
      },
      {
        path: "羌活/150_羌活饮片.jpg",
        type: [1],
      },
      {
        path: "羌活/170_蚕羌性状特征.jpg",
        type: [1],
      },
      {
        path: "羌活/190_竹节性状特征.jpg",
        type: [1],
      },
      {
        path: "羌活/210_羌活.jpg",
        type: [1],
      },
      {
        path: "羌活/230_宽叶羌活.jpg",
        type: [1],
      },
      {
        path: "羌活/250_宽叶羌活（野生品）－大头羌.jpg",
        type: [1],
      },
      {
        path: "羌活/270_宽叶羌活（野生品）-大头羌.jpg",
        type: [1],
      },
      {
        path: "羌活/290_宽叶羌活（栽培品）.jpg",
        type: [1],
      },
      {
        path: "羌活/310_羌活性状鉴别.jpg",
        type: [1],
      },
      {
        path: "羌活/330_龙头羌.jpg",
        type: [1],
      },
      {
        path: "羌活/350_蛇头羌.jpg",
        type: [1],
      },
      {
        path: "羌活/370_新疆羌活.jpg",
        type: [1],
      },
      {
        path: "羌活/390_新疆羌活.jpg",
        type: [1],
      },
      {
        path: "羌活/410_新疆羌活.jpg",
        type: [1],
      },
      {
        path: "羌活/430_新疆羌活.jpg",
        type: [1],
      },
      {
        path: "羌活/450_地榆片.jpg",
        type: [1],
      },
      {
        path: "羌活/470_牛尾独活.jpg",
        type: [1],
      },
      {
        path: "羌活/490_牛尾独活.jpg",
        type: [1],
      },
      {
        path: "羌活/510_无机盐增重的羌活：体视镜下能观察到柱状结晶.jpg",
        type: [1],
      },
      {
        path: "羌活/530_切面附着有污物.jpg",
        type: [1],
      },
      {
        path: "羌活/550_染色宽叶羌活栽培品.jpg",
        type: [1],
      },
      {
        path: "羌活/570_羌活饮片.jpg",
        type: [1],
      },
      {
        path: "羌活/590_羌活饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "羖羊角",
    files: [
      {
        path: "羖羊角/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "羚羊角",
    files: [
      {
        path: "羚羊角/000_熄风止痉药_羚羊角.jpg",
        type: [1],
      },
      {
        path: "羚羊角/010_赛加羚羊.jpg",
        type: [1],
      },
      {
        path: "羚羊角/030_羚羊角药材.jpg",
        type: [1],
      },
      {
        path: "羚羊角/050_羚羊角药材.jpg",
        type: [1],
      },
      {
        path: "羚羊角/070_羚羊角药材.jpg",
        type: [1],
      },
      {
        path: "羚羊角/090_羚羊老角药材.jpg",
        type: [1],
      },
      {
        path: "羚羊角/110_坚硬质重的角柱，与角呈齿状联合，习称“骨塞”.jpg",
        type: [1],
      },
      {
        path: "羚羊角/130_羚羊角.jpg",
        type: [1],
      },
      {
        path: "羚羊角/150_羚羊角性状鉴别.jpg",
        type: [1],
      },
      {
        path: "羚羊角/170_羚羊角与黄羊角.jpg",
        type: [1],
      },
      {
        path: "羚羊角/190_山羊角.jpg",
        type: [1],
      },
      {
        path: "羚羊角/210_藏羚羊角.jpg",
        type: [1],
      },
      {
        path: "羚羊角/230_人工伪制品.jpg",
        type: [1],
      },
      {
        path: "羚羊角/250_绵羊角.jpg",
        type: [1],
      },
      {
        path: "羚羊角/270_鹅喉羚羊角假冒.jpg",
        type: [1],
      },
      {
        path: "羚羊角/290_羚羊角镑片.jpg",
        type: [1],
      },
      {
        path: "羚羊角/310_羚羊角镑片.jpg",
        type: [1],
      },
      {
        path: "羚羊角/330_羚羊角丝.jpg",
        type: [1],
      },
      {
        path: "羚羊角/350_羚羊角粉.jpg",
        type: [1],
      },
      {
        path: "羚羊角/370_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "翘根",
    files: [
      {
        path: "翘根/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "翳螉",
    files: [
      {
        path: "翳螉/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "翻白草",
    files: [
      {
        path: "翻白草/010_翻白草植物.jpg",
        type: [1],
      },
      {
        path: "翻白草/030_翻白草药材.jpg",
        type: [1],
      },
      {
        path: "翻白草/050_翻白草.jpg",
        type: [1],
      },
      {
        path: "翻白草/070_委陵菜与翻白草比较.jpg",
        type: [1],
      },
      {
        path: "翻白草/090_左委陵菜  右翻白草.jpg",
        type: [1],
      },
      {
        path: "翻白草/110_翻白草饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "翼首草",
    files: [
      {
        path: "翼首草/010_匙叶翼首草植物.jpg",
        type: [1],
      },
      {
        path: "翼首草/030_翼首草.jpg",
        type: [1],
      },
      {
        path: "翼首草/050_翼首草.jpg",
        type: [1],
      },
      {
        path: "翼首草/070_翼首草.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "老君须与松萝",
    files: [
      {
        path: "老君须与松萝/010_环裂松萝植物.jpg",
        type: [1],
      },
      {
        path: "老君须与松萝/030_老君须.jpg",
        type: [1],
      },
      {
        path: "老君须与松萝/050_老君须.jpg",
        type: [1],
      },
      {
        path: "老君须与松萝/070_老君须.jpg",
        type: [1],
      },
      {
        path: "老君须与松萝/090_松萝.jpg",
        type: [1],
      },
      {
        path: "老君须与松萝/110_长松萝.jpg",
        type: [1],
      },
      {
        path: "老君须与松萝/130_松萝.jpg",
        type: [1],
      },
      {
        path: "老君须与松萝/150_长松萝.jpg",
        type: [1],
      },
      {
        path: "老君须与松萝/170_花松萝.jpg",
        type: [1],
      },
      {
        path: "老君须与松萝/190_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "老鹳草",
    files: [
      {
        path: "老鹳草/010_牻牛儿苗.jpg",
        type: [1],
      },
      {
        path: "老鹳草/030_老鹳草.jpg",
        type: [1],
      },
      {
        path: "老鹳草/050_野老鹳草.jpg",
        type: [1],
      },
      {
        path: "老鹳草/070_长嘴老鹳草.jpg",
        type: [1],
      },
      {
        path: "老鹳草/090_短嘴老鹳草.jpg",
        type: [1],
      },
      {
        path: "老鹳草/110_长嘴老鹳草.jpg",
        type: [1],
      },
      {
        path: "老鹳草/130_短嘴老鹳草.jpg",
        type: [1],
      },
      {
        path: "老鹳草/150_老鹳草果实和种子.jpg",
        type: [1],
      },
      {
        path: "老鹳草/170_老鹳草性状鉴别.jpg",
        type: [1],
      },
      {
        path: "老鹳草/190_老鹳草饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "肉桂",
    files: [
      {
        path: "肉桂/000_温里药_肉桂.jpg",
        type: [1],
      },
      {
        path: "肉桂/000_温里药_肉桂2.jpg",
        type: [1],
      },
      {
        path: "肉桂/010_肉桂植物.jpg",
        type: [1],
      },
      {
        path: "肉桂/030_肉桂药材.jpg",
        type: [1],
      },
      {
        path: "肉桂/050_肉桂.jpg",
        type: [1],
      },
      {
        path: "肉桂/070_肉桂性状鉴别.jpg",
        type: [1],
      },
      {
        path: "肉桂/090_伪品阴香.jpg",
        type: [2],
      },
      {
        path: "肉桂/110_伪品柴桂.jpg",
        type: [2],
      },
      {
        path: "肉桂/130_伪品三钻风.jpg",
        type: [2],
      },
      {
        path: "肉桂/150_易混淆品桂皮.jpg",
        type: [2],
      },
      {
        path: "肉桂/170_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "肉苁蓉",
    files: [
      {
        path: "肉苁蓉/000_补虚药_肉苁蓉.jpg",
        type: [1],
      },
      {
        path: "肉苁蓉/010_肉苁蓉植物.jpg",
        type: [1],
      },
      {
        path: "肉苁蓉/030_管花肉苁蓉植物.jpg",
        type: [1],
      },
      {
        path: "肉苁蓉/050_肉苁蓉药材（软大芸）.jpg",
        type: [1],
      },
      {
        path: "肉苁蓉/070_管花肉苁蓉药材（硬大芸）.jpg",
        type: [1],
      },
      {
        path: "肉苁蓉/090_不同产地的肉苁蓉图片.jpg",
        type: [1],
      },
      {
        path: "肉苁蓉/110_盐生肉苁蓉.jpg",
        type: [2],
      },
      {
        path: "肉苁蓉/130_草苁蓉.jpg",
        type: [2],
      },
      {
        path: "肉苁蓉/150_管花肉苁蓉地上茎（有一定的纤维，外皮无肉质鳞片）.jpg",
        type: [2],
      },
      {
        path: "肉苁蓉/170_锁阳.jpg",
        type: [2],
      },
      {
        path: "肉苁蓉/190_盐生肉苁蓉.jpg",
        type: [2],
      },
      {
        path: "肉苁蓉/210_草苁蓉.jpg",
        type: [2],
      },
      {
        path: "肉苁蓉/230_沙从蓉.jpg",
        type: [2],
      },
      {
        path: "肉苁蓉/250_肉苁蓉切片.jpg",
        type: [1],
      },
      {
        path: "肉苁蓉/270_肉苁蓉切片.jpg",
        type: [1],
      },
      {
        path: "肉苁蓉/290_春货质差.jpg",
        type: [1],
      },
      {
        path: "肉苁蓉/310_春货质差.jpg",
        type: [1],
      },
      {
        path: "肉苁蓉/330_管花肉苁蓉片.jpg",
        type: [1],
      },
      {
        path: "肉苁蓉/350_肉苁蓉片与管花肉苁蓉片.jpg",
        type: [1],
      },
      {
        path: "肉苁蓉/370_酒肉苁蓉.jpg",
        type: [1],
      },
      {
        path: "肉苁蓉/390_酒管花肉苁蓉.jpg",
        type: [1],
      },
      {
        path: "肉苁蓉/410_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "肉豆蔻",
    files: [
      {
        path: "肉豆蔻/010_肉豆蔻植物.jpg",
        type: [1],
      },
      {
        path: "肉豆蔻/030_肉豆蔻药材.jpg",
        type: [1],
      },
      {
        path: "肉豆蔻/050_肉豆蔻性状鉴别.jpg",
        type: [1],
      },
      {
        path: "肉豆蔻/070_肉豆蔻伪品：和香果.jpg",
        type: [1],
      },
      {
        path: "肉豆蔻/090_肉豆蔻伪品：和香果.jpg",
        type: [1],
      },
      {
        path: "肉豆蔻/110_肉豆蔻伪品：进口香果.jpg",
        type: [1],
      },
      {
        path: "肉豆蔻/130_麸煨肉豆蔻.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "肤青",
    files: [
      {
        path: "肤青/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "肿节风",
    files: [
      {
        path: "肿节风/010_草珊瑚.jpg",
        type: [1],
      },
      {
        path: "肿节风/030_草珊瑚.jpg",
        type: [1],
      },
      {
        path: "肿节风/050_肿节风药材.jpg",
        type: [1],
      },
      {
        path: "肿节风/070_肿节风药材.jpg",
        type: [1],
      },
      {
        path: "肿节风/090_肿节风.jpg",
        type: [1],
      },
      {
        path: "肿节风/110_肿节风.jpg",
        type: [1],
      },
      {
        path: "肿节风/130_肿节风.jpg",
        type: [1],
      },
      {
        path: "肿节风/150_肿节风性状鉴别.jpg",
        type: [1],
      },
      {
        path: "肿节风/170_肿节风及混洧品分种检索表.jpg",
        type: [1],
      },
      {
        path: "肿节风/190_肿节风饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "胆矾",
    files: [
      {
        path: "胆矾/000_涌吐药_胆矾.jpg",
        type: [1],
      },
      {
        path: "胆矾/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "胖大海",
    files: [
      {
        path: "胖大海/010_胖大海植物.jpg",
        type: [1],
      },
      {
        path: "胖大海/030_胖大海药材.jpg",
        type: [1],
      },
      {
        path: "胖大海/050_胖大海性状鉴别.jpg",
        type: [1],
      },
      {
        path: "胖大海/070_圆粒苹婆.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "胡椒",
    files: [
      {
        path: "胡椒/010_胡椒植物.jpg",
        type: [1],
      },
      {
        path: "胡椒/030_黑胡椒药材.jpg",
        type: [1],
      },
      {
        path: "胡椒/050_白胡椒药材.jpg",
        type: [1],
      },
      {
        path: "胡椒/070_胡椒.jpg",
        type: [1],
      },
      {
        path: "胡椒/090_胡椒性状鉴别.jpg",
        type: [1],
      },
      {
        path: "胡椒/110_南五味子.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "胡芦巴",
    files: [
      {
        path: "胡芦巴/010_胡芦巴植物.jpg",
        type: [1],
      },
      {
        path: "胡芦巴/030_胡芦巴药材.jpg",
        type: [1],
      },
      {
        path: "胡芦巴/050_胡芦巴药材.jpg",
        type: [1],
      },
      {
        path: "胡芦巴/070_胡芦巴性状鉴别.jpg",
        type: [1],
      },
      {
        path: "胡芦巴/090_胡芦巴药材.jpg",
        type: [1],
      },
      {
        path: "胡芦巴/110_盐胡芦巴.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "胡麻",
    files: [
      {
        path: "胡麻/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "胡黄连",
    files: [
      {
        path: "胡黄连/010_胡黄连植物.jpg",
        type: [1],
      },
      {
        path: "胡黄连/030_胡黄连药材.jpg",
        type: [1],
      },
      {
        path: "胡黄连/050_胡黄连药材.jpg",
        type: [1],
      },
      {
        path: "胡黄连/070_胡黄连饮片.jpg",
        type: [1],
      },
      {
        path: "胡黄连/090_胡黄连.jpg",
        type: [1],
      },
      {
        path: "胡黄连/110_胡黄连.jpg",
        type: [1],
      },
      {
        path: "胡黄连/130_胡黄连性状鉴别.jpg",
        type: [1],
      },
      {
        path: "胡黄连/150_胡黄连饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "腐婢",
    files: [
      {
        path: "腐婢/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "自然铜",
    files: [
      {
        path: "自然铜/010_天然硫化铁矿石.jpg",
        type: [1],
      },
      {
        path: "自然铜/030_自然铜.jpg",
        type: [1],
      },
      {
        path: "自然铜/050_自然铜药材.jpg",
        type: [1],
      },
      {
        path: "自然铜/070_自然铜性状鉴别.jpg",
        type: [1],
      },
      {
        path: "自然铜/090_黄铜矿.jpg",
        type: [1],
      },
      {
        path: "自然铜/110_煅自然铜.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "臭灵丹草",
    files: [
      {
        path: "臭灵丹草/010_翼齿六棱植物.jpg",
        type: [1],
      },
      {
        path: "臭灵丹草/030_翼齿六棱植物.jpg",
        type: [1],
      },
      {
        path: "臭灵丹草/050_臭灵丹草药材.jpg",
        type: [1],
      },
      {
        path: "臭灵丹草/070_臭灵丹草药材.jpg",
        type: [1],
      },
      {
        path: "臭灵丹草/090_臭灵丹草饮片.jpg",
        type: [1],
      },
      {
        path: "臭灵丹草/110_臭灵丹草饮片.jpg",
        type: [1],
      },
      {
        path: "臭灵丹草/130_臭灵丹草.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "艾叶",
    files: [
      {
        path: "艾叶/000_止血药_艾叶.jpg",
        type: [1],
      },
      {
        path: "艾叶/010_艾植物.jpg",
        type: [1],
      },
      {
        path: "艾叶/030_同属植物野艾.jpg",
        type: [1],
      },
      {
        path: "艾叶/050_艾与野艾叶片比较.jpg",
        type: [1],
      },
      {
        path: "艾叶/070_艾叶药材.jpg",
        type: [1],
      },
      {
        path: "艾叶/090_艾叶药材.jpg",
        type: [1],
      },
      {
        path: "艾叶/110_艾叶.jpg",
        type: [1],
      },
      {
        path: "艾叶/130_艾草.jpg",
        type: [1],
      },
      {
        path: "艾叶/150_艾叶.jpg",
        type: [1],
      },
      {
        path: "艾叶/170_艾叶.jpg",
        type: [1],
      },
      {
        path: "艾叶/190_艾叶性状鉴别.jpg",
        type: [1],
      },
      {
        path: "艾叶/210_艾叶.jpg",
        type: [1],
      },
      {
        path: "艾叶/230_醋艾炭.jpg",
        type: [1],
      },
      {
        path: "艾叶/250_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "芒硝",
    files: [
      {
        path: "芒硝/000_泻下药_芒硝.jpg",
        type: [1],
      },
      {
        path: "芒硝/010_芒硝矿石.jpg",
        type: [1],
      },
      {
        path: "芒硝/030_芒硝药材.jpg",
        type: [1],
      },
      {
        path: "芒硝/050_芒硝药材.jpg",
        type: [1],
      },
      {
        path: "芒硝/070_芒硝药材.jpg",
        type: [1],
      },
      {
        path: "芒硝/090_牙硝性状鉴别.jpg",
        type: [1],
      },
      {
        path: "芒硝/110_芒硝性状鉴别.jpg",
        type: [1],
      },
      {
        path: "芒硝/130_芒硝.jpg",
        type: [1],
      },
      {
        path: "芒硝/150_牙硝.jpg",
        type: [1],
      },
      {
        path: "芒硝/170_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "芜荑",
    files: [
      {
        path: "芜荑/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "芡实",
    files: [
      {
        path: "芡实/000_收涩药_芡实.jpg",
        type: [1],
      },
      {
        path: "芡实/010_芡植物.jpg",
        type: [1],
      },
      {
        path: "芡实/030_芡花.jpg",
        type: [1],
      },
      {
        path: "芡实/050_芡实.jpg",
        type: [1],
      },
      {
        path: "芡实/070_芡实鉴别.jpg",
        type: [1],
      },
      {
        path: "芡实/090_芡实饮片.jpg",
        type: [1],
      },
      {
        path: "芡实/110_麸炒芡实饮片.jpg",
        type: [1],
      },
      {
        path: "芡实/130_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "芥子",
    files: [
      {
        path: "芥子/010_白芥植物.jpg",
        type: [1],
      },
      {
        path: "芥子/030_芥植物.jpg",
        type: [1],
      },
      {
        path: "芥子/050_白芥子药材.jpg",
        type: [1],
      },
      {
        path: "芥子/070_黄芥子.jpg",
        type: [1],
      },
      {
        path: "芥子/090_白芥子、黄芥子对比图.jpg",
        type: [1],
      },
      {
        path: "芥子/110_白芥子、黄芥子对比图.jpg",
        type: [1],
      },
      {
        path: "芥子/130_芥子性状鉴别.jpg",
        type: [1],
      },
      {
        path: "芥子/150_炒芥子.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "芦根",
    files: [
      {
        path: "芦根/010_芦苇植物.jpg",
        type: [1],
      },
      {
        path: "芦根/030_鲜芦根.jpg",
        type: [1],
      },
      {
        path: "芦根/050_芦根药材.jpg",
        type: [1],
      },
      {
        path: "芦根/070_芦根药材.jpg",
        type: [1],
      },
      {
        path: "芦根/090_芦根饮片.jpg",
        type: [1],
      },
      {
        path: "芦根/110_芦根性状鉴别.jpg",
        type: [1],
      },
      {
        path: "芦根/130_菰.jpg",
        type: [1],
      },
      {
        path: "芦根/150_芦竹.jpg",
        type: [1],
      },
      {
        path: "芦根/170_芦竹.jpg",
        type: [1],
      },
      {
        path: "芦根/190_芦根、芦竹、菰性状比较.jpg",
        type: [1],
      },
      {
        path: "芦根/210_鲜芦根饮片.jpg",
        type: [1],
      },
      {
        path: "芦根/230_芦根饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "芦荟",
    files: [
      {
        path: "芦荟/010_库拉索芦荟植物.jpg",
        type: [1],
      },
      {
        path: "芦荟/030_好望角芦荟植物.jpg",
        type: [1],
      },
      {
        path: "芦荟/050_库拉索芦荟.jpg",
        type: [1],
      },
      {
        path: "芦荟/070_库拉索芦荟.jpg",
        type: [1],
      },
      {
        path: "芦荟/090_好望角芦荟.jpg",
        type: [1],
      },
      {
        path: "芦荟/110_芦荟药材.jpg",
        type: [1],
      },
      {
        path: "芦荟/130_库拉索芦荟.jpg",
        type: [1],
      },
      {
        path: "芦荟/150_芦荟性状鉴别.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "芫花",
    files: [
      {
        path: "芫花/000_泻下药_芫花.jpg",
        type: [1],
      },
      {
        path: "芫花/010_芫花植物.jpg",
        type: [1],
      },
      {
        path: "芫花/030_芫花.jpg",
        type: [1],
      },
      {
        path: "芫花/050_芫花药材.jpg",
        type: [1],
      },
      {
        path: "芫花/070_芫花性状鉴别.jpg",
        type: [1],
      },
      {
        path: "芫花/090_醋芫花.jpg",
        type: [1],
      },
      {
        path: "芫花/110_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "花椒",
    files: [
      {
        path: "花椒/000_温里药_花椒.jpg",
        type: [1],
      },
      {
        path: "花椒/010_青椒植物.jpg",
        type: [1],
      },
      {
        path: "花椒/030_花椒植物.jpg",
        type: [1],
      },
      {
        path: "花椒/050_青椒药材.jpg",
        type: [1],
      },
      {
        path: "花椒/070_花椒药材.jpg",
        type: [1],
      },
      {
        path: "花椒/090_青椒.jpg",
        type: [1],
      },
      {
        path: "花椒/110_花椒性状鉴别.jpg",
        type: [1],
      },
      {
        path: "花椒/130_野花椒.jpg",
        type: [1],
      },
      {
        path: "花椒/150_野花椒.jpg",
        type: [1],
      },
      {
        path: "花椒/170_竹叶椒.jpg",
        type: [1],
      },
      {
        path: "花椒/190_竹叶椒.jpg",
        type: [1],
      },
      {
        path: "花椒/210_巴氏吴茱萸.jpg",
        type: [1],
      },
      {
        path: "花椒/230_侧柏子.jpg",
        type: [1],
      },
      {
        path: "花椒/250_侧柏子.jpg",
        type: [1],
      },
      {
        path: "花椒/270_炒花椒.jpg",
        type: [1],
      },
      {
        path: "花椒/290_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "花蕊石",
    files: [
      {
        path: "花蕊石/010_蛇纹大理岩.jpg",
        type: [1],
      },
      {
        path: "花蕊石/030_蛇纹大理岩.jpg",
        type: [1],
      },
      {
        path: "花蕊石/050_花蕊石药材.jpg",
        type: [1],
      },
      {
        path: "花蕊石/070_花蕊石药材.jpg",
        type: [1],
      },
      {
        path: "花蕊石/090_花蕊石.jpg",
        type: [1],
      },
      {
        path: "花蕊石/110_煅花蕊石.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "苋实",
    files: [
      {
        path: "苋实/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "苍术",
    files: [
      {
        path: "苍术/010_茅苍术植物.jpg",
        type: [1],
      },
      {
        path: "苍术/030_北苍术植物.jpg",
        type: [1],
      },
      {
        path: "苍术/050_茅苍术药材.jpg",
        type: [1],
      },
      {
        path: "苍术/070_北苍术药材.jpg",
        type: [1],
      },
      {
        path: "苍术/090_苍术性状鉴别.jpg",
        type: [1],
      },
      {
        path: "苍术/110_断面比较.jpg",
        type: [1],
      },
      {
        path: "苍术/130_茅苍术切片（起霜）.jpg",
        type: [1],
      },
      {
        path: "苍术/150_关苍术.jpg",
        type: [1],
      },
      {
        path: "苍术/170_关苍术.jpg",
        type: [1],
      },
      {
        path: "苍术/190_苍术饮片（北苍术）.jpg",
        type: [1],
      },
      {
        path: "苍术/210_苍术饮片（茅苍术）.jpg",
        type: [1],
      },
      {
        path: "苍术/230_麸炒苍术.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "苍耳子",
    files: [
      {
        path: "苍耳子/010_苍耳植物.jpg",
        type: [1],
      },
      {
        path: "苍耳子/030_苍耳子药材.jpg",
        type: [1],
      },
      {
        path: "苍耳子/050_苍耳子性状鉴别.jpg",
        type: [1],
      },
      {
        path: "苍耳子/070_苍耳子.jpg",
        type: [1],
      },
      {
        path: "苍耳子/090_伪品：东北苍耳子.jpg",
        type: [1],
      },
      {
        path: "苍耳子/110_伪品：刺苍耳.jpg",
        type: [1],
      },
      {
        path: "苍耳子/130_混用品：蒙古苍耳子.jpg",
        type: [1],
      },
      {
        path: "苍耳子/150_苍耳子、蒙古苍耳子性状比较.jpg",
        type: [1],
      },
      {
        path: "苍耳子/170_炒苍耳子.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "苎麻根",
    files: [
      {
        path: "苎麻根/010_苎麻植物.jpg",
        type: [1],
      },
      {
        path: "苎麻根/030_苎麻根药材.jpg",
        type: [1],
      },
      {
        path: "苎麻根/050_苎麻根饮片.jpg",
        type: [1],
      },
      {
        path: "苎麻根/070_苎麻根饮片.jpg",
        type: [1],
      },
      {
        path: "苎麻根/090_苎麻根药材.jpg",
        type: [1],
      },
      {
        path: "苎麻根/110_苎麻根饮片.jpg",
        type: [1],
      },
      {
        path: "苎麻根/130_苎麻根药材.jpg",
        type: [1],
      },
      {
        path: "苎麻根/150_苎麻根饮片.jpg",
        type: [1],
      },
      {
        path: "苎麻根/170_苎麻根饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "苏合香",
    files: [
      {
        path: "苏合香/010_苏合香树植物.jpg",
        type: [1],
      },
      {
        path: "苏合香/030_苏合香.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "苏木",
    files: [
      {
        path: "苏木/010_苏木植物.jpg",
        type: [1],
      },
      {
        path: "苏木/030_苏木药材.jpg",
        type: [1],
      },
      {
        path: "苏木/050_苏木性状鉴别.jpg",
        type: [1],
      },
      {
        path: "苏木/070_苏木水试.jpg",
        type: [1],
      },
      {
        path: "苏木/090_小叶红豆.jpg",
        type: [1],
      },
      {
        path: "苏木/110_苏木饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "苘麻子",
    files: [
      {
        path: "苘麻子/010_苘麻.jpg",
        type: [1],
      },
      {
        path: "苘麻子/030_苘麻子药材.jpg",
        type: [1],
      },
      {
        path: "苘麻子/050_苘麻子.jpg",
        type: [1],
      },
      {
        path: "苘麻子/070_苘麻子、磨盘草子对比.jpg",
        type: [1],
      },
      {
        path: "苘麻子/090_冬葵果、冬葵子、苘麻子、磨盘草子对比图.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "苦丁茶",
    files: [
      {
        path: "苦丁茶/010_扣树.jpg",
        type: [1],
      },
      {
        path: "苦丁茶/030_苦丁茶.jpg",
        type: [1],
      },
      {
        path: "苦丁茶/050_苦丁茶.jpg",
        type: [1],
      },
      {
        path: "苦丁茶/070_大叶冬青叶.jpg",
        type: [1],
      },
      {
        path: "苦丁茶/090_大叶冬青叶.jpg",
        type: [1],
      },
      {
        path: "苦丁茶/110_小叶苦丁茶（粗壮女贞叶）.jpg",
        type: [1],
      },
      {
        path: "苦丁茶/130_小叶苦丁茶（粗壮女贞叶）.jpg",
        type: [1],
      },
      {
        path: "苦丁茶/150_小叶苦丁茶.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "苦参",
    files: [
      {
        path: "苦参/000_清热药_苦参.jpg",
        type: [1],
      },
      {
        path: "苦参/010_苦参植物.jpg",
        type: [1],
      },
      {
        path: "苦参/030_苦参药材.jpg",
        type: [1],
      },
      {
        path: "苦参/050_苦参饮片.jpg",
        type: [1],
      },
      {
        path: "苦参/070_苦参药材.jpg",
        type: [1],
      },
      {
        path: "苦参/090_苦参饮片.jpg",
        type: [1],
      },
      {
        path: "苦参/110_苦参栽培品和野生品对比.jpg",
        type: [1],
      },
      {
        path: "苦参/130_苦参.jpg",
        type: [1],
      },
      {
        path: "苦参/150_苦参饮片鉴别特征.jpg",
        type: [1],
      },
      {
        path: "苦参/170_苦参性状鉴别.jpg",
        type: [1],
      },
      {
        path: "苦参/190_左：苦参   右：古羊藤.jpg",
        type: [1],
      },
      {
        path: "苦参/210_刺果甘草.jpg",
        type: [1],
      },
      {
        path: "苦参/230_苦参饮片.jpg",
        type: [1],
      },
      {
        path: "苦参/250_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "苦地丁",
    files: [
      {
        path: "苦地丁/010_地丁草植物.jpg",
        type: [1],
      },
      {
        path: "苦地丁/030_苦地丁.jpg",
        type: [1],
      },
      {
        path: "苦地丁/050_苦地丁.jpg",
        type: [1],
      },
      {
        path: "苦地丁/070_苦地丁.jpg",
        type: [1],
      },
      {
        path: "苦地丁/090_甜地丁.jpg",
        type: [1],
      },
      {
        path: "苦地丁/110_紫花地丁.jpg",
        type: [1],
      },
      {
        path: "苦地丁/130_苦地丁饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "苦木",
    files: [
      {
        path: "苦木/010_苦木.jpg",
        type: [1],
      },
      {
        path: "苦木/030_苦木.jpg",
        type: [1],
      },
      {
        path: "苦木/050_苦木标本.jpg",
        type: [1],
      },
      {
        path: "苦木/070_苦木性状鉴别.jpg",
        type: [1],
      },
      {
        path: "苦木/090_苦木与胆木的鉴别.jpg",
        type: [1],
      },
      {
        path: "苦木/110_苦木茎饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "苦杏仁",
    files: [
      {
        path: "苦杏仁/000_止咳药_苦杏仁.jpg",
        type: [1],
      },
      {
        path: "苦杏仁/010_山杏植物.jpg",
        type: [1],
      },
      {
        path: "苦杏仁/030_西伯利亚杏植物.jpg",
        type: [1],
      },
      {
        path: "苦杏仁/050_东北杏植物.jpg",
        type: [1],
      },
      {
        path: "苦杏仁/070_杏植物.jpg",
        type: [1],
      },
      {
        path: "苦杏仁/090_苦杏仁药材.jpg",
        type: [1],
      },
      {
        path: "苦杏仁/110_苦杏仁性状鉴别.jpg",
        type: [1],
      },
      {
        path: "苦杏仁/130_桃仁与杏仁鉴别.jpg",
        type: [1],
      },
      {
        path: "苦杏仁/150_山杏.jpg",
        type: [1],
      },
      {
        path: "苦杏仁/170_西伯利亚杏.jpg",
        type: [1],
      },
      {
        path: "苦杏仁/190_东北杏.jpg",
        type: [1],
      },
      {
        path: "苦杏仁/210_东北杏.jpg",
        type: [1],
      },
      {
        path: "苦杏仁/230_苦杏仁味苦，甜杏仁味道微甜、细腻.jpg",
        type: [1],
      },
      {
        path: "苦杏仁/250_燀苦杏仁饮片.jpg",
        type: [1],
      },
      {
        path: "苦杏仁/270_炒苦杏仁饮片.jpg",
        type: [1],
      },
      {
        path: "苦杏仁/290_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "苦楝皮",
    files: [
      {
        path: "苦楝皮/010_川楝植物.jpg",
        type: [1],
      },
      {
        path: "苦楝皮/030_楝植物.jpg",
        type: [1],
      },
      {
        path: "苦楝皮/050_苦楝皮药材.jpg",
        type: [1],
      },
      {
        path: "苦楝皮/070_苦楝皮.jpg",
        type: [1],
      },
      {
        path: "苦楝皮/090_苦楝皮性状鉴别.jpg",
        type: [1],
      },
      {
        path: "苦楝皮/110_苦楝皮饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "苦瓠",
    files: [
      {
        path: "苦瓠/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "苦菜",
    files: [
      {
        path: "苦菜/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "茉莉花",
    files: [
      {
        path: "茉莉花/010_茉莉植物.jpg",
        type: [1],
      },
      {
        path: "茉莉花/030_茉莉花.jpg",
        type: [1],
      },
      {
        path: "茉莉花/050_茉莉花.jpg",
        type: [1],
      },
      {
        path: "茉莉花/070_茉莉花.jpg",
        type: [1],
      },
      {
        path: "茉莉花/090_茉莉花.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "茜草",
    files: [
      {
        path: "茜草/000_止血药_茜草.jpg",
        type: [1],
      },
      {
        path: "茜草/010_茜草植物.jpg",
        type: [1],
      },
      {
        path: "茜草/030_茜草鲜品及部位区分.jpg",
        type: [1],
      },
      {
        path: "茜草/050_野生茜草根，中部无髓，形体连续弯曲.jpg",
        type: [1],
      },
      {
        path: "茜草/070_野生茜草根茎，中部有髓，形体偏直.jpg",
        type: [1],
      },
      {
        path: "茜草/090_茜草药材.jpg",
        type: [1],
      },
      {
        path: "茜草/110_茜草药材.jpg",
        type: [1],
      },
      {
        path: "茜草/130_茜草切片.jpg",
        type: [1],
      },
      {
        path: "茜草/150_茜草特征.jpg",
        type: [1],
      },
      {
        path: "茜草/170_茜草特征.jpg",
        type: [1],
      },
      {
        path: "茜草/190_茜草.jpg",
        type: [1],
      },
      {
        path: "茜草/210_茜草性状鉴别.jpg",
        type: [1],
      },
      {
        path: "茜草/230_蓬子菜.jpg",
        type: [2],
      },
      {
        path: "茜草/250_蓬子菜根表面及断面.jpg",
        type: [2],
      },
      {
        path: "茜草/270_大叶茜草根.jpg",
        type: [2],
      },
      {
        path: "茜草/290_大叶茜草饮片.jpg",
        type: [2],
      },
      {
        path: "茜草/310_茜草及混伪品检索表.jpg",
        type: [2],
      },
      {
        path: "茜草/330_长叶茜草.jpg",
        type: [2],
      },
      {
        path: "茜草/350_茜草饮片.jpg",
        type: [1],
      },
      {
        path: "茜草/370_茜草炭.jpg",
        type: [1],
      },
      {
        path: "茜草/390_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "茯苓",
    files: [
      {
        path: "茯苓/000_利水渗湿药_茯苓.jpg",
        type: [1],
      },
      {
        path: "茯苓/010_真菌茯苓.jpg",
        type: [1],
      },
      {
        path: "茯苓/030_茯苓个.jpg",
        type: [1],
      },
      {
        path: "茯苓/050_茯苓块.jpg",
        type: [1],
      },
      {
        path: "茯苓/070_茯苓片.jpg",
        type: [1],
      },
      {
        path: "茯苓/090_茯神.jpg",
        type: [1],
      },
      {
        path: "茯苓/110_茯苓性状鉴别.jpg",
        type: [1],
      },
      {
        path: "茯苓/130_茯苓掺伪.jpg",
        type: [2],
      },
      {
        path: "茯苓/150_伪品：面粉或淀粉压制，水泡分散.jpg",
        type: [2],
      },
      {
        path: "茯苓/170_伪品茯苓：石膏制.jpg",
        type: [2],
      },
      {
        path: "茯苓/190_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "茯苓皮",
    files: [
      {
        path: "茯苓皮/010_真菌茯苓.jpg",
        type: [1],
      },
      {
        path: "茯苓皮/030_茯苓皮药材.jpg",
        type: [1],
      },
      {
        path: "茯苓皮/050_茯苓皮.jpg",
        type: [1],
      },
      {
        path: "茯苓皮/070_茯苓皮性状鉴别.jpg",
        type: [1],
      },
      {
        path: "茯苓皮/090_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "茵芋",
    files: [
      {
        path: "茵芋/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "茵陈",
    files: [
      {
        path: "茵陈/000_利水渗湿药_茵陈蒿.jpg",
        type: [1],
      },
      {
        path: "茵陈/010_滨蒿.jpg",
        type: [1],
      },
      {
        path: "茵陈/030_茵陈蒿.jpg",
        type: [1],
      },
      {
        path: "茵陈/050_绵茵陈.jpg",
        type: [1],
      },
      {
        path: "茵陈/070_花茵陈.jpg",
        type: [1],
      },
      {
        path: "茵陈/090_茵陈.jpg",
        type: [1],
      },
      {
        path: "茵陈/110_茵陈性状鉴别.jpg",
        type: [1],
      },
      {
        path: "茵陈/130_茵陈.jpg",
        type: [1],
      },
      {
        path: "茵陈/150_牛至（土茵陈）.jpg",
        type: [1],
      },
      {
        path: "茵陈/170_小白蒿.jpg",
        type: [2],
      },
      {
        path: "茵陈/190_茵陈饮片.jpg",
        type: [1],
      },
      {
        path: "茵陈/210_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "茺蔚子",
    files: [
      {
        path: "茺蔚子/010_益母草植物.jpg",
        type: [1],
      },
      {
        path: "茺蔚子/030_茺蔚子药材.jpg",
        type: [1],
      },
      {
        path: "茺蔚子/050_茺蔚子.jpg",
        type: [1],
      },
      {
        path: "茺蔚子/070_茺蔚子性状鉴别.jpg",
        type: [1],
      },
      {
        path: "茺蔚子/090_罗勒子.jpg",
        type: [1],
      },
      {
        path: "茺蔚子/110_炒茺蔚子.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "荆芥",
    files: [
      {
        path: "荆芥/010_荆芥植物.jpg",
        type: [1],
      },
      {
        path: "荆芥/030_荆芥药材.jpg",
        type: [1],
      },
      {
        path: "荆芥/050_荆芥穗.jpg",
        type: [1],
      },
      {
        path: "荆芥/070_荆芥.jpg",
        type: [1],
      },
      {
        path: "荆芥/090_荆芥.jpg",
        type: [1],
      },
      {
        path: "荆芥/110_荆芥性状鉴别.jpg",
        type: [1],
      },
      {
        path: "荆芥/130_假荆芥饮片.jpg",
        type: [1],
      },
      {
        path: "荆芥/150_荆芥饮片.jpg",
        type: [1],
      },
      {
        path: "荆芥/170_荆芥炭.jpg",
        type: [1],
      },
      {
        path: "荆芥/190_荆芥穗炭.jpg",
        type: [1],
      },
      {
        path: "荆芥/210_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "草乌",
    files: [
      {
        path: "草乌/010_北乌头植物.jpg",
        type: [1],
      },
      {
        path: "草乌/030_北乌头—圆锥形块根.jpg",
        type: [1],
      },
      {
        path: "草乌/050_鲜草乌横切片和纵切片对比.jpg",
        type: [1],
      },
      {
        path: "草乌/070_草乌药材.jpg",
        type: [1],
      },
      {
        path: "草乌/090_草乌药材.jpg",
        type: [1],
      },
      {
        path: "草乌/110_草乌药材.jpg",
        type: [1],
      },
      {
        path: "草乌/130_草乌切片.jpg",
        type: [1],
      },
      {
        path: "草乌/150_草乌特征.jpg",
        type: [1],
      },
      {
        path: "草乌/170_草乌.jpg",
        type: [1],
      },
      {
        path: "草乌/190_草乌性状鉴别.jpg",
        type: [1],
      },
      {
        path: "草乌/210_草乌 未经炮制前（个子货）.jpg",
        type: [1],
      },
      {
        path: "草乌/230_切片后.jpg",
        type: [1],
      },
      {
        path: "草乌/250_制草乌.jpg",
        type: [1],
      },
      {
        path: "草乌/270_川乌 未经炮制前（个子货）.jpg",
        type: [1],
      },
      {
        path: "草乌/290_切片后.jpg",
        type: [1],
      },
      {
        path: "草乌/310_川乌炮制品.jpg",
        type: [1],
      },
      {
        path: "草乌/330_盐附子.jpg",
        type: [1],
      },
      {
        path: "草乌/350_左白附片、右黑顺片.jpg",
        type: [1],
      },
      {
        path: "草乌/370_川乌、草乌、附子比较.jpg",
        type: [1],
      },
      {
        path: "草乌/390_川乌、草乌生品与制品比较.jpg",
        type: [1],
      },
      {
        path: "草乌/410_制川乌.jpg",
        type: [1],
      },
      {
        path: "草乌/430_川乌炮制过程.jpg",
        type: [1],
      },
      {
        path: "草乌/450_制川乌性状.jpg",
        type: [1],
      },
      {
        path: "草乌/470_制草乌.jpg",
        type: [1],
      },
      {
        path: "草乌/490_制草乌炮制过程与制草乌性状.jpg",
        type: [1],
      },
      {
        path: "草乌/510_制草乌伪品.jpg",
        type: [1],
      },
      {
        path: "草乌/530_制草乌伪品.jpg",
        type: [1],
      },
      {
        path: "草乌/550_附子个.jpg",
        type: [1],
      },
      {
        path: "草乌/570_黑顺片.jpg",
        type: [1],
      },
      {
        path: "草乌/590_瓜叶乌头.jpg",
        type: [1],
      },
      {
        path: "草乌/610_黄草乌.jpg",
        type: [1],
      },
      {
        path: "草乌/630_制草乌.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "草乌叶",
    files: [
      {
        path: "草乌叶/010_北乌头植物.jpg",
        type: [1],
      },
      {
        path: "草乌叶/030_草乌叶.jpg",
        type: [1],
      },
      {
        path: "草乌叶/050_草乌叶.jpg",
        type: [1],
      },
      {
        path: "草乌叶/070_草乌叶.jpg",
        type: [1],
      },
      {
        path: "草乌叶/090_草乌叶.jpg",
        type: [1],
      },
      {
        path: "草乌叶/110_几种乌头的叶片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "草果",
    files: [
      {
        path: "草果/010_草果植物.jpg",
        type: [1],
      },
      {
        path: "草果/030_草果.jpg",
        type: [1],
      },
      {
        path: "草果/050_草果药材.jpg",
        type: [1],
      },
      {
        path: "草果/070_草果性状鉴别.jpg",
        type: [1],
      },
      {
        path: "草果/090_草豆蔻果.jpg",
        type: [1],
      },
      {
        path: "草果/110_草豆蔻.jpg",
        type: [1],
      },
      {
        path: "草果/130_草果仁.jpg",
        type: [1],
      },
      {
        path: "草果/150_炒草果仁.jpg",
        type: [1],
      },
      {
        path: "草果/170_姜草果仁.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "草豆蔻",
    files: [
      {
        path: "草豆蔻/010_草豆蔻植物.jpg",
        type: [1],
      },
      {
        path: "草豆蔻/030_草豆蔻果实.jpg",
        type: [1],
      },
      {
        path: "草豆蔻/050_草豆蔻.jpg",
        type: [1],
      },
      {
        path: "草豆蔻/070_草豆蔻药材.jpg",
        type: [1],
      },
      {
        path: "草豆蔻/090_草豆蔻性状鉴别.jpg",
        type: [1],
      },
      {
        path: "草豆蔻/110_草豆蔻假劣药材：种子团小，种子粒大，种子粒少.jpg",
        type: [1],
      },
      {
        path: "草豆蔻/130_左云南草寇、右草豆蔻比较.jpg",
        type: [1],
      },
      {
        path: "草豆蔻/150_小豆蔻又名小草蔻，植物名为海南山姜Alpinia hainanensis.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "荔枝核",
    files: [
      {
        path: "荔枝核/010_荔枝植物.jpg",
        type: [1],
      },
      {
        path: "荔枝核/030_荔枝核药材.jpg",
        type: [1],
      },
      {
        path: "荔枝核/050_荔枝核.jpg",
        type: [1],
      },
      {
        path: "荔枝核/070_伪品：桂圆核.jpg",
        type: [1],
      },
      {
        path: "荔枝核/090_盐荔枝核.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "荜澄茄",
    files: [
      {
        path: "荜澄茄/010_山鸡椒植物.jpg",
        type: [1],
      },
      {
        path: "荜澄茄/030_荜澄茄药材.jpg",
        type: [1],
      },
      {
        path: "荜澄茄/050_荜澄茄.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "荜茇",
    files: [
      {
        path: "荜茇/010_荜茇植物.jpg",
        type: [1],
      },
      {
        path: "荜茇/030_荜茇药材.jpg",
        type: [1],
      },
      {
        path: "荜茇/050_荜茇.jpg",
        type: [1],
      },
      {
        path: "荜茇/070_荜茇性状鉴别.jpg",
        type: [1],
      },
      {
        path: "荜茇/090_伪品假蒟：果穗较正品短.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "药实根",
    files: [
      {
        path: "药实根/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "荷叶",
    files: [
      {
        path: "荷叶/010_莲植物.jpg",
        type: [1],
      },
      {
        path: "荷叶/030_荷叶药材.jpg",
        type: [1],
      },
      {
        path: "荷叶/050_荷叶.jpg",
        type: [1],
      },
      {
        path: "荷叶/070_荷叶.jpg",
        type: [1],
      },
      {
        path: "荷叶/090_荷叶性状鉴别.jpg",
        type: [1],
      },
      {
        path: "荷叶/110_荷叶丝.jpg",
        type: [1],
      },
      {
        path: "荷叶/130_荷叶炭.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "莨菪",
    files: [
      {
        path: "莨菪/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "莪术",
    files: [
      {
        path: "莪术/010_蓬莪术.jpg",
        type: [1],
      },
      {
        path: "莪术/030_广西莪术.jpg",
        type: [1],
      },
      {
        path: "莪术/050_温郁金.jpg",
        type: [1],
      },
      {
        path: "莪术/070_蓬莪术.jpg",
        type: [1],
      },
      {
        path: "莪术/090_广西莪术.jpg",
        type: [1],
      },
      {
        path: "莪术/110_温莪术.jpg",
        type: [1],
      },
      {
        path: "莪术/130_莪术.jpg",
        type: [1],
      },
      {
        path: "莪术/150_莪术饮片.jpg",
        type: [1],
      },
      {
        path: "莪术/170_莪术性状鉴别.jpg",
        type: [1],
      },
      {
        path: "莪术/190_莪术来源.jpg",
        type: [1],
      },
      {
        path: "莪术/210_莪术的来源与性状特征.jpg",
        type: [1],
      },
      {
        path: "莪术/230_莪术、姜黄、郁金、片姜黄的来源.jpg",
        type: [1],
      },
      {
        path: "莪术/250_莪术饮片.jpg",
        type: [1],
      },
      {
        path: "莪术/270_醋莪术.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "莱菔子",
    files: [
      {
        path: "莱菔子/010_萝卜植物.jpg",
        type: [1],
      },
      {
        path: "莱菔子/030_萝卜植物.jpg",
        type: [1],
      },
      {
        path: "莱菔子/050_莱菔子药材.jpg",
        type: [1],
      },
      {
        path: "莱菔子/070_莱菔子.jpg",
        type: [1],
      },
      {
        path: "莱菔子/090_莱菔子性状鉴别.jpg",
        type: [1],
      },
      {
        path: "莱菔子/110_白花菜籽.jpg",
        type: [1],
      },
      {
        path: "莱菔子/130_炒莱菔子.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "莲子",
    files: [
      {
        path: "莲子/000_收涩药_莲子.jpg",
        type: [1],
      },
      {
        path: "莲子/010_莲子植物.jpg",
        type: [1],
      },
      {
        path: "莲子/030_莲蓬.jpg",
        type: [1],
      },
      {
        path: "莲子/050_莲子.jpg",
        type: [1],
      },
      {
        path: "莲子/070_白莲子（去种皮）.jpg",
        type: [1],
      },
      {
        path: "莲子/090_莲子的鉴别.jpg",
        type: [1],
      },
      {
        path: "莲子/110_莲子饮片.jpg",
        type: [1],
      },
      {
        path: "莲子/130_莲子心.jpg",
        type: [1],
      },
      {
        path: "莲子/150_莲子心.jpg",
        type: [1],
      },
      {
        path: "莲子/170_石莲子与莲子图片.jpg",
        type: [1],
      },
      {
        path: "莲子/190_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "莲房",
    files: [
      {
        path: "莲房/010_莲植物.jpg",
        type: [1],
      },
      {
        path: "莲房/030_莲各部位.jpg",
        type: [1],
      },
      {
        path: "莲房/050_莲房药材.jpg",
        type: [1],
      },
      {
        path: "莲房/070_莲房药材.jpg",
        type: [1],
      },
      {
        path: "莲房/090_莲房炭.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "莲须",
    files: [
      {
        path: "莲须/010_莲植物.jpg",
        type: [1],
      },
      {
        path: "莲须/030_莲各部位.jpg",
        type: [1],
      },
      {
        path: "莲须/050_莲须药材.jpg",
        type: [1],
      },
      {
        path: "莲须/070_莲须药材.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "莽草",
    files: [
      {
        path: "莽草/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "菊三七",
    files: [
      {
        path: "菊三七/010_菊三七植物.jpg",
        type: [1],
      },
      {
        path: "菊三七/030_菊三七药材.jpg",
        type: [1],
      },
      {
        path: "菊三七/050_菊三七药材.jpg",
        type: [1],
      },
      {
        path: "菊三七/070_菊三七药材.jpg",
        type: [1],
      },
      {
        path: "菊三七/090_菊三七.jpg",
        type: [1],
      },
      {
        path: "菊三七/110_左：三七  右：菊三七.jpg",
        type: [1],
      },
      {
        path: "菊三七/130_上：三七  下：菊三七.jpg",
        type: [1],
      },
      {
        path: "菊三七/150_菊三七饮片.jpg",
        type: [1],
      },
      {
        path: "菊三七/170_菊三七饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "菊花",
    files: [
      {
        path: "菊花/000_清热药_野菊花.jpg",
        type: [1],
      },
      {
        path: "菊花/010_菊植物.jpg",
        type: [1],
      },
      {
        path: "菊花/030_菊花.jpg",
        type: [1],
      },
      {
        path: "菊花/050_怀菊花.jpg",
        type: [1],
      },
      {
        path: "菊花/070_亳菊.jpg",
        type: [1],
      },
      {
        path: "菊花/090_滁菊药材.jpg",
        type: [1],
      },
      {
        path: "菊花/110_滁菊药材.jpg",
        type: [1],
      },
      {
        path: "菊花/130_贡菊.jpg",
        type: [1],
      },
      {
        path: "菊花/150_黄山贡菊.jpg",
        type: [1],
      },
      {
        path: "菊花/170_杭白菊jpg.jpg",
        type: [1],
      },
      {
        path: "菊花/190_杭黄菊.jpg",
        type: [1],
      },
      {
        path: "菊花/210_胎菊（杭白菊）.jpg",
        type: [1],
      },
      {
        path: "菊花/230_怀菊.jpg",
        type: [1],
      },
      {
        path: "菊花/250_怀菊花药材.jpg",
        type: [1],
      },
      {
        path: "菊花/270_商品菊花.jpg",
        type: [1],
      },
      {
        path: "菊花/290_菊花性状鉴别.jpg",
        type: [1],
      },
      {
        path: "菊花/310_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "菊苣",
    files: [
      {
        path: "菊苣/010_毛菊苣植物.jpg",
        type: [1],
      },
      {
        path: "菊苣/030_菊苣植物.jpg",
        type: [1],
      },
      {
        path: "菊苣/050_毛菊苣.jpg",
        type: [1],
      },
      {
        path: "菊苣/070_菊苣.jpg",
        type: [1],
      },
      {
        path: "菊苣/090_菊苣.jpg",
        type: [1],
      },
      {
        path: "菊苣/110_菊苣.jpg",
        type: [1],
      },
      {
        path: "菊苣/130_菊苣.jpg",
        type: [1],
      },
      {
        path: "菊苣/150_菊苣.jpg",
        type: [1],
      },
      {
        path: "菊苣/170_菊苣根.jpg",
        type: [1],
      },
      {
        path: "菊苣/190_菊苣根.jpg",
        type: [1],
      },
      {
        path: "菊苣/210_菊苣.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "菝葜金刚藤",
    files: [
      {
        path: "菝葜金刚藤/010_菝葜植物.jpg",
        type: [1],
      },
      {
        path: "菝葜金刚藤/030_菝葜药材.jpg",
        type: [1],
      },
      {
        path: "菝葜金刚藤/050_菝葜饮片.jpg",
        type: [1],
      },
      {
        path: "菝葜金刚藤/070_菝葜药材.jpg",
        type: [1],
      },
      {
        path: "菝葜金刚藤/090_菝葜.jpg",
        type: [1],
      },
      {
        path: "菝葜金刚藤/110_菝葜性状鉴别.jpg",
        type: [1],
      },
      {
        path: "菝葜金刚藤/130_土茯苓.jpg",
        type: [1],
      },
      {
        path: "菝葜金刚藤/150_白土茯苓.jpg",
        type: [1],
      },
      {
        path: "菝葜金刚藤/170_菝葜饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "菟丝子",
    files: [
      {
        path: "菟丝子/000_补虚药_菟丝子.jpg",
        type: [1],
      },
      {
        path: "菟丝子/010_南方菟丝子.jpg",
        type: [1],
      },
      {
        path: "菟丝子/030_菟丝子.jpg",
        type: [1],
      },
      {
        path: "菟丝子/050_菟丝子药材.jpg",
        type: [1],
      },
      {
        path: "菟丝子/070_菟丝子药材.jpg",
        type: [1],
      },
      {
        path: "菟丝子/090_菟丝子性状鉴别.jpg",
        type: [1],
      },
      {
        path: "菟丝子/110_菟丝子吐丝.jpg",
        type: [1],
      },
      {
        path: "菟丝子/130_内蒙产 菟丝子（放大）.jpg",
        type: [2],
      },
      {
        path: "菟丝子/150_菟丝子 宁夏产（放大）.jpg",
        type: [2],
      },
      {
        path: "菟丝子/170_河南产菟丝子（放大）.jpg",
        type: [2],
      },
      {
        path: "菟丝子/190_菟丝子用硬物挤压后中间三个是没挤压的（放大）.jpg",
        type: [2],
      },
      {
        path: "菟丝子/210_菟丝子、千穗谷种子、苋实和加工品对照（放大）.jpg",
        type: [2],
      },
      {
        path: "菟丝子/230_加工品用硬物挤压后（放大）.jpg",
        type: [2],
      },
      {
        path: "菟丝子/250_千穗谷用硬物挤压后（放大）.jpg",
        type: [2],
      },
      {
        path: "菟丝子/270_千穗谷与菟丝子（放大）.jpg",
        type: [2],
      },
      {
        path: "菟丝子/290_小苏子与菟丝子对照（放大）.jpg",
        type: [2],
      },
      {
        path: "菟丝子/310_欧菟丝子.jpg",
        type: [2],
      },
      {
        path: "菟丝子/330_大菟丝子.jpg",
        type: [2],
      },
      {
        path: "菟丝子/350_盐菟丝子.jpg",
        type: [1],
      },
      {
        path: "菟丝子/370_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "菥蓂",
    files: [
      {
        path: "菥蓂/010_菥蓂植物.jpg",
        type: [1],
      },
      {
        path: "菥蓂/030_菥蓂饮片.jpg",
        type: [1],
      },
      {
        path: "菥蓂/050_菥蓂饮片.jpg",
        type: [1],
      },
      {
        path: "菥蓂/070_菥蓂果实.jpg",
        type: [1],
      },
      {
        path: "菥蓂/090_菥蓂性状鉴别.jpg",
        type: [1],
      },
      {
        path: "菥蓂/110_菥蓂饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "萤火",
    files: [
      {
        path: "萤火/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "萱草根",
    files: [
      {
        path: "萱草根/010_萱草植物.jpg",
        type: [1],
      },
      {
        path: "萱草根/030_金针菜植物.jpg",
        type: [1],
      },
      {
        path: "萱草根/050_小萱草植物.jpg",
        type: [1],
      },
      {
        path: "萱草根/070_萱草.jpg",
        type: [1],
      },
      {
        path: "萱草根/090_金针菜.jpg",
        type: [1],
      },
      {
        path: "萱草根/110_小萱草.jpg",
        type: [1],
      },
      {
        path: "萱草根/130_萱草根.jpg",
        type: [1],
      },
      {
        path: "萱草根/150_小萱草根.jpg",
        type: [1],
      },
      {
        path: "萱草根/170_萱草根药材.jpg",
        type: [1],
      },
      {
        path: "萱草根/190_萱草根饮片.jpg",
        type: [1],
      },
      {
        path: "萱草根/210_萱草根饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "萹蓄",
    files: [
      {
        path: "萹蓄/010_萹蓄.jpg",
        type: [1],
      },
      {
        path: "萹蓄/030_萹蓄药材.jpg",
        type: [1],
      },
      {
        path: "萹蓄/050_萹蓄.jpg",
        type: [1],
      },
      {
        path: "萹蓄/070_萹蓄.jpg",
        type: [1],
      },
      {
        path: "萹蓄/090_萹蓄性状鉴别.jpg",
        type: [1],
      },
      {
        path: "萹蓄/110_萹蓄.jpg",
        type: [1],
      },
      {
        path: "萹蓄/130_小萹蓄.jpg",
        type: [1],
      },
      {
        path: "萹蓄/150_习见蓼.jpg",
        type: [1],
      },
      {
        path: "萹蓄/170_长萼鸡眼草.jpg",
        type: [1],
      },
      {
        path: "萹蓄/190_萹蓄饮片.jpg",
        type: [1],
      },
      {
        path: "萹蓄/210_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "葛根",
    files: [
      {
        path: "葛根/010_野葛植物.jpg",
        type: [1],
      },
      {
        path: "葛根/030_葛根药材.jpg",
        type: [1],
      },
      {
        path: "葛根/050_葛根片.jpg",
        type: [1],
      },
      {
        path: "葛根/070_葛根丁.jpg",
        type: [1],
      },
      {
        path: "葛根/090_葛根性状鉴别.jpg",
        type: [1],
      },
      {
        path: "葛根/110_甘葛藤植物.jpg",
        type: [1],
      },
      {
        path: "葛根/130_粉葛鲜品.jpg",
        type: [1],
      },
      {
        path: "葛根/150_粉葛药材.jpg",
        type: [1],
      },
      {
        path: "葛根/170_粉葛片.jpg",
        type: [1],
      },
      {
        path: "葛根/190_粉葛片.jpg",
        type: [1],
      },
      {
        path: "葛根/210_粉葛性状鉴别.jpg",
        type: [1],
      },
      {
        path: "葛根/230_紫藤根.jpg",
        type: [1],
      },
      {
        path: "葛根/250_紫藤根.jpg",
        type: [1],
      },
      {
        path: "葛根/270_苦葛根.jpg",
        type: [1],
      },
      {
        path: "葛根/290_野葛藤茎中心有髓.jpg",
        type: [1],
      },
      {
        path: "葛根/310_野葛藤茎表面灰黑色、粗糙、有皮孔.jpg",
        type: [1],
      },
      {
        path: "葛根/330_葛根纵断面观，纤维之间富含淀粉.jpg",
        type: [1],
      },
      {
        path: "葛根/350_野葛藤茎切面导管、纤维之间无淀粉.jpg",
        type: [1],
      },
      {
        path: "葛根/370_葛根（左）野葛木化藤茎（右）.jpg",
        type: [1],
      },
      {
        path: "葛根/390_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "葛花",
    files: [
      {
        path: "葛花/010_野葛植物.jpg",
        type: [1],
      },
      {
        path: "葛花/030_甘葛藤植物.jpg",
        type: [1],
      },
      {
        path: "葛花/050_甘葛藤花.jpg",
        type: [1],
      },
      {
        path: "葛花/070_葛花药材.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "葡萄",
    files: [
      {
        path: "葡萄/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "葱实",
    files: [
      {
        path: "葱实/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "葱白",
    files: [
      {
        path: "葱白/010_分葱植物.jpg",
        type: [1],
      },
      {
        path: "葱白/030_香葱植物.jpg",
        type: [1],
      },
      {
        path: "葱白/050_分葱.jpg",
        type: [1],
      },
      {
        path: "葱白/070_香葱.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "葶苈子",
    files: [
      {
        path: "葶苈子/000_止咳药_葶苈子.jpg",
        type: [1],
      },
      {
        path: "葶苈子/010_播娘蒿植物.jpg",
        type: [1],
      },
      {
        path: "葶苈子/030_独行菜植物.jpg",
        type: [1],
      },
      {
        path: "葶苈子/050_葶苈子药材.jpg",
        type: [1],
      },
      {
        path: "葶苈子/070_南葶苈子.jpg",
        type: [1],
      },
      {
        path: "葶苈子/090_南葶苈子.jpg",
        type: [1],
      },
      {
        path: "葶苈子/110_葶苈子性状鉴别.jpg",
        type: [1],
      },
      {
        path: "葶苈子/130_北葶苈子.jpg",
        type: [1],
      },
      {
        path: "葶苈子/150_北葶苈子放大.jpg",
        type: [1],
      },
      {
        path: "葶苈子/170_A. 播娘蒿的种子　B. 独行菜的种子.jpg",
        type: [1],
      },
      {
        path: "葶苈子/190_伪品：菥蓂.jpg",
        type: [1],
      },
      {
        path: "葶苈子/210_菥蓂放大.jpg",
        type: [1],
      },
      {
        path: "葶苈子/230_芝麻菜的种子.jpg",
        type: [1],
      },
      {
        path: "葶苈子/250_炒葶苈子.jpg",
        type: [1],
      },
      {
        path: "葶苈子/270_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "蒲公英",
    files: [
      {
        path: "蒲公英/010_蒲公英植物.jpg",
        type: [1],
      },
      {
        path: "蒲公英/030_、碱地蒲公英植物.jpg",
        type: [1],
      },
      {
        path: "蒲公英/050_蒲公英药材.jpg",
        type: [1],
      },
      {
        path: "蒲公英/070_蒲公英药材.jpg",
        type: [1],
      },
      {
        path: "蒲公英/090_蒲公英.jpg",
        type: [1],
      },
      {
        path: "蒲公英/110_蒲公英性状鉴别.jpg",
        type: [1],
      },
      {
        path: "蒲公英/130_苣荬菜.jpg",
        type: [1],
      },
      {
        path: "蒲公英/150_蒲公英.jpg",
        type: [1],
      },
      {
        path: "蒲公英/170_苣荬菜.jpg",
        type: [1],
      },
      {
        path: "蒲公英/190_黄鹌菜.jpg",
        type: [1],
      },
      {
        path: "蒲公英/210_苦苣菜.jpg",
        type: [1],
      },
      {
        path: "蒲公英/230_蒲公英饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "蒲黄",
    files: [
      {
        path: "蒲黄/000_止血药_蒲黄.jpg",
        type: [1],
      },
      {
        path: "蒲黄/010_水烛香蒲植物.jpg",
        type: [1],
      },
      {
        path: "蒲黄/030_东方香蒲植物.jpg",
        type: [1],
      },
      {
        path: "蒲黄/050_蒲黄药材.jpg",
        type: [1],
      },
      {
        path: "蒲黄/070_蒲黄性状鉴别.jpg",
        type: [1],
      },
      {
        path: "蒲黄/090_蒲黄花粉粒显微.jpg",
        type: [1],
      },
      {
        path: "蒲黄/110_蒲黄.jpg",
        type: [1],
      },
      {
        path: "蒲黄/130_草蒲黄.jpg",
        type: [1],
      },
      {
        path: "蒲黄/150_蒲黄炭.jpg",
        type: [1],
      },
      {
        path: "蒲黄/170_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "蒴翟细叶",
    files: [
      {
        path: "蒴翟细叶/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "蒺藜",
    files: [
      {
        path: "蒺藜/000_平肝潜阳_刺蒺藜.jpg",
        type: [1],
      },
      {
        path: "蒺藜/010_蒺藜植物.jpg",
        type: [1],
      },
      {
        path: "蒺藜/030_蒺藜果实.jpg",
        type: [1],
      },
      {
        path: "蒺藜/050_蒺藜药材.jpg",
        type: [1],
      },
      {
        path: "蒺藜/070_蒺藜.jpg",
        type: [1],
      },
      {
        path: "蒺藜/090_蒺藜药材（分果瓣）.jpg",
        type: [1],
      },
      {
        path: "蒺藜/110_蒺藜性状鉴别.jpg",
        type: [1],
      },
      {
        path: "蒺藜/130_炒蒺藜.jpg",
        type: [1],
      },
      {
        path: "蒺藜/150_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "蓍实",
    files: [
      {
        path: "蓍实/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "蓍草",
    files: [
      {
        path: "蓍草/010_蓍植物.jpg",
        type: [1],
      },
      {
        path: "蓍草/030_蓍植物.jpg",
        type: [1],
      },
      {
        path: "蓍草/050_蓍草.jpg",
        type: [1],
      },
      {
        path: "蓍草/070_蓍草.jpg",
        type: [1],
      },
      {
        path: "蓍草/090_蓍草.jpg",
        type: [1],
      },
      {
        path: "蓍草/110_蓍草手绘图.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "蓖麻子",
    files: [
      {
        path: "蓖麻子/010_蓖麻植物.jpg",
        type: [1],
      },
      {
        path: "蓖麻子/030_蓖麻子.jpg",
        type: [1],
      },
      {
        path: "蓖麻子/050_蓖麻子.jpg",
        type: [1],
      },
      {
        path: "蓖麻子/070_蓖麻子.jpg",
        type: [1],
      },
      {
        path: "蓖麻子/090_蓖麻子.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "蓝布正",
    files: [
      {
        path: "蓝布正/010_路边青植物.jpg",
        type: [1],
      },
      {
        path: "蓝布正/030_柔毛路边青植物.jpg",
        type: [1],
      },
      {
        path: "蓝布正/050_蓝布正药材.jpg",
        type: [1],
      },
      {
        path: "蓝布正/070_蓝布正饮片.jpg",
        type: [1],
      },
      {
        path: "蓝布正/090_蓝布正饮片.jpg",
        type: [1],
      },
      {
        path: "蓝布正/110_蓝布正饮片.jpg",
        type: [1],
      },
      {
        path: "蓝布正/130_蓝布正饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "蓼大青叶",
    files: [
      {
        path: "蓼大青叶/010_蓼蓝植物.jpg",
        type: [1],
      },
      {
        path: "蓼大青叶/030_蓼大青叶药材.jpg",
        type: [1],
      },
      {
        path: "蓼大青叶/050_蓼大青叶.jpg",
        type: [1],
      },
      {
        path: "蓼大青叶/070_蓼大青叶.jpg",
        type: [1],
      },
      {
        path: "蓼大青叶/090_蓼大青叶.jpg",
        type: [1],
      },
      {
        path: "蓼大青叶/110_四种大青叶鉴别特征.jpg",
        type: [1],
      },
      {
        path: "蓼大青叶/130_蓼大青叶饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "蓼实",
    files: [
      {
        path: "蓼实/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "蔓椒",
    files: [
      {
        path: "蔓椒/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "蔓荆子",
    files: [
      {
        path: "蔓荆子/010_单叶蔓荆植物.jpg",
        type: [1],
      },
      {
        path: "蔓荆子/030_蔓荆植物.jpg",
        type: [1],
      },
      {
        path: "蔓荆子/050_蔓荆子药材.jpg",
        type: [1],
      },
      {
        path: "蔓荆子/070_蔓荆子.jpg",
        type: [1],
      },
      {
        path: "蔓荆子/090_蔓荆子放大.jpg",
        type: [1],
      },
      {
        path: "蔓荆子/110_蔓荆子性状鉴别.jpg",
        type: [1],
      },
      {
        path: "蔓荆子/130_倒地铃.jpg",
        type: [2],
      },
      {
        path: "蔓荆子/150_黄荆子.jpg",
        type: [2],
      },
      {
        path: "蔓荆子/170_炒蔓荆子.jpg",
        type: [1],
      },
      {
        path: "蔓荆子/190_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "蔷薇",
    files: [
      {
        path: "蔷薇/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "蔺茹",
    files: [
      {
        path: "蔺茹/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "蕤仁",
    files: [
      {
        path: "蕤仁/010_植物蕤核.jpg",
        type: [1],
      },
      {
        path: "蕤仁/030_齿叶扁核木植物.jpg",
        type: [1],
      },
      {
        path: "蕤仁/050_蕤仁药材.jpg",
        type: [1],
      },
      {
        path: "蕤仁/070_蕤仁药材.jpg",
        type: [1],
      },
      {
        path: "蕤仁/090_蕤仁.jpg",
        type: [1],
      },
      {
        path: "蕤仁/110_蕤仁果核.jpg",
        type: [1],
      },
      {
        path: "蕤仁/130_蕤仁药材.jpg",
        type: [1],
      },
      {
        path: "蕤仁/150_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "蕲蛇",
    files: [
      {
        path: "蕲蛇/010_五步蛇.jpg",
        type: [1],
      },
      {
        path: "蕲蛇/030_蕲蛇药材.jpg",
        type: [1],
      },
      {
        path: "蕲蛇/050_蕲蛇背面.jpg",
        type: [1],
      },
      {
        path: "蕲蛇/070_蕲蛇腹面.jpg",
        type: [1],
      },
      {
        path: "蕲蛇/090_蕲蛇方胜纹、连珠斑.jpg",
        type: [1],
      },
      {
        path: "蕲蛇/110_蕲蛇佛指甲.jpg",
        type: [1],
      },
      {
        path: "蕲蛇/130_蕲蛇翘鼻头.jpg",
        type: [1],
      },
      {
        path: "蕲蛇/150_蕲蛇性状鉴别.jpg",
        type: [1],
      },
      {
        path: "蕲蛇/170_蕲蛇与蕲蛇增重货头、颈部腹面对比.jpg",
        type: [1],
      },
      {
        path: "蕲蛇/190_蕲蛇正品与蕲蛇伪品（贴皮货）体部腹面对比.jpg",
        type: [1],
      },
      {
        path: "蕲蛇/210_蕲蛇正品与蕲蛇伪品（贴皮货）体部腹面对比.jpg",
        type: [1],
      },
      {
        path: "蕲蛇/230_蕲蛇正品与蕲蛇伪品（贴皮货）头、颈部腹面对比.jpg",
        type: [1],
      },
      {
        path: "蕲蛇/250_蕲蛇与圆斑蝰背部花纹对比.jpg",
        type: [1],
      },
      {
        path: "蕲蛇/270_左：蕲蛇正品，右：圆斑蝰     腹面对比.jpg",
        type: [1],
      },
      {
        path: "蕲蛇/290_蕲蛇段.jpg",
        type: [1],
      },
      {
        path: "蕲蛇/310_蕲蛇肉.jpg",
        type: [1],
      },
      {
        path: "蕲蛇/330_酒蕲蛇.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "薄荷",
    files: [
      {
        path: "薄荷/010_薄荷.jpg",
        type: [1],
      },
      {
        path: "薄荷/030_薄荷药材.jpg",
        type: [1],
      },
      {
        path: "薄荷/050_薄荷叶.jpg",
        type: [1],
      },
      {
        path: "薄荷/070_薄荷.jpg",
        type: [1],
      },
      {
        path: "薄荷/090_薄荷.jpg",
        type: [1],
      },
      {
        path: "薄荷/110_薄荷性状鉴别.jpg",
        type: [1],
      },
      {
        path: "薄荷/130_薄荷与伪品留兰香对比.jpg",
        type: [1],
      },
      {
        path: "薄荷/150_留兰香饮片.jpg",
        type: [1],
      },
      {
        path: "薄荷/170_薄荷饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "薏苡仁",
    files: [
      {
        path: "薏苡仁/000_利水渗湿药_薏苡仁.jpg",
        type: [1],
      },
      {
        path: "薏苡仁/010_薏米植物.jpg",
        type: [1],
      },
      {
        path: "薏苡仁/030_薏苡仁药材.jpg",
        type: [1],
      },
      {
        path: "薏苡仁/050_薏苡仁性状鉴别.jpg",
        type: [1],
      },
      {
        path: "薏苡仁/070_薏苡仁和草珠子对比.jpg",
        type: [1],
      },
      {
        path: "薏苡仁/090_薏苡仁和草珠子比较.jpg",
        type: [1],
      },
      {
        path: "薏苡仁/110_薏苡仁和草珠子比较.jpg",
        type: [1],
      },
      {
        path: "薏苡仁/130_伪品：白高梁.jpg",
        type: [2],
      },
      {
        path: "薏苡仁/150_麸炒薏苡仁.jpg",
        type: [1],
      },
      {
        path: "薏苡仁/170_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "薤白",
    files: [
      {
        path: "薤白/000_行气药_薤白.jpg",
        type: [1],
      },
      {
        path: "薤白/010_小根蒜植物.jpg",
        type: [1],
      },
      {
        path: "薤白/030_薤（藠头）植物.jpg",
        type: [1],
      },
      {
        path: "薤白/050_小根蒜药材.jpg",
        type: [1],
      },
      {
        path: "薤白/070_薤药材.jpg",
        type: [1],
      },
      {
        path: "薤白/090_小根蒜药材.jpg",
        type: [1],
      },
      {
        path: "薤白/110_薤药材.jpg",
        type: [1],
      },
      {
        path: "薤白/130_薤白性状鉴别.jpg",
        type: [1],
      },
      {
        path: "薤白/150_小根蒜与薤的区别.jpg",
        type: [1],
      },
      {
        path: "薤白/170_绵枣儿.jpg",
        type: [1],
      },
      {
        path: "薤白/190_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "藁本",
    files: [
      {
        path: "藁本/010_藁本植物.jpg",
        type: [1],
      },
      {
        path: "藁本/030_辽藁本植物.jpg",
        type: [1],
      },
      {
        path: "藁本/050_藁本药材.jpg",
        type: [1],
      },
      {
        path: "藁本/070_辽藁本药材.jpg",
        type: [1],
      },
      {
        path: "藁本/090_辽藁本药材.jpg",
        type: [1],
      },
      {
        path: "藁本/110_藁本药材.jpg",
        type: [1],
      },
      {
        path: "藁本/130_藁本饮片.jpg",
        type: [1],
      },
      {
        path: "藁本/150_藁本饮片.jpg",
        type: [1],
      },
      {
        path: "藁本/170_藁本性状鉴别.jpg",
        type: [1],
      },
      {
        path: "藁本/190_藁本与辽藁本的区别.jpg",
        type: [1],
      },
      {
        path: "藁本/210_水藁本.jpg",
        type: [1],
      },
      {
        path: "藁本/230_新疆藁本.jpg",
        type: [1],
      },
      {
        path: "藁本/250_新疆藁本.jpg",
        type: [1],
      },
      {
        path: "藁本/270_新疆藁本.jpg",
        type: [1],
      },
      {
        path: "藁本/290_山藁本.jpg",
        type: [1],
      },
      {
        path: "藁本/310_云藁本.jpg",
        type: [1],
      },
      {
        path: "藁本/330_黑藁本.jpg",
        type: [1],
      },
      {
        path: "藁本/350_细叶藁本.jpg",
        type: [1],
      },
      {
        path: "藁本/370_川芎.jpg",
        type: [1],
      },
      {
        path: "藁本/390_藁本片.jpg",
        type: [1],
      },
      {
        path: "藁本/410_辽藁本片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "藏菖蒲",
    files: [
      {
        path: "藏菖蒲/010_藏菖蒲植物.jpg",
        type: [1],
      },
      {
        path: "藏菖蒲/030_藏菖蒲.jpg",
        type: [1],
      },
      {
        path: "藏菖蒲/050_藏菖蒲.jpg",
        type: [1],
      },
      {
        path: "藏菖蒲/070_藏菖蒲.jpg",
        type: [1],
      },
      {
        path: "藏菖蒲/090_石菖蒲.jpg",
        type: [1],
      },
      {
        path: "藏菖蒲/110_岩白菜根茎.jpg",
        type: [1],
      },
      {
        path: "藏菖蒲/130_九节菖蒲.jpg",
        type: [1],
      },
      {
        path: "藏菖蒲/150_水菖蒲.jpg",
        type: [1],
      },
      {
        path: "藏菖蒲/170_石菖蒲与水菖蒲对比.jpg",
        type: [1],
      },
      {
        path: "藏菖蒲/190_左：水菖蒲 右：石菖蒲.jpg",
        type: [1],
      },
      {
        path: "藏菖蒲/210_藏菖蒲饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "藕节",
    files: [
      {
        path: "藕节/010_莲植物.jpg",
        type: [1],
      },
      {
        path: "藕节/030_藕带（根状茎）.jpg",
        type: [1],
      },
      {
        path: "藕节/050_藕.jpg",
        type: [1],
      },
      {
        path: "藕节/070_藕节药材.jpg",
        type: [1],
      },
      {
        path: "藕节/090_藕节药材.jpg",
        type: [1],
      },
      {
        path: "藕节/110_藕节.jpg",
        type: [1],
      },
      {
        path: "藕节/130_藕节饮片.jpg",
        type: [1],
      },
      {
        path: "藕节/150_藕节炭.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "藜芦",
    files: [
      {
        path: "藜芦/010_藜芦植物.jpg",
        type: [1],
      },
      {
        path: "藜芦/030_藜芦药材.jpg",
        type: [1],
      },
      {
        path: "藜芦/050_藜芦药材.jpg",
        type: [1],
      },
      {
        path: "藜芦/070_藜芦饮片.jpg",
        type: [1],
      },
      {
        path: "藜芦/090_金针莱.jpg",
        type: [1],
      },
      {
        path: "藜芦/110_藜芦饮片.jpg",
        type: [1],
      },
      {
        path: "藜芦/130_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "藿香",
    files: [
      {
        path: "藿香/010_藿香植物.jpg",
        type: [1],
      },
      {
        path: "藿香/030_藿香.jpg",
        type: [1],
      },
      {
        path: "藿香/050_藿香.jpg",
        type: [1],
      },
      {
        path: "藿香/070_藿香.jpg",
        type: [1],
      },
      {
        path: "藿香/090_藿香.jpg",
        type: [1],
      },
      {
        path: "藿香/110_藿香饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "蘼芜",
    files: [
      {
        path: "蘼芜/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "虎杖",
    files: [
      {
        path: "虎杖/010_虎杖植物.jpg",
        type: [1],
      },
      {
        path: "虎杖/030_虎杖药材.jpg",
        type: [1],
      },
      {
        path: "虎杖/050_虎杖药材.jpg",
        type: [1],
      },
      {
        path: "虎杖/070_虎杖饮片.jpg",
        type: [1],
      },
      {
        path: "虎杖/090_虎杖性状特征.jpg",
        type: [1],
      },
      {
        path: "虎杖/110_虎杖.jpg",
        type: [1],
      },
      {
        path: "虎杖/130_虎杖性状鉴别.jpg",
        type: [1],
      },
      {
        path: "虎杖/150_虎杖非药用部位茎部：茎部髓部中空较大，有膨大节部.jpg",
        type: [1],
      },
      {
        path: "虎杖/170_虎杖饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "虎耳草",
    files: [
      {
        path: "虎耳草/010_虎耳草.jpg",
        type: [1],
      },
      {
        path: "虎耳草/030_虎耳草药材.jpg",
        type: [1],
      },
      {
        path: "虎耳草/050_虎耳草药材.jpg",
        type: [1],
      },
      {
        path: "虎耳草/070_虎耳草药材.jpg",
        type: [1],
      },
      {
        path: "虎耳草/090_虎耳草饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "虫白蜡",
    files: [
      {
        path: "虫白蜡/010_白蜡虫.jpg",
        type: [1],
      },
      {
        path: "虫白蜡/030_虫白蜡.jpg",
        type: [1],
      },
      {
        path: "虫白蜡/050_虫白蜡药材.jpg",
        type: [1],
      },
      {
        path: "虫白蜡/070_虫白蜡性状鉴别.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "虻虫",
    files: [
      {
        path: "虻虫/010_复带虻.jpg",
        type: [1],
      },
      {
        path: "虻虫/030_虻虫药材.jpg",
        type: [1],
      },
      {
        path: "虻虫/050_虻虫药材.jpg",
        type: [1],
      },
      {
        path: "虻虫/070_虻虫药材.jpg",
        type: [1],
      },
      {
        path: "虻虫/090_虻虫.jpg",
        type: [1],
      },
      {
        path: "虻虫/110_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "虾蟆",
    files: [
      {
        path: "虾蟆/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "蚕沙",
    files: [
      {
        path: "蚕沙/010_家蚕.jpg",
        type: [1],
      },
      {
        path: "蚕沙/030_蚕沙.jpg",
        type: [1],
      },
      {
        path: "蚕沙/050_蚕沙药材.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "蚤休",
    files: [
      {
        path: "蚤休/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "蛇含",
    files: [
      {
        path: "蛇含/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "蛇床子",
    files: [
      {
        path: "蛇床子/000_功毒杀虫_蛇床子.jpg",
        type: [1],
      },
      {
        path: "蛇床子/010_蛇床植物.jpg",
        type: [1],
      },
      {
        path: "蛇床子/030_蛇床果序.jpg",
        type: [1],
      },
      {
        path: "蛇床子/050_蛇床子药材.jpg",
        type: [1],
      },
      {
        path: "蛇床子/070_蛇床子.jpg",
        type: [1],
      },
      {
        path: "蛇床子/090_蛇床子性状鉴别.jpg",
        type: [1],
      },
      {
        path: "蛇床子/110_伪品：芹菜籽.jpg",
        type: [2],
      },
      {
        path: "蛇床子/130_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "蛇莓",
    files: [
      {
        path: "蛇莓/010_蛇莓植物.jpg",
        type: [1],
      },
      {
        path: "蛇莓/030_蛇莓.jpg",
        type: [1],
      },
      {
        path: "蛇莓/050_蛇莓.jpg",
        type: [1],
      },
      {
        path: "蛇莓/070_蛇莓.jpg",
        type: [1],
      },
      {
        path: "蛇莓/090_蛇莓饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "蛇蜕",
    files: [
      {
        path: "蛇蜕/010_蛇蜕药材.jpg",
        type: [1],
      },
      {
        path: "蛇蜕/030_蛇蜕药材.jpg",
        type: [1],
      },
      {
        path: "蛇蜕/050_蛇蜕性状鉴别.jpg",
        type: [1],
      },
      {
        path: "蛇蜕/070_蛇蜕饮片.jpg",
        type: [1],
      },
      {
        path: "蛇蜕/090_酒蛇蜕.jpg",
        type: [1],
      },
      {
        path: "蛇蜕/110_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "蛞蝓",
    files: [
      {
        path: "蛞蝓/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "蛤壳",
    files: [
      {
        path: "蛤壳/010_文蛤.jpg",
        type: [1],
      },
      {
        path: "蛤壳/030_青蛤.jpg",
        type: [1],
      },
      {
        path: "蛤壳/050_文蛤.jpg",
        type: [1],
      },
      {
        path: "蛤壳/070_青蛤.jpg",
        type: [1],
      },
      {
        path: "蛤壳/090_蛤壳药材（ 文蛤）.jpg",
        type: [1],
      },
      {
        path: "蛤壳/110_蛤壳(文蛤).jpg",
        type: [1],
      },
      {
        path: "蛤壳/130_蛤壳(青蛤).jpg",
        type: [1],
      },
      {
        path: "蛤壳/150_蛤壳性状鉴别.jpg",
        type: [1],
      },
      {
        path: "蛤壳/170_蛤壳及混伪品性状比较.jpg",
        type: [1],
      },
      {
        path: "蛤壳/190_蛤壳饮片.jpg",
        type: [1],
      },
      {
        path: "蛤壳/210_煅蛤壳.jpg",
        type: [1],
      },
      {
        path: "蛤壳/230_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "蛤蚧",
    files: [
      {
        path: "蛤蚧/010_蛤蚧.jpg",
        type: [1],
      },
      {
        path: "蛤蚧/030_蛤蚧药材.jpg",
        type: [1],
      },
      {
        path: "蛤蚧/050_蛤蚧.jpg",
        type: [1],
      },
      {
        path: "蛤蚧/070_蛤蚧.jpg",
        type: [1],
      },
      {
        path: "蛤蚧/090_蛤蚧性状鉴别.jpg",
        type: [1],
      },
      {
        path: "蛤蚧/110_壁虎.jpg",
        type: [1],
      },
      {
        path: "蛤蚧/130_多疣壁虎.jpg",
        type: [1],
      },
      {
        path: "蛤蚧/150_蜡皮蜥.jpg",
        type: [1],
      },
      {
        path: "蛤蚧/170_喜山鬣蜥.jpg",
        type: [1],
      },
      {
        path: "蛤蚧/190_红瘰疣螈.jpg",
        type: [1],
      },
      {
        path: "蛤蚧/210_伪品：脸虎.jpg",
        type: [1],
      },
      {
        path: "蛤蚧/230_蛤蚧.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "蛴螬",
    files: [
      {
        path: "蛴螬/010_华北大黑鳃金龟昆虫.jpg",
        type: [1],
      },
      {
        path: "蛴螬/030_蛴螬药材.jpg",
        type: [1],
      },
      {
        path: "蛴螬/050_蛴螬药材.jpg",
        type: [1],
      },
      {
        path: "蛴螬/070_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "蛹虫草（北虫草）",
    files: [
      {
        path: "蛹虫草（北虫草）/010_蛹虫草.jpg",
        type: [1],
      },
      {
        path: "蛹虫草（北虫草）/030_蛹虫草.jpg",
        type: [1],
      },
      {
        path: "蛹虫草（北虫草）/050_蛹虫草药材.jpg",
        type: [1],
      },
      {
        path: "蛹虫草（北虫草）/070_蛹虫草药材.jpg",
        type: [1],
      },
      {
        path: "蛹虫草（北虫草）/090_蛹虫草药材.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "蜂房",
    files: [
      {
        path: "蜂房/000_功毒杀虫_蜂房.jpg",
        type: [1],
      },
      {
        path: "蜂房/010_果马蜂.jpg",
        type: [1],
      },
      {
        path: "蜂房/030_日本长脚胡蜂.jpg",
        type: [1],
      },
      {
        path: "蜂房/050_异腹胡蜂.jpg",
        type: [1],
      },
      {
        path: "蜂房/070_蜂房药材.jpg",
        type: [1],
      },
      {
        path: "蜂房/090_蜂房药材.jpg",
        type: [1],
      },
      {
        path: "蜂房/110_蜂房.jpg",
        type: [1],
      },
      {
        path: "蜂房/130_蜂房剥离单体的房.jpg",
        type: [1],
      },
      {
        path: "蜂房/150_伪品硬蜂房.jpg",
        type: [1],
      },
      {
        path: "蜂房/170_伪品硬蜂房.jpg",
        type: [1],
      },
      {
        path: "蜂房/190_伪品硬蜂房.jpg",
        type: [1],
      },
      {
        path: "蜂房/210_蜂房水泥增重.jpg",
        type: [1],
      },
      {
        path: "蜂房/230_蜂房与山蜂房.jpg",
        type: [1],
      },
      {
        path: "蜂房/250_蜂房饮片.jpg",
        type: [1],
      },
      {
        path: "蜂房/270_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "蜂胶",
    files: [
      {
        path: "蜂胶/010_意大利蜂昆虫.jpg",
        type: [1],
      },
      {
        path: "蜂胶/030_蜂胶.jpg",
        type: [1],
      },
      {
        path: "蜂胶/050_蜂胶.jpg",
        type: [1],
      },
      {
        path: "蜂胶/070_蜂胶.jpg",
        type: [1],
      },
      {
        path: "蜂胶/090_蜂胶.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "蜂蜜",
    files: [
      {
        path: "蜂蜜/000_补虚药_蜂蜜.jpg",
        type: [1],
      },
      {
        path: "蜂蜜/010_中华蜜蜂昆虫.jpg",
        type: [1],
      },
      {
        path: "蜂蜜/030_或意大利蜂昆虫.jpg",
        type: [1],
      },
      {
        path: "蜂蜜/050_中华蜂和意大利蜂的对比图，左侧中华蜂体型明显偏小.jpg",
        type: [1],
      },
      {
        path: "蜂蜜/070_蜂蜜.jpg",
        type: [1],
      },
      {
        path: "蜂蜜/090_蜂蜜.jpg",
        type: [1],
      },
      {
        path: "蜂蜜/110_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "蜂蜡",
    files: [
      {
        path: "蜂蜡/010_中华蜜蜂昆虫.jpg",
        type: [1],
      },
      {
        path: "蜂蜡/030_或意大利蜂昆虫.jpg",
        type: [1],
      },
      {
        path: "蜂蜡/050_中华蜂和意大利蜂的对比图，左侧中华蜂体型明显偏小.jpg",
        type: [1],
      },
      {
        path: "蜂蜡/070_蜂蜡.jpg",
        type: [1],
      },
      {
        path: "蜂蜡/090_蜂蜡.jpg",
        type: [1],
      },
      {
        path: "蜂蜡/110_蜂蜡.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "蜈蚣",
    files: [
      {
        path: "蜈蚣/000_熄风止痉药_蜈蚣.jpg",
        type: [1],
      },
      {
        path: "蜈蚣/010_少棘巨蜈蚣.jpg",
        type: [1],
      },
      {
        path: "蜈蚣/030_蜈蚣药材.jpg",
        type: [1],
      },
      {
        path: "蜈蚣/050_蜈蚣性状鉴别.jpg",
        type: [1],
      },
      {
        path: "蜈蚣/070_进口蜈蚣，非药典品.jpg",
        type: [1],
      },
      {
        path: "蜈蚣/090_广西大条蜈蚣与湖北蜈蚣对比.jpg",
        type: [1],
      },
      {
        path: "蜈蚣/110_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "蜘蛛",
    files: [
      {
        path: "蜘蛛/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "蜘蛛香",
    files: [
      {
        path: "蜘蛛香/010_蜘蛛香植物.jpg",
        type: [1],
      },
      {
        path: "蜘蛛香/030_蜘蛛香植物.jpg",
        type: [1],
      },
      {
        path: "蜘蛛香/050_蜘蛛香.jpg",
        type: [1],
      },
      {
        path: "蜘蛛香/070_蜘蛛香.jpg",
        type: [1],
      },
      {
        path: "蜘蛛香/090_蜘蛛香.jpg",
        type: [1],
      },
      {
        path: "蜘蛛香/110_蜘蛛香饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "蜜蜡",
    files: [
      {
        path: "蜜蜡/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "蜣螂",
    files: [
      {
        path: "蜣螂/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "蜥蜴",
    files: [
      {
        path: "蜥蜴/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "蝉花",
    files: [
      {
        path: "蝉花/010_蝉花.jpg",
        type: [1],
      },
      {
        path: "蝉花/030_蝉花药材.jpg",
        type: [1],
      },
      {
        path: "蝉花/050_蝉花药材.jpg",
        type: [1],
      },
      {
        path: "蝉花/070_蝉花药材.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "蝉蜕",
    files: [
      {
        path: "蝉蜕/010_黑蚱.jpg",
        type: [1],
      },
      {
        path: "蝉蜕/030_黑蚱正在羽化.jpg",
        type: [1],
      },
      {
        path: "蝉蜕/050_蝉蜕药材.jpg",
        type: [1],
      },
      {
        path: "蝉蜕/070_蝉蜕药材.jpg",
        type: [1],
      },
      {
        path: "蝉蜕/090_蝉蜕.jpg",
        type: [1],
      },
      {
        path: "蝉蜕/110_蝉蜕性状鉴别.jpg",
        type: [1],
      },
      {
        path: "蝉蜕/130_蝉蜕侧面.jpg",
        type: [1],
      },
      {
        path: "蝉蜕/150_蝉蜕.jpg",
        type: [1],
      },
      {
        path: "蝉蜕/170_劣药 掺有泥土.jpg",
        type: [1],
      },
      {
        path: "蝉蜕/190_劣药 掺泥土后挂胶.jpg",
        type: [1],
      },
      {
        path: "蝉蜕/210_蝉蜕.jpg",
        type: [1],
      },
      {
        path: "蝉蜕/230_伪品 金蝉衣.jpg",
        type: [1],
      },
      {
        path: "蝉蜕/250_伪品 金蝉衣挂胶.jpg",
        type: [1],
      },
      {
        path: "蝉蜕/270_伪品 蟪蛄.jpg",
        type: [1],
      },
      {
        path: "蝉蜕/290_蝉蜕与易混品.jpg",
        type: [1],
      },
      {
        path: "蝉蜕/310_蝉蜕棕红色-棕黄色-蟪蛄_-金蝉衣.jpg",
        type: [1],
      },
      {
        path: "蝉蜕/330_蝉蜕.jpg",
        type: [1],
      },
      {
        path: "蝉蜕/350_金蝉蜕.jpg",
        type: [1],
      },
      {
        path: "蝉蜕/370_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "蝙蝠",
    files: [
      {
        path: "蝙蝠/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "蝼蛄",
    files: [
      {
        path: "蝼蛄/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "螃蟹",
    files: [
      {
        path: "螃蟹/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "蟑螂",
    files: [
      {
        path: "蟑螂/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "蟾酥",
    files: [
      {
        path: "蟾酥/010_中华大蟾蜍.jpg",
        type: [1],
      },
      {
        path: "蟾酥/030_黑眶蟾蜍.jpg",
        type: [1],
      },
      {
        path: "蟾酥/050_蟾酥药材.jpg",
        type: [1],
      },
      {
        path: "蟾酥/070_蟾酥（扁圆型块状）.jpg",
        type: [1],
      },
      {
        path: "蟾酥/090_蟾酥（片状）.jpg",
        type: [1],
      },
      {
        path: "蟾酥/110_断面水试鉴别.jpg",
        type: [1],
      },
      {
        path: "蟾酥/130_蟾酥团酥鉴别.jpg",
        type: [1],
      },
      {
        path: "蟾酥/150_伪品.jpg",
        type: [1],
      },
      {
        path: "蟾酥/170_蟾酥粉.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "蠡实",
    files: [
      {
        path: "蠡实/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "血余炭",
    files: [
      {
        path: "血余炭/000_止血药_血余炭.jpg",
        type: [1],
      },
      {
        path: "血余炭/010_人发.jpg",
        type: [1],
      },
      {
        path: "血余炭/030_血余炭.jpg",
        type: [1],
      },
      {
        path: "血余炭/050_血余炭.jpg",
        type: [1],
      },
      {
        path: "血余炭/070_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "血竭",
    files: [
      {
        path: "血竭/010_麒麟竭植物.jpg",
        type: [1],
      },
      {
        path: "血竭/030_血竭药材.jpg",
        type: [1],
      },
      {
        path: "血竭/050_血竭药材.jpg",
        type: [1],
      },
      {
        path: "血竭/070_血竭性状鉴别.jpg",
        type: [1],
      },
      {
        path: "血竭/090_正品血竭.jpg",
        type: [1],
      },
      {
        path: "血竭/110_血竭伪品.jpg",
        type: [1],
      },
      {
        path: "血竭/130_龙血竭.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "衣鱼",
    files: [
      {
        path: "衣鱼/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "补骨脂",
    files: [
      {
        path: "补骨脂/010_补骨脂.jpg",
        type: [1],
      },
      {
        path: "补骨脂/030_补骨脂药材.jpg",
        type: [1],
      },
      {
        path: "补骨脂/050_补骨脂.jpg",
        type: [1],
      },
      {
        path: "补骨脂/070_补骨脂性状鉴别.jpg",
        type: [1],
      },
      {
        path: "补骨脂/090_补骨脂表面放大.jpg",
        type: [1],
      },
      {
        path: "补骨脂/110_曼陀罗子.jpg",
        type: [1],
      },
      {
        path: "补骨脂/130_盐补骨脂.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "裸花紫珠",
    files: [
      {
        path: "裸花紫珠/010_裸花紫珠植物.jpg",
        type: [1],
      },
      {
        path: "裸花紫珠/030_裸花紫珠.jpg",
        type: [1],
      },
      {
        path: "裸花紫珠/050_裸花紫珠.jpg",
        type: [1],
      },
      {
        path: "裸花紫珠/070_大叶紫珠.jpg",
        type: [1],
      },
      {
        path: "裸花紫珠/090_紫珠叶.jpg",
        type: [1],
      },
      {
        path: "裸花紫珠/110_六种紫珠检索表.jpg",
        type: [1],
      },
      {
        path: "裸花紫珠/130_六种紫珠性状比较.jpg",
        type: [1],
      },
      {
        path: "裸花紫珠/150_六种紫珠性状比较.jpg",
        type: [1],
      },
      {
        path: "裸花紫珠/170_六种紫珠性状比较.jpg",
        type: [1],
      },
      {
        path: "裸花紫珠/190_六种紫珠性状比较.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "西河柳",
    files: [
      {
        path: "西河柳/010_柽柳.jpg",
        type: [1],
      },
      {
        path: "西河柳/030_西河柳药材.jpg",
        type: [1],
      },
      {
        path: "西河柳/050_西河柳药材.jpg",
        type: [1],
      },
      {
        path: "西河柳/070_西河柳药材.jpg",
        type: [1],
      },
      {
        path: "西河柳/090_西河柳饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "西洋参",
    files: [
      {
        path: "西洋参/010_西洋参植物.jpg",
        type: [1],
      },
      {
        path: "西洋参/030_西洋参植物.jpg",
        type: [1],
      },
      {
        path: "西洋参/050_西洋参药材.jpg",
        type: [1],
      },
      {
        path: "西洋参/070_西洋参饮片.jpg",
        type: [1],
      },
      {
        path: "西洋参/090_不同产地西洋参性状.jpg",
        type: [1],
      },
      {
        path: "西洋参/110_不同加工西洋参.jpg",
        type: [1],
      },
      {
        path: "西洋参/130_西洋参与人参的鉴别.jpg",
        type: [1],
      },
      {
        path: "西洋参/150_西洋参的贮存.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "西瓜皮",
    files: [
      {
        path: "西瓜皮/010_西瓜植物.jpg",
        type: [1],
      },
      {
        path: "西瓜皮/030_西瓜皮.jpg",
        type: [1],
      },
      {
        path: "西瓜皮/050_西瓜皮.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "西瓜霜",
    files: [
      {
        path: "西瓜霜/010_西瓜植物.jpg",
        type: [1],
      },
      {
        path: "西瓜霜/030_西瓜霜.jpg",
        type: [1],
      },
      {
        path: "西瓜霜/050_西瓜霜.jpg",
        type: [1],
      },
      {
        path: "西瓜霜/070_西瓜霜.jpg",
        type: [1],
      },
      {
        path: "西瓜霜/090_西瓜霜.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "西红花",
    files: [
      {
        path: "西红花/010_西红花植物.jpg",
        type: [1],
      },
      {
        path: "西红花/030_西红花药材.jpg",
        type: [1],
      },
      {
        path: "西红花/050_西红花剖面图.jpg",
        type: [1],
      },
      {
        path: "西红花/070_西红花放大图.jpg",
        type: [1],
      },
      {
        path: "西红花/090_红花放大图.jpg",
        type: [1],
      },
      {
        path: "西红花/110_西红花掺杂.jpg",
        type: [1],
      },
      {
        path: "西红花/130_制伪西红花水试.jpg",
        type: [1],
      },
      {
        path: "西红花/150_制伪西红花.jpg",
        type: [1],
      },
      {
        path: "西红花/170_海带丝伪制.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "西青果",
    files: [
      {
        path: "西青果/010_诃子植物.jpg",
        type: [1],
      },
      {
        path: "西青果/030_西青果药材.jpg",
        type: [1],
      },
      {
        path: "西青果/050_青果.jpg",
        type: [1],
      },
      {
        path: "西青果/070_西青果.jpg",
        type: [1],
      },
      {
        path: "西青果/090_西青果饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "覆盆子",
    files: [
      {
        path: "覆盆子/000_收涩药_覆盆子.jpg",
        type: [1],
      },
      {
        path: "覆盆子/010_华东覆盆子植物.jpg",
        type: [1],
      },
      {
        path: "覆盆子/030_覆盆子药材.jpg",
        type: [1],
      },
      {
        path: "覆盆子/050_覆盆子性状鉴别.jpg",
        type: [1],
      },
      {
        path: "覆盆子/070_覆盆子小果放大.jpg",
        type: [1],
      },
      {
        path: "覆盆子/090_蓬蘽植物.jpg",
        type: [1],
      },
      {
        path: "覆盆子/110_覆盆子、蓬蘽对比.jpg",
        type: [1],
      },
      {
        path: "覆盆子/130_蓬蘽.jpg",
        type: [1],
      },
      {
        path: "覆盆子/150_覆盆子、蓬蘽小果对比.jpg",
        type: [1],
      },
      {
        path: "覆盆子/170_山莓.jpg",
        type: [1],
      },
      {
        path: "覆盆子/190_覆盆子、山莓小果对比.jpg",
        type: [1],
      },
      {
        path: "覆盆子/210_覆盆子、蓬蘽、山莓对比.jpg",
        type: [1],
      },
      {
        path: "覆盆子/230_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "诃子",
    files: [
      {
        path: "诃子/000_收涩药_诃子.jpg",
        type: [1],
      },
      {
        path: "诃子/010_诃子植物.jpg",
        type: [1],
      },
      {
        path: "诃子/030_绒毛诃子植物.jpg",
        type: [1],
      },
      {
        path: "诃子/050_诃子药材.jpg",
        type: [1],
      },
      {
        path: "诃子/070_诃子.jpg",
        type: [1],
      },
      {
        path: "诃子/090_诃子性状鉴别.jpg",
        type: [1],
      },
      {
        path: "诃子/110_青果.jpg",
        type: [1],
      },
      {
        path: "诃子/130_毛诃子.jpg",
        type: [1],
      },
      {
        path: "诃子/150_诃子肉.jpg",
        type: [1],
      },
      {
        path: "诃子/170_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "谷精草",
    files: [
      {
        path: "谷精草/010_谷精草植物.jpg",
        type: [1],
      },
      {
        path: "谷精草/030_谷精草药材.jpg",
        type: [1],
      },
      {
        path: "谷精草/050_谷精草性状鉴别.jpg",
        type: [1],
      },
      {
        path: "谷精草/070_谷精草.jpg",
        type: [1],
      },
      {
        path: "谷精草/090_谷精珠.jpg",
        type: [1],
      },
      {
        path: "谷精草/110_谷精草.jpg",
        type: [1],
      },
      {
        path: "谷精草/130_谷精珠.jpg",
        type: [1],
      },
      {
        path: "谷精草/150_赛谷精草.jpg",
        type: [1],
      },
      {
        path: "谷精草/170_赛谷精草.jpg",
        type: [1],
      },
      {
        path: "谷精草/190_华南谷精草.jpg",
        type: [1],
      },
      {
        path: "谷精草/210_毛谷精草.jpg",
        type: [1],
      },
      {
        path: "谷精草/230_蚤缀.jpg",
        type: [1],
      },
      {
        path: "谷精草/250_谷精草饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "谷芽",
    files: [
      {
        path: "谷芽/010_粟植物.jpg",
        type: [1],
      },
      {
        path: "谷芽/030_粟.jpg",
        type: [1],
      },
      {
        path: "谷芽/050_谷芽药材.jpg",
        type: [1],
      },
      {
        path: "谷芽/070_谷芽.jpg",
        type: [1],
      },
      {
        path: "谷芽/090_谷芽性状鉴别.jpg",
        type: [1],
      },
      {
        path: "谷芽/110_谷芽性状.jpg",
        type: [1],
      },
      {
        path: "谷芽/130_稻芽.jpg",
        type: [1],
      },
      {
        path: "谷芽/150_炒谷芽.jpg",
        type: [1],
      },
      {
        path: "谷芽/170_焦谷芽.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "豆蔻",
    files: [
      {
        path: "豆蔻/010_白豆蔻植物.jpg",
        type: [1],
      },
      {
        path: "豆蔻/030_爪哇白豆蔻植物.jpg",
        type: [1],
      },
      {
        path: "豆蔻/050_豆蔻.jpg",
        type: [1],
      },
      {
        path: "豆蔻/070_豆蔻药材.jpg",
        type: [1],
      },
      {
        path: "豆蔻/090_豆蔻药材.jpg",
        type: [1],
      },
      {
        path: "豆蔻/110_豆蔻性状鉴别.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "豚卵",
    files: [
      {
        path: "豚卵/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "豨莶草",
    files: [
      {
        path: "豨莶草/010_豨莶.jpg",
        type: [1],
      },
      {
        path: "豨莶草/030_腺梗豨莶.jpg",
        type: [1],
      },
      {
        path: "豨莶草/050_毛梗豨莶.jpg",
        type: [1],
      },
      {
        path: "豨莶草/070_豨莶草.jpg",
        type: [1],
      },
      {
        path: "豨莶草/090_豨莶草药材.jpg",
        type: [1],
      },
      {
        path: "豨莶草/110_豨莶草（腺梗）.jpg",
        type: [1],
      },
      {
        path: "豨莶草/130_豨莶草（毛梗）.jpg",
        type: [1],
      },
      {
        path: "豨莶草/150_豨莶草性状鉴别.jpg",
        type: [1],
      },
      {
        path: "豨莶草/170_豨莶草性状鉴别.jpg",
        type: [1],
      },
      {
        path: "豨莶草/190_豨莶草.jpg",
        type: [1],
      },
      {
        path: "豨莶草/210_防风草.jpg",
        type: [1],
      },
      {
        path: "豨莶草/230_豨莶草与伪品苍耳比较.jpg",
        type: [1],
      },
      {
        path: "豨莶草/250_豨莶草饮片.jpg",
        type: [1],
      },
      {
        path: "豨莶草/270_酒豨莶草.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "贝齿",
    files: [
      {
        path: "贝齿/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "败酱草",
    files: [
      {
        path: "败酱草/000_清热药_败酱草.jpg",
        type: [1],
      },
      {
        path: "败酱草/010_黄花败酱.jpg",
        type: [1],
      },
      {
        path: "败酱草/030_白花败酱.jpg",
        type: [1],
      },
      {
        path: "败酱草/050_黄花败酱.jpg",
        type: [1],
      },
      {
        path: "败酱草/070_黄花败酱.jpg",
        type: [1],
      },
      {
        path: "败酱草/090_白花败酱.jpg",
        type: [1],
      },
      {
        path: "败酱草/110_白花败酱.jpg",
        type: [1],
      },
      {
        path: "败酱草/130_败酱草.jpg",
        type: [1],
      },
      {
        path: "败酱草/150_菥蓂.jpg",
        type: [1],
      },
      {
        path: "败酱草/170_苦菜.jpg",
        type: [1],
      },
      {
        path: "败酱草/190_长裂苦苣菜.jpg",
        type: [1],
      },
      {
        path: "败酱草/210_苏败酱.jpg",
        type: [1],
      },
      {
        path: "败酱草/230_苣荬菜.jpg",
        type: [1],
      },
      {
        path: "败酱草/250_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "贯众",
    files: [
      {
        path: "贯众/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "贯叶金丝桃",
    files: [
      {
        path: "贯叶金丝桃/010_贯叶金丝桃植物.jpg",
        type: [1],
      },
      {
        path: "贯叶金丝桃/030_贯叶金丝桃药材.jpg",
        type: [1],
      },
      {
        path: "贯叶金丝桃/050_贯叶金丝桃饮片.jpg",
        type: [1],
      },
      {
        path: "贯叶金丝桃/070_贯叶金丝桃饮片.jpg",
        type: [1],
      },
      {
        path: "贯叶金丝桃/090_贯叶金丝桃饮片.jpg",
        type: [1],
      },
      {
        path: "贯叶金丝桃/110_贯叶金丝桃.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "赤小豆",
    files: [
      {
        path: "赤小豆/010_赤小豆植物.jpg",
        type: [1],
      },
      {
        path: "赤小豆/030_赤小豆.jpg",
        type: [1],
      },
      {
        path: "赤小豆/050_赤豆植物.jpg",
        type: [1],
      },
      {
        path: "赤小豆/070_赤豆.jpg",
        type: [1],
      },
      {
        path: "赤小豆/090_赤小豆.jpg",
        type: [1],
      },
      {
        path: "赤小豆/110_赤小豆，呈长圆形而稍扃，表面紫红色，无光泽或微有光泽，线形突起的种脐.jpg",
        type: [1],
      },
      {
        path: "赤小豆/130_赤豆药材.jpg",
        type: [1],
      },
      {
        path: "赤小豆/150_赤豆 呈短圆柱形，表面暗棕红色，有光泽，种脐不突起.jpg",
        type: [1],
      },
      {
        path: "赤小豆/170_赤小豆性状鉴别.jpg",
        type: [1],
      },
      {
        path: "赤小豆/190_左赤豆，右赤小豆.jpg",
        type: [1],
      },
      {
        path: "赤小豆/210_赤小豆.jpg",
        type: [1],
      },
      {
        path: "赤小豆/230_相思子.jpg",
        type: [1],
      },
      {
        path: "赤小豆/250_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "赤石脂",
    files: [
      {
        path: "赤石脂/000_收涩药_赤石脂.jpg",
        type: [1],
      },
      {
        path: "赤石脂/010_多水高岭石.jpg",
        type: [1],
      },
      {
        path: "赤石脂/030_赤石脂药材.jpg",
        type: [1],
      },
      {
        path: "赤石脂/050_赤石脂药材.jpg",
        type: [1],
      },
      {
        path: "赤石脂/070_赤石脂药材.jpg",
        type: [1],
      },
      {
        path: "赤石脂/090_煅赤石脂.jpg",
        type: [1],
      },
      {
        path: "赤石脂/110_煅赤石脂.jpg",
        type: [1],
      },
      {
        path: "赤石脂/130_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "赤芍",
    files: [
      {
        path: "赤芍/000_清热药_赤芍.jpg",
        type: [1],
      },
      {
        path: "赤芍/000_清热药_赤芍2.jpg",
        type: [1],
      },
      {
        path: "赤芍/000_补虚药_白芍.jpg",
        type: [1],
      },
      {
        path: "赤芍/010_芍药植物.jpg",
        type: [1],
      },
      {
        path: "赤芍/030_川赤芍植物.jpg",
        type: [1],
      },
      {
        path: "赤芍/050_赤芍药材.jpg",
        type: [1],
      },
      {
        path: "赤芍/070_川赤芍药材.jpg",
        type: [1],
      },
      {
        path: "赤芍/090_赤芍性状鉴别.jpg",
        type: [1],
      },
      {
        path: "赤芍/110_白芍与赤芍对比.jpg",
        type: [1],
      },
      {
        path: "赤芍/130_赤芍非药典品：产地新疆.jpg",
        type: [1],
      },
      {
        path: "赤芍/150_美丽芍药鲜根.jpg",
        type: [1],
      },
      {
        path: "赤芍/170_块根芍药.jpg",
        type: [1],
      },
      {
        path: "赤芍/190_草芍药.jpg",
        type: [1],
      },
      {
        path: "赤芍/210_伪制品地榆片.jpg",
        type: [1],
      },
      {
        path: "赤芍/230_赤芍饮片.jpg",
        type: [1],
      },
      {
        path: "赤芍/250_川赤芍饮片.jpg",
        type: [1],
      },
      {
        path: "赤芍/270_炒赤芍饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "赭石",
    files: [
      {
        path: "赭石/000_平肝潜阳_代赭石.jpg",
        type: [1],
      },
      {
        path: "赭石/000_平肝潜阳_代赭石2.jpg",
        type: [1],
      },
      {
        path: "赭石/010_赤铁矿.jpg",
        type: [1],
      },
      {
        path: "赭石/030_赭石药材.jpg",
        type: [1],
      },
      {
        path: "赭石/050_赭石药材.jpg",
        type: [1],
      },
      {
        path: "赭石/070_赭石药材.jpg",
        type: [1],
      },
      {
        path: "赭石/090_赭石性状鉴别.jpg",
        type: [1],
      },
      {
        path: "赭石/110_煅赭石.jpg",
        type: [1],
      },
      {
        path: "赭石/130_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "路路通",
    files: [
      {
        path: "路路通/010_枫香树植物.jpg",
        type: [1],
      },
      {
        path: "路路通/030_路路通药材.jpg",
        type: [1],
      },
      {
        path: "路路通/050_路路通.jpg",
        type: [1],
      },
      {
        path: "路路通/070_路路通性状鉴别.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "车前子",
    files: [
      {
        path: "车前子/000_利水渗湿药_车前子.jpg",
        type: [1],
      },
      {
        path: "车前子/010_车前植物.jpg",
        type: [1],
      },
      {
        path: "车前子/030_平车前植物.jpg",
        type: [1],
      },
      {
        path: "车前子/050_车前子药材.jpg",
        type: [1],
      },
      {
        path: "车前子/070_大粒车前.jpg",
        type: [1],
      },
      {
        path: "车前子/090_小粒车前.jpg",
        type: [1],
      },
      {
        path: "车前子/110_车前子性状鉴别（“开眼”指车前子稍凸的一面中部有的一个灰白色的小圆点，为种脐。）.jpg",
        type: [1],
      },
      {
        path: "车前子/130_大粒车前与小粒车前.jpg",
        type: [1],
      },
      {
        path: "车前子/150_A. 车前的种子　B. 平车前的种子.jpg",
        type: [1],
      },
      {
        path: "车前子/170_车前子伪品（地肤子除去外皮种子）.jpg",
        type: [2],
      },
      {
        path: "车前子/190_车前子掺伪（掺有柴胡种子）.jpg",
        type: [2],
      },
      {
        path: "车前子/210_车前子伪品（柴胡种子）.jpg",
        type: [2],
      },
      {
        path: "车前子/230_车前子伪品（荆芥子）.jpg",
        type: [2],
      },
      {
        path: "车前子/250_左地夫右荆芥下小粒车前.jpg",
        type: [2],
      },
      {
        path: "车前子/270_盐车前子.jpg",
        type: [1],
      },
      {
        path: "车前子/290_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "车前草",
    files: [
      {
        path: "车前草/010_车前植物.jpg",
        type: [1],
      },
      {
        path: "车前草/030_车前根.jpg",
        type: [1],
      },
      {
        path: "车前草/050_平车前植物.jpg",
        type: [1],
      },
      {
        path: "车前草/070_平车前根.jpg",
        type: [1],
      },
      {
        path: "车前草/090_车前.jpg",
        type: [1],
      },
      {
        path: "车前草/110_平车前.jpg",
        type: [1],
      },
      {
        path: "车前草/130_车前草药材.jpg",
        type: [1],
      },
      {
        path: "车前草/150_车前草.jpg",
        type: [1],
      },
      {
        path: "车前草/170_平车前草.jpg",
        type: [1],
      },
      {
        path: "车前草/190_车前草性状鉴别.jpg",
        type: [1],
      },
      {
        path: "车前草/210_车前草性状鉴别.jpg",
        type: [1],
      },
      {
        path: "车前草/230_车前草饮片.jpg",
        type: [1],
      },
      {
        path: "车前草/250_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "轻粉",
    files: [
      {
        path: "轻粉/010_轻粉药材.jpg",
        type: [1],
      },
      {
        path: "轻粉/030_轻粉药材.jpg",
        type: [1],
      },
      {
        path: "轻粉/050_伪品轻粉：糖精制作.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "辛夷",
    files: [
      {
        path: "辛夷/010_望春花植物.jpg",
        type: [1],
      },
      {
        path: "辛夷/030_玉兰植物.jpg",
        type: [1],
      },
      {
        path: "辛夷/050_武当玉兰.jpg",
        type: [1],
      },
      {
        path: "辛夷/070_辛夷（望春花）.jpg",
        type: [1],
      },
      {
        path: "辛夷/090_辛夷（玉兰）.jpg",
        type: [1],
      },
      {
        path: "辛夷/110_辛夷（武当玉兰）.jpg",
        type: [1],
      },
      {
        path: "辛夷/130_辛夷药材.jpg",
        type: [1],
      },
      {
        path: "辛夷/150_辛夷性状鉴别.jpg",
        type: [1],
      },
      {
        path: "辛夷/170_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "辣木籽",
    files: [
      {
        path: "辣木籽/010_辣木树.jpg",
        type: [1],
      },
      {
        path: "辣木籽/030_辣木籽.jpg",
        type: [1],
      },
      {
        path: "辣木籽/050_辣木籽.jpg",
        type: [1],
      },
      {
        path: "辣木籽/070_辣木籽.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "远志",
    files: [
      {
        path: "远志/000_安神药_远志.jpg",
        type: [1],
      },
      {
        path: "远志/010_远志植物.jpg",
        type: [1],
      },
      {
        path: "远志/030_卵叶远志植物.jpg",
        type: [1],
      },
      {
        path: "远志/050_远志药材.jpg",
        type: [1],
      },
      {
        path: "远志/070_远志药材.jpg",
        type: [1],
      },
      {
        path: "远志/090_远志特征.jpg",
        type: [1],
      },
      {
        path: "远志/110_远志.jpg",
        type: [1],
      },
      {
        path: "远志/130_远志性状鉴别.jpg",
        type: [1],
      },
      {
        path: "远志/150_绵毛马兜铃根.jpg",
        type: [2],
      },
      {
        path: "远志/170_远志小草.jpg",
        type: [1],
      },
      {
        path: "远志/190_远志饮片.jpg",
        type: [1],
      },
      {
        path: "远志/210_制远志.jpg",
        type: [1],
      },
      {
        path: "远志/230_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "连翘",
    files: [
      {
        path: "连翘/000_清热药_连翘.jpg",
        type: [1],
      },
      {
        path: "连翘/010_连翘植物.jpg",
        type: [1],
      },
      {
        path: "连翘/030_青翘.jpg",
        type: [1],
      },
      {
        path: "连翘/050_老翘.jpg",
        type: [1],
      },
      {
        path: "连翘/070_连翘药材.jpg",
        type: [1],
      },
      {
        path: "连翘/090_连翘性状鉴别.jpg",
        type: [1],
      },
      {
        path: "连翘/110_连翘掺伪.jpg",
        type: [1],
      },
      {
        path: "连翘/130_伪品：紫丁香的果实.jpg",
        type: [1],
      },
      {
        path: "连翘/150_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "连钱草",
    files: [
      {
        path: "连钱草/010_活血丹.jpg",
        type: [1],
      },
      {
        path: "连钱草/030_连钱草药材.jpg",
        type: [1],
      },
      {
        path: "连钱草/050_连钱草药材.jpg",
        type: [1],
      },
      {
        path: "连钱草/070_连钱草.jpg",
        type: [1],
      },
      {
        path: "连钱草/090_连钱草.jpg",
        type: [1],
      },
      {
        path: "连钱草/110_连钱草与易混品比较.jpg",
        type: [1],
      },
      {
        path: "连钱草/130_广金钱草.jpg",
        type: [1],
      },
      {
        path: "连钱草/150_积雪草.jpg",
        type: [1],
      },
      {
        path: "连钱草/170_天胡荽.jpg",
        type: [1],
      },
      {
        path: "连钱草/190_活血丹.jpg",
        type: [1],
      },
      {
        path: "连钱草/210_马蹄金.jpg",
        type: [1],
      },
      {
        path: "连钱草/230_金钱草.jpg",
        type: [1],
      },
      {
        path: "连钱草/250_聚花过路黄.jpg",
        type: [1],
      },
      {
        path: "连钱草/270_连钱草饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "透骨草",
    files: [
      {
        path: "透骨草/010_地构叶.jpg",
        type: [1],
      },
      {
        path: "透骨草/030_透骨草.jpg",
        type: [1],
      },
      {
        path: "透骨草/050_透骨草.jpg",
        type: [1],
      },
      {
        path: "透骨草/070_透骨草.jpg",
        type: [1],
      },
      {
        path: "透骨草/090_透骨草.jpg",
        type: [1],
      },
      {
        path: "透骨草/110_透骨草.jpg",
        type: [1],
      },
      {
        path: "透骨草/130_透骨草与伪品马鞭草对比.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "通关藤",
    files: [
      {
        path: "通关藤/010_通关藤植物.jpg",
        type: [1],
      },
      {
        path: "通关藤/030_通关藤药材.jpg",
        type: [1],
      },
      {
        path: "通关藤/050_通关藤饮片.jpg",
        type: [1],
      },
      {
        path: "通关藤/070_通关藤.jpg",
        type: [1],
      },
      {
        path: "通关藤/090_通关藤横切面.jpg",
        type: [1],
      },
      {
        path: "通关藤/110_通关藤表面观.jpg",
        type: [1],
      },
      {
        path: "通关藤/130_黑骨藤.jpg",
        type: [1],
      },
      {
        path: "通关藤/150_通关藤、黑骨藤对比.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "通草",
    files: [
      {
        path: "通草/010_通脱木植物.jpg",
        type: [1],
      },
      {
        path: "通草/030_通草药材.jpg",
        type: [1],
      },
      {
        path: "通草/050_通草.jpg",
        type: [1],
      },
      {
        path: "通草/070_通草性状鉴别.jpg",
        type: [1],
      },
      {
        path: "通草/090_西南绣球.jpg",
        type: [1],
      },
      {
        path: "通草/110_西南绣球.jpg",
        type: [1],
      },
      {
        path: "通草/130_伪品.jpg",
        type: [1],
      },
      {
        path: "通草/150_左：通草  中：小通草  右：灯心草大小比较.jpg",
        type: [1],
      },
      {
        path: "通草/170_通草饮片.jpg",
        type: [1],
      },
      {
        path: "通草/190_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "郁李仁",
    files: [
      {
        path: "郁李仁/000_泻下药_郁李仁.jpg",
        type: [1],
      },
      {
        path: "郁李仁/010_欧李植物.jpg",
        type: [1],
      },
      {
        path: "郁李仁/030_郁李植物.jpg",
        type: [1],
      },
      {
        path: "郁李仁/050_长柄扁桃植物.jpg",
        type: [1],
      },
      {
        path: "郁李仁/070_小李仁药材.jpg",
        type: [1],
      },
      {
        path: "郁李仁/090_大李仁药材.jpg",
        type: [1],
      },
      {
        path: "郁李仁/110_郁李仁.jpg",
        type: [1],
      },
      {
        path: "郁李仁/130_郁李仁性状鉴别.jpg",
        type: [1],
      },
      {
        path: "郁李仁/150_郁李仁合点.jpg",
        type: [1],
      },
      {
        path: "郁李仁/170_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "郁金",
    files: [
      {
        path: "郁金/010_温郁金.jpg",
        type: [1],
      },
      {
        path: "郁金/030_姜黄.jpg",
        type: [1],
      },
      {
        path: "郁金/050_广西莪术.jpg",
        type: [1],
      },
      {
        path: "郁金/070_蓬莪术.jpg",
        type: [1],
      },
      {
        path: "郁金/090_郁金、莪术、姜黄、片姜黄的来源.jpg",
        type: [1],
      },
      {
        path: "郁金/110_温郁金药材.jpg",
        type: [1],
      },
      {
        path: "郁金/130_温郁金饮片.jpg",
        type: [1],
      },
      {
        path: "郁金/150_黄丝郁金药材.jpg",
        type: [1],
      },
      {
        path: "郁金/170_黄丝郁金饮片.jpg",
        type: [1],
      },
      {
        path: "郁金/190_桂郁金药材.jpg",
        type: [1],
      },
      {
        path: "郁金/210_桂郁金饮片.jpg",
        type: [1],
      },
      {
        path: "郁金/230_绿丝郁金药材.jpg",
        type: [1],
      },
      {
        path: "郁金/250_绿丝郁金饮片.jpg",
        type: [1],
      },
      {
        path: "郁金/270_左：温郁金   中：桂郁金   右：川郁金.jpg",
        type: [1],
      },
      {
        path: "郁金/290_切面      左：温郁金   中：桂郁金   右：川郁金.jpg",
        type: [1],
      },
      {
        path: "郁金/310_郁金性状鉴别.jpg",
        type: [1],
      },
      {
        path: "郁金/330_温郁金.jpg",
        type: [1],
      },
      {
        path: "郁金/350_四种郁金的主要区别.jpg",
        type: [1],
      },
      {
        path: "郁金/370_温郁金.jpg",
        type: [1],
      },
      {
        path: "郁金/390_桂郁金.jpg",
        type: [1],
      },
      {
        path: "郁金/410_黄丝郁金.jpg",
        type: [1],
      },
      {
        path: "郁金/430_绿丝郁金.jpg",
        type: [1],
      },
      {
        path: "郁金/450_郁金饮片.jpg",
        type: [1],
      },
      {
        path: "郁金/470_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "酸枣仁",
    files: [
      {
        path: "酸枣仁/000_安神药_酸枣仁.jpg",
        type: [1],
      },
      {
        path: "酸枣仁/010_酸枣植物.jpg",
        type: [1],
      },
      {
        path: "酸枣仁/030_酸枣仁药材.jpg",
        type: [1],
      },
      {
        path: "酸枣仁/050_酸枣仁放大.jpg",
        type: [1],
      },
      {
        path: "酸枣仁/070_酸枣仁性状鉴别.jpg",
        type: [1],
      },
      {
        path: "酸枣仁/090_酸枣仁掺杂：果核.jpg",
        type: [1],
      },
      {
        path: "酸枣仁/110_上酸枣仁，下理枣仁.jpg",
        type: [2],
      },
      {
        path: "酸枣仁/130_酸枣仁与理枣仁性状比较.jpg",
        type: [2],
      },
      {
        path: "酸枣仁/150_左酸枣仁，右理枣仁.jpg",
        type: [2],
      },
      {
        path: "酸枣仁/170_酸枣仁（上）与枳椇子（下）.jpg",
        type: [2],
      },
      {
        path: "酸枣仁/190_兵豆.jpg",
        type: [2],
      },
      {
        path: "酸枣仁/210_染色兵豆.jpg",
        type: [2],
      },
      {
        path: "酸枣仁/230_酸枣仁及混伪品.jpg",
        type: [2],
      },
      {
        path: "酸枣仁/250_炒酸枣仁.jpg",
        type: [1],
      },
      {
        path: "酸枣仁/270_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "重楼",
    files: [
      {
        path: "重楼/010_云南重楼.jpg",
        type: [1],
      },
      {
        path: "重楼/030_七叶一枝花.jpg",
        type: [1],
      },
      {
        path: "重楼/050_重楼药材.jpg",
        type: [1],
      },
      {
        path: "重楼/070_重楼药材.jpg",
        type: [1],
      },
      {
        path: "重楼/090_重楼.jpg",
        type: [1],
      },
      {
        path: "重楼/110_重楼.jpg",
        type: [1],
      },
      {
        path: "重楼/130_重楼性状鉴别.jpg",
        type: [1],
      },
      {
        path: "重楼/150_万年青.jpg",
        type: [1],
      },
      {
        path: "重楼/170_重楼伪品：五指连.jpg",
        type: [1],
      },
      {
        path: "重楼/190_重楼伪品：北重楼.jpg",
        type: [1],
      },
      {
        path: "重楼/210_延龄草.jpg",
        type: [1],
      },
      {
        path: "重楼/230_头顶一颗珠饮片.jpg",
        type: [1],
      },
      {
        path: "重楼/250_重楼.jpg",
        type: [1],
      },
      {
        path: "重楼/270_拳参.jpg",
        type: [1],
      },
      {
        path: "重楼/290_重楼饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "野木瓜",
    files: [
      {
        path: "野木瓜/010_野木瓜植物.jpg",
        type: [1],
      },
      {
        path: "野木瓜/030_野木瓜.jpg",
        type: [1],
      },
      {
        path: "野木瓜/050_野木瓜.jpg",
        type: [1],
      },
      {
        path: "野木瓜/070_野木瓜.jpg",
        type: [1],
      },
      {
        path: "野木瓜/090_野木瓜.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "野菊花",
    files: [
      {
        path: "野菊花/000_清热药_野菊花.jpg",
        type: [1],
      },
      {
        path: "野菊花/010_野菊植物.jpg",
        type: [1],
      },
      {
        path: "野菊花/030_野菊花药材.jpg",
        type: [1],
      },
      {
        path: "野菊花/050_野菊花性状鉴别.jpg",
        type: [1],
      },
      {
        path: "野菊花/070_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "野马追",
    files: [
      {
        path: "野马追/010_轮叶泽兰植物.jpg",
        type: [1],
      },
      {
        path: "野马追/030_轮叶泽兰叶片.jpg",
        type: [1],
      },
      {
        path: "野马追/050_野马追.jpg",
        type: [1],
      },
      {
        path: "野马追/070_野马追.jpg",
        type: [1],
      },
      {
        path: "野马追/090_野马追饮片.jpg",
        type: [1],
      },
      {
        path: "野马追/110_野马追饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "金果榄",
    files: [
      {
        path: "金果榄/010_青牛胆植物.jpg",
        type: [1],
      },
      {
        path: "金果榄/030_金果榄植物.jpg",
        type: [1],
      },
      {
        path: "金果榄/050_金果榄药材.jpg",
        type: [1],
      },
      {
        path: "金果榄/070_金果榄药材.jpg",
        type: [1],
      },
      {
        path: "金果榄/090_金果榄饮片.jpg",
        type: [1],
      },
      {
        path: "金果榄/110_金果榄饮片.jpg",
        type: [1],
      },
      {
        path: "金果榄/130_金果榄饮片.jpg",
        type: [1],
      },
      {
        path: "金果榄/150_金果榄鉴别特征.jpg",
        type: [1],
      },
      {
        path: "金果榄/170_金果榄混伪品鉴别.jpg",
        type: [1],
      },
      {
        path: "金果榄/190_金果榄饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "金樱子",
    files: [
      {
        path: "金樱子/010_金樱子植物.jpg",
        type: [1],
      },
      {
        path: "金樱子/030_金樱子药材.jpg",
        type: [1],
      },
      {
        path: "金樱子/050_金樱子性状鉴别.jpg",
        type: [1],
      },
      {
        path: "金樱子/070_金樱子肉.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "金沸草",
    files: [
      {
        path: "金沸草/010_条叶旋覆花植物.jpg",
        type: [1],
      },
      {
        path: "金沸草/030_旋覆花植物.jpg",
        type: [1],
      },
      {
        path: "金沸草/050_条叶旋覆花.jpg",
        type: [1],
      },
      {
        path: "金沸草/070_旋覆花.jpg",
        type: [1],
      },
      {
        path: "金沸草/090_金沸草.jpg",
        type: [1],
      },
      {
        path: "金沸草/110_金沸草饮片.jpg",
        type: [1],
      },
      {
        path: "金沸草/130_金沸草饮片.jpg",
        type: [1],
      },
      {
        path: "金沸草/150_条叶旋覆花饮片.jpg",
        type: [1],
      },
      {
        path: "金沸草/170_旋覆花饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "金礞石",
    files: [
      {
        path: "金礞石/010_金礞石药材.jpg",
        type: [1],
      },
      {
        path: "金礞石/030_金礞石药材.jpg",
        type: [1],
      },
      {
        path: "金礞石/050_金礞石药材.jpg",
        type: [1],
      },
      {
        path: "金礞石/070_金礞石性状鉴别.jpg",
        type: [1],
      },
      {
        path: "金礞石/090_金礞石性状鉴别.jpg",
        type: [1],
      },
      {
        path: "金礞石/110_金礞石.jpg",
        type: [1],
      },
      {
        path: "金礞石/130_煅金礞石.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "金荞麦",
    files: [
      {
        path: "金荞麦/010_金荞麦植物.jpg",
        type: [1],
      },
      {
        path: "金荞麦/030_金荞麦.jpg",
        type: [1],
      },
      {
        path: "金荞麦/050_金荞麦饮片.jpg",
        type: [1],
      },
      {
        path: "金荞麦/070_金荞麦药材.jpg",
        type: [1],
      },
      {
        path: "金荞麦/090_金荞麦饮片.jpg",
        type: [1],
      },
      {
        path: "金荞麦/110_金荞麦性状鉴别.jpg",
        type: [1],
      },
      {
        path: "金荞麦/130_金荞麦饮片.jpg",
        type: [1],
      },
      {
        path: "金荞麦/150_金荞麦饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "金钱白花蛇",
    files: [
      {
        path: "金钱白花蛇/010_银环蛇.jpg",
        type: [1],
      },
      {
        path: "金钱白花蛇/030_金钱白花蛇药材.jpg",
        type: [1],
      },
      {
        path: "金钱白花蛇/050_金钱白花蛇.jpg",
        type: [1],
      },
      {
        path: "金钱白花蛇/070_金钱白花蛇性状鉴别.jpg",
        type: [1],
      },
      {
        path: "金钱白花蛇/090_金钱白花蛇.jpg",
        type: [1],
      },
      {
        path: "金钱白花蛇/110_金环蛇.jpg",
        type: [1],
      },
      {
        path: "金钱白花蛇/130_赤链蛇.jpg",
        type: [1],
      },
      {
        path: "金钱白花蛇/150_金钱白花蛇与赤链蛇.jpg",
        type: [1],
      },
      {
        path: "金钱白花蛇/170_水赤链蛇.jpg",
        type: [1],
      },
      {
        path: "金钱白花蛇/190_伪品：涂漆铅色水蛇.jpg",
        type: [1],
      },
      {
        path: "金钱白花蛇/210_伪品：渔游蛇.jpg",
        type: [1],
      },
      {
        path: "金钱白花蛇/230_赤链蛇与中国水蛇的拼接品.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "金钱草",
    files: [
      {
        path: "金钱草/010_过路黄.jpg",
        type: [1],
      },
      {
        path: "金钱草/030_金钱草药材.jpg",
        type: [1],
      },
      {
        path: "金钱草/050_金钱草药材.jpg",
        type: [1],
      },
      {
        path: "金钱草/070_金钱草.jpg",
        type: [1],
      },
      {
        path: "金钱草/090_金钱草.jpg",
        type: [1],
      },
      {
        path: "金钱草/110_金钱草.jpg",
        type: [1],
      },
      {
        path: "金钱草/130_金钱草浸泡后，透光可见黑色或褐色条纹.jpg",
        type: [1],
      },
      {
        path: "金钱草/150_金钱草.jpg",
        type: [1],
      },
      {
        path: "金钱草/170_金钱草上、下表面观.jpg",
        type: [1],
      },
      {
        path: "金钱草/190_金钱草水浸泡后上表面观.jpg",
        type: [1],
      },
      {
        path: "金钱草/210_金钱草果实.jpg",
        type: [1],
      },
      {
        path: "金钱草/230_金钱草性状鉴别.jpg",
        type: [1],
      },
      {
        path: "金钱草/250_广金钱草.jpg",
        type: [1],
      },
      {
        path: "金钱草/270_积雪草.jpg",
        type: [1],
      },
      {
        path: "金钱草/290_天胡荽.jpg",
        type: [1],
      },
      {
        path: "金钱草/310_活血丹.jpg",
        type: [1],
      },
      {
        path: "金钱草/330_马蹄金.jpg",
        type: [1],
      },
      {
        path: "金钱草/350_金钱草.jpg",
        type: [1],
      },
      {
        path: "金钱草/370_聚花过路黄.jpg",
        type: [1],
      },
      {
        path: "金钱草/390_聚花过路黄.jpg",
        type: [1],
      },
      {
        path: "金钱草/410_点腺过路黄.jpg",
        type: [1],
      },
      {
        path: "金钱草/430_点腺过路黄.jpg",
        type: [1],
      },
      {
        path: "金钱草/450_伪品聚花过路黄.jpg",
        type: [1],
      },
      {
        path: "金钱草/470_金钱草饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "金银花",
    files: [
      {
        path: "金银花/010_忍冬原植物.jpg",
        type: [1],
      },
      {
        path: "金银花/030_金银花花蕾.jpg",
        type: [1],
      },
      {
        path: "金银花/050_山东金银花.jpg",
        type: [1],
      },
      {
        path: "金银花/070_河南金银花.jpg",
        type: [1],
      },
      {
        path: "金银花/090_山东金银花药材.jpg",
        type: [1],
      },
      {
        path: "金银花/110_河南金银花药材.jpg",
        type: [1],
      },
      {
        path: "金银花/130_金银花性状鉴别.jpg",
        type: [1],
      },
      {
        path: "金银花/150_金银花商品规格.jpg",
        type: [1],
      },
      {
        path: "金银花/170_山银花.jpg",
        type: [1],
      },
      {
        path: "金银花/190_山银花.jpg",
        type: [1],
      },
      {
        path: "金银花/210_红腺忍冬.jpg",
        type: [1],
      },
      {
        path: "金银花/230_灰毡毛忍冬植物.jpg",
        type: [1],
      },
      {
        path: "金银花/250_红腺忍冬植物.jpg",
        type: [1],
      },
      {
        path: "金银花/270_华南忍冬植物.jpg",
        type: [1],
      },
      {
        path: "金银花/290_黄褐毛忍冬植物.jpg",
        type: [1],
      },
      {
        path: "金银花/310_灰毡毛忍冬药材.jpg",
        type: [1],
      },
      {
        path: "金银花/330_灰毡毛忍冬.jpg",
        type: [1],
      },
      {
        path: "金银花/350_红腺忍冬.jpg",
        type: [1],
      },
      {
        path: "金银花/370_华南忍冬.jpg",
        type: [1],
      },
      {
        path: "金银花/390_黄褐毛忍冬.jpg",
        type: [1],
      },
      {
        path: "金银花/410_山银花性状鉴别.jpg",
        type: [1],
      },
      {
        path: "金银花/430_金银花与山银花对比.jpg",
        type: [1],
      },
      {
        path: "金银花/450_金银花与山银花对比.jpg",
        type: [1],
      },
      {
        path: "金银花/470_毛花柱忍冬.jpg",
        type: [1],
      },
      {
        path: "金银花/490_短柄忍冬.jpg",
        type: [1],
      },
      {
        path: "金银花/510_短柄忍冬.jpg",
        type: [1],
      },
      {
        path: "金银花/530_网脉忍冬.jpg",
        type: [1],
      },
      {
        path: "金银花/550_网脉忍冬.jpg",
        type: [1],
      },
      {
        path: "金银花/570_盘叶忍冬.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "钟乳石",
    files: [
      {
        path: "钟乳石/010_钟乳石.jpg",
        type: [1],
      },
      {
        path: "钟乳石/030_钟乳石.jpg",
        type: [1],
      },
      {
        path: "钟乳石/050_钟乳石.jpg",
        type: [1],
      },
      {
        path: "钟乳石/070_钟乳石.jpg",
        type: [1],
      },
      {
        path: "钟乳石/090_煅钟乳石.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "钩吻",
    files: [
      {
        path: "钩吻/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "钩藤",
    files: [
      {
        path: "钩藤/010_钩藤植物.jpg",
        type: [1],
      },
      {
        path: "钩藤/030_大叶钩藤植物.jpg",
        type: [1],
      },
      {
        path: "钩藤/050_毛钩藤植物.jpg",
        type: [1],
      },
      {
        path: "钩藤/070_华钩藤植物.jpg",
        type: [1],
      },
      {
        path: "钩藤/090_无柄果钩藤植物.jpg",
        type: [1],
      },
      {
        path: "钩藤/110_钩藤药材.jpg",
        type: [1],
      },
      {
        path: "钩藤/130_钩藤饮片.jpg",
        type: [1],
      },
      {
        path: "钩藤/150_钩藤.jpg",
        type: [1],
      },
      {
        path: "钩藤/170_大叶钩藤.jpg",
        type: [1],
      },
      {
        path: "钩藤/190_毛钩藤.jpg",
        type: [1],
      },
      {
        path: "钩藤/210_华钩藤.jpg",
        type: [1],
      },
      {
        path: "钩藤/230_无柄果钩藤.jpg",
        type: [1],
      },
      {
        path: "钩藤/250_钩藤性状鉴别.jpg",
        type: [1],
      },
      {
        path: "钩藤/270_钩藤横切面.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "铁包金",
    files: [
      {
        path: "铁包金/010_铁包金植物.jpg",
        type: [1],
      },
      {
        path: "铁包金/030_铁包金药材.jpg",
        type: [1],
      },
      {
        path: "铁包金/050_铁包金药材.jpg",
        type: [1],
      },
      {
        path: "铁包金/070_铁包金药材.jpg",
        type: [1],
      },
      {
        path: "铁包金/090_铁包金饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "铁皮石斛",
    files: [
      {
        path: "铁皮石斛/010_铁皮石斛植物.jpg",
        type: [1],
      },
      {
        path: "铁皮石斛/030_铁皮枫斗.jpg",
        type: [1],
      },
      {
        path: "铁皮石斛/050_铁皮枫斗.jpg",
        type: [1],
      },
      {
        path: "铁皮石斛/070_铁皮石斛.jpg",
        type: [1],
      },
      {
        path: "铁皮石斛/090_铁皮石斛.jpg",
        type: [1],
      },
      {
        path: "铁皮石斛/110_石斛性状鉴别.jpg",
        type: [1],
      },
      {
        path: "铁皮石斛/130_粉花石斛原植物.jpg",
        type: [1],
      },
      {
        path: "铁皮石斛/150_粉花石斛.jpg",
        type: [1],
      },
      {
        path: "铁皮石斛/170_粉花石斛.jpg",
        type: [1],
      },
      {
        path: "铁皮石斛/190_马鞭石斛.jpg",
        type: [1],
      },
      {
        path: "铁皮石斛/210_束花石斛.jpg",
        type: [1],
      },
      {
        path: "铁皮石斛/230_束花石斛.jpg",
        type: [1],
      },
      {
        path: "铁皮石斛/250_金钗石斛原植物.jpg",
        type: [1],
      },
      {
        path: "铁皮石斛/270_金钗石斛.jpg",
        type: [1],
      },
      {
        path: "铁皮石斛/290_金钗石斛（鲜品）.jpg",
        type: [1],
      },
      {
        path: "铁皮石斛/310_铁皮石斛原植物.jpg",
        type: [1],
      },
      {
        path: "铁皮石斛/330_铁皮石斛.jpg",
        type: [1],
      },
      {
        path: "铁皮石斛/350_铁皮石斛（耳环）.jpg",
        type: [1],
      },
      {
        path: "铁皮石斛/370_铁皮石斛鲜品.jpg",
        type: [1],
      },
      {
        path: "铁皮石斛/390_细叶石斛.jpg",
        type: [2],
      },
      {
        path: "铁皮石斛/410_细叶石斛表面观.jpg",
        type: [2],
      },
      {
        path: "铁皮石斛/430_重唇石斛原植物.jpg",
        type: [2],
      },
      {
        path: "铁皮石斛/450_聚石斛.jpg",
        type: [2],
      },
      {
        path: "铁皮石斛/470_细茎石斛原植物.jpg",
        type: [2],
      },
      {
        path: "铁皮石斛/490_细茎石斛.jpg",
        type: [2],
      },
      {
        path: "铁皮石斛/510_戟叶全金斛.jpg",
        type: [2],
      },
      {
        path: "铁皮石斛/530_云南石仙桃.jpg",
        type: [2],
      },
      {
        path: "铁皮石斛/550_石斛经验鉴别.jpg",
        type: [1],
      },
      {
        path: "铁皮石斛/570_石斛经验鉴别.jpg",
        type: [1],
      },
      {
        path: "铁皮石斛/590_石斛经验鉴别.jpg",
        type: [1],
      },
      {
        path: "铁皮石斛/610_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "铁精",
    files: [
      {
        path: "铁精/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "铅丹",
    files: [
      {
        path: "铅丹/000_功毒杀虫_铅丹.jpg",
        type: [1],
      },
      {
        path: "铅丹/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "银杏叶",
    files: [
      {
        path: "银杏叶/010_银杏植物.jpg",
        type: [1],
      },
      {
        path: "银杏叶/030_银杏叶.jpg",
        type: [1],
      },
      {
        path: "银杏叶/050_银杏叶药材.jpg",
        type: [1],
      },
      {
        path: "银杏叶/070_银杏叶药材.jpg",
        type: [1],
      },
      {
        path: "银杏叶/090_银杏叶.jpg",
        type: [1],
      },
      {
        path: "银杏叶/110_银杏叶.jpg",
        type: [1],
      },
      {
        path: "银杏叶/130_银杏叶性状鉴别.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "银柴胡",
    files: [
      {
        path: "银柴胡/010_银柴胡.jpg",
        type: [1],
      },
      {
        path: "银柴胡/030_银柴胡（野生）.jpg",
        type: [1],
      },
      {
        path: "银柴胡/050_银柴胡饮片（野生）.jpg",
        type: [1],
      },
      {
        path: "银柴胡/070_银柴胡（家种）.jpg",
        type: [1],
      },
      {
        path: "银柴胡/090_银柴胡饮片（家种）.jpg",
        type: [1],
      },
      {
        path: "银柴胡/110_银柴胡性状鉴别.jpg",
        type: [1],
      },
      {
        path: "银柴胡/130_银柴胡性状特征.jpg",
        type: [1],
      },
      {
        path: "银柴胡/150_银柴胡.jpg",
        type: [1],
      },
      {
        path: "银柴胡/170_银柴胡性状鉴别.jpg",
        type: [1],
      },
      {
        path: "银柴胡/190_灯心蚤缀.jpg",
        type: [1],
      },
      {
        path: "银柴胡/210_灯心蚤缀.jpg",
        type: [1],
      },
      {
        path: "银柴胡/230_蝇子草.jpg",
        type: [1],
      },
      {
        path: "银柴胡/250_旱麦瓶草.jpg",
        type: [1],
      },
      {
        path: "银柴胡/270_丝石竹.jpg",
        type: [1],
      },
      {
        path: "银柴胡/290_窄叶丝石竹.jpg",
        type: [1],
      },
      {
        path: "银柴胡/310_银柴胡.jpg",
        type: [1],
      },
      {
        path: "银柴胡/330_霞草山银胡.jpg",
        type: [1],
      },
      {
        path: "银柴胡/350_银柴胡饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "锁阳",
    files: [
      {
        path: "锁阳/010_锁阳.jpg",
        type: [1],
      },
      {
        path: "锁阳/030_锁阳药材.jpg",
        type: [1],
      },
      {
        path: "锁阳/050_锁阳饮片.jpg",
        type: [1],
      },
      {
        path: "锁阳/070_锁阳.jpg",
        type: [1],
      },
      {
        path: "锁阳/090_锁阳.jpg",
        type: [1],
      },
      {
        path: "锁阳/110_锁阳.jpg",
        type: [1],
      },
      {
        path: "锁阳/130_锁阳性状鉴别.jpg",
        type: [1],
      },
      {
        path: "锁阳/150_锁阳饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "锦灯笼",
    files: [
      {
        path: "锦灯笼/010_酸浆植物.jpg",
        type: [1],
      },
      {
        path: "锦灯笼/030_锦灯笼.jpg",
        type: [1],
      },
      {
        path: "锦灯笼/050_锦灯笼.jpg",
        type: [1],
      },
      {
        path: "锦灯笼/070_锦灯笼.jpg",
        type: [1],
      },
      {
        path: "锦灯笼/090_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "长石",
    files: [
      {
        path: "长石/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "闹羊花",
    files: [
      {
        path: "闹羊花/010_羊踯躅植物.jpg",
        type: [1],
      },
      {
        path: "闹羊花/030_闹羊花.jpg",
        type: [1],
      },
      {
        path: "闹羊花/050_闹羊花药材.jpg",
        type: [1],
      },
      {
        path: "闹羊花/070_闹羊花药材.jpg",
        type: [1],
      },
      {
        path: "闹羊花/090_闹羊花性状鉴别.jpg",
        type: [1],
      },
      {
        path: "闹羊花/110_洋金花.jpg",
        type: [1],
      },
      {
        path: "闹羊花/130_闹羊花.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "防己",
    files: [
      {
        path: "防己/000_祛风湿药_防己.jpg",
        type: [1],
      },
      {
        path: "防己/000_祛风湿药_防己2.jpg",
        type: [1],
      },
      {
        path: "防己/010_粉防己植物.jpg",
        type: [1],
      },
      {
        path: "防己/030_防己药材.jpg",
        type: [1],
      },
      {
        path: "防己/050_防己饮片.jpg",
        type: [1],
      },
      {
        path: "防己/070_防己.jpg",
        type: [1],
      },
      {
        path: "防己/090_防己切片.jpg",
        type: [1],
      },
      {
        path: "防己/110_防己鉴别特征.jpg",
        type: [1],
      },
      {
        path: "防己/130_防己.jpg",
        type: [1],
      },
      {
        path: "防己/150_防己性状鉴别.jpg",
        type: [1],
      },
      {
        path: "防己/170_防已.jpg",
        type: [1],
      },
      {
        path: "防己/190_广防己.jpg",
        type: [1],
      },
      {
        path: "防己/210_木防己.jpg",
        type: [1],
      },
      {
        path: "防己/230_湘防己.jpg",
        type: [1],
      },
      {
        path: "防己/250_湘防己块片.jpg",
        type: [1],
      },
      {
        path: "防己/270_广防己.jpg",
        type: [1],
      },
      {
        path: "防己/290_广防己.jpg",
        type: [1],
      },
      {
        path: "防己/310_耳叶马兜铃.jpg",
        type: [1],
      },
      {
        path: "防己/330_穆坪马兜铃.jpg",
        type: [1],
      },
      {
        path: "防己/350_汉中防己.jpg",
        type: [1],
      },
      {
        path: "防己/370_大叶马兜铃.jpg",
        type: [1],
      },
      {
        path: "防己/390_川防己.jpg",
        type: [1],
      },
      {
        path: "防己/410_树岗马兜铃.jpg",
        type: [1],
      },
      {
        path: "防己/430_百解马兜铃.jpg",
        type: [1],
      },
      {
        path: "防己/450_小果微花藤.jpg",
        type: [1],
      },
      {
        path: "防己/470_瘤枝微花藤.jpg",
        type: [1],
      },
      {
        path: "防己/490_青藤.jpg",
        type: [1],
      },
      {
        path: "防己/510_三叶木通.jpg",
        type: [1],
      },
      {
        path: "防己/530_防己饮片.jpg",
        type: [1],
      },
      {
        path: "防己/550_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "防葵",
    files: [
      {
        path: "防葵/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "防风",
    files: [
      {
        path: "防风/010_防风植物.jpg",
        type: [1],
      },
      {
        path: "防风/030_防风药材.jpg",
        type: [1],
      },
      {
        path: "防风/050_防风饮片.jpg",
        type: [1],
      },
      {
        path: "防风/070_防风饮片.jpg",
        type: [1],
      },
      {
        path: "防风/090_野生防风个子性状.jpg",
        type: [1],
      },
      {
        path: "防风/110_防风饮片.jpg",
        type: [1],
      },
      {
        path: "防风/130_野生防风个子性状.jpg",
        type: [1],
      },
      {
        path: "防风/150_防风性状鉴别.jpg",
        type: [1],
      },
      {
        path: "防风/170_野生关防风个子.jpg",
        type: [1],
      },
      {
        path: "防风/190_野生关防风饮片.jpg",
        type: [1],
      },
      {
        path: "防风/210_根段繁殖的栽培防风个子.jpg",
        type: [1],
      },
      {
        path: "防风/230_种子繁殖的栽培防风个子.jpg",
        type: [1],
      },
      {
        path: "防风/250_种子繁殖的栽培防风饮片.jpg",
        type: [1],
      },
      {
        path: "防风/270_野生防风与栽培防风性状比较.jpg",
        type: [1],
      },
      {
        path: "防风/290_野生防风与栽培防风饮片性状比较.jpg",
        type: [1],
      },
      {
        path: "防风/310_云防风.jpg",
        type: [2],
      },
      {
        path: "防风/330_宽萼岩风.jpg",
        type: [2],
      },
      {
        path: "防风/350_陕西水防风.jpg",
        type: [2],
      },
      {
        path: "防风/370_竹节防风.jpg",
        type: [2],
      },
      {
        path: "防风/390_马英子防风.jpg",
        type: [2],
      },
      {
        path: "防风/410_狗英子.jpg",
        type: [2],
      },
      {
        path: "防风/430_硬阿魏.jpg",
        type: [2],
      },
      {
        path: "防风/450_防风饮片.jpg",
        type: [1],
      },
      {
        path: "防风/470_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "阳起石",
    files: [
      {
        path: "阳起石/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "阿胶",
    files: [
      {
        path: "阿胶/000_补虚药_阿胶.jpg",
        type: [1],
      },
      {
        path: "阿胶/010_驴动物.jpg",
        type: [1],
      },
      {
        path: "阿胶/030_阿胶.jpg",
        type: [1],
      },
      {
        path: "阿胶/050_阿胶.jpg",
        type: [1],
      },
      {
        path: "阿胶/070_阿胶.jpg",
        type: [1],
      },
      {
        path: "阿胶/090_黄明胶.jpg",
        type: [1],
      },
      {
        path: "阿胶/110_其它动物皮伪制加工品.jpg",
        type: [1],
      },
      {
        path: "阿胶/130_塑料伪制加工品.jpg",
        type: [1],
      },
      {
        path: "阿胶/150_阿胶与其他胶类的性状鉴别.jpg",
        type: [1],
      },
      {
        path: "阿胶/170_阿胶碎块.jpg",
        type: [1],
      },
      {
        path: "阿胶/190_阿胶珠.jpg",
        type: [1],
      },
      {
        path: "阿胶/210_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "阿魏",
    files: [
      {
        path: "阿魏/010_新疆阿魏.jpg",
        type: [1],
      },
      {
        path: "阿魏/030_阜康阿魏.jpg",
        type: [1],
      },
      {
        path: "阿魏/050_阿魏药材.jpg",
        type: [1],
      },
      {
        path: "阿魏/070_阿魏药材.jpg",
        type: [1],
      },
      {
        path: "阿魏/090_阿魏药材.jpg",
        type: [1],
      },
      {
        path: "阿魏/110_阿魏.jpg",
        type: [1],
      },
      {
        path: "阿魏/130_阿魏性状鉴别.jpg",
        type: [1],
      },
      {
        path: "阿魏/150_阿魏.jpg",
        type: [1],
      },
      {
        path: "阿魏/170_假阿魏.jpg",
        type: [1],
      },
      {
        path: "阿魏/190_进口阿魏.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "附子",
    files: [
      {
        path: "附子/000_温里药_附子.jpg",
        type: [1],
      },
      {
        path: "附子/010_乌头植物.jpg",
        type: [1],
      },
      {
        path: "附子/030_乌头鲜根.jpg",
        type: [1],
      },
      {
        path: "附子/050_泥附子.jpg",
        type: [1],
      },
      {
        path: "附子/070_盐附子.jpg",
        type: [1],
      },
      {
        path: "附子/090_黑顺片.jpg",
        type: [1],
      },
      {
        path: "附子/110_白附片.jpg",
        type: [1],
      },
      {
        path: "附子/130_生附子.jpg",
        type: [1],
      },
      {
        path: "附子/150_黑顺片.jpg",
        type: [1],
      },
      {
        path: "附子/170_白附片.jpg",
        type: [1],
      },
      {
        path: "附子/190_附子性状鉴别.jpg",
        type: [1],
      },
      {
        path: "附子/210_草乌 未经炮制前（个子货）.jpg",
        type: [1],
      },
      {
        path: "附子/230_切片后.jpg",
        type: [1],
      },
      {
        path: "附子/250_制草乌.jpg",
        type: [1],
      },
      {
        path: "附子/270_川乌 未经炮制前（个子货）.jpg",
        type: [1],
      },
      {
        path: "附子/290_切片后.jpg",
        type: [1],
      },
      {
        path: "附子/310_川乌炮制品.jpg",
        type: [1],
      },
      {
        path: "附子/330_盐附子.jpg",
        type: [1],
      },
      {
        path: "附子/350_左白附片、右黑顺片.jpg",
        type: [1],
      },
      {
        path: "附子/370_川乌、草乌、附子比较.jpg",
        type: [1],
      },
      {
        path: "附子/390_川乌、草乌生品与制品比较.jpg",
        type: [1],
      },
      {
        path: "附子/410_制川乌.jpg",
        type: [1],
      },
      {
        path: "附子/430_川乌炮制过程.jpg",
        type: [1],
      },
      {
        path: "附子/450_制川乌性状.jpg",
        type: [1],
      },
      {
        path: "附子/470_制草乌.jpg",
        type: [1],
      },
      {
        path: "附子/490_制草乌炮制过程与制草乌性状.jpg",
        type: [1],
      },
      {
        path: "附子/510_制草乌伪品.jpg",
        type: [1],
      },
      {
        path: "附子/530_制草乌伪品.jpg",
        type: [1],
      },
      {
        path: "附子/550_附子个.jpg",
        type: [1],
      },
      {
        path: "附子/570_黑顺片.jpg",
        type: [1],
      },
      {
        path: "附子/590_草乌.jpg",
        type: [1],
      },
      {
        path: "附子/610_瓜叶乌头.jpg",
        type: [1],
      },
      {
        path: "附子/630_伪黑顺片.jpg",
        type: [1],
      },
      {
        path: "附子/650_淡附片.jpg",
        type: [1],
      },
      {
        path: "附子/670_炮附片（黑顺片）.jpg",
        type: [1],
      },
      {
        path: "附子/690_炮附片（白附片）.jpg",
        type: [1],
      },
      {
        path: "附子/710_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "陆英",
    files: [
      {
        path: "陆英/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "陈皮",
    files: [
      {
        path: "陈皮/010_橘植物.jpg",
        type: [1],
      },
      {
        path: "陈皮/030_茶枝柑植物.jpg",
        type: [1],
      },
      {
        path: "陈皮/050_陈皮药材.jpg",
        type: [1],
      },
      {
        path: "陈皮/070_广陈皮药材.jpg",
        type: [1],
      },
      {
        path: "陈皮/090_广陈皮对光.jpg",
        type: [1],
      },
      {
        path: "陈皮/110_陈皮鉴别.jpg",
        type: [1],
      },
      {
        path: "陈皮/130_左非新会陈皮、右新会陈皮正品.jpg",
        type: [1],
      },
      {
        path: "陈皮/150_左非新会陈皮、右新会陈皮正品.jpg",
        type: [1],
      },
      {
        path: "陈皮/170_陈皮丝.jpg",
        type: [1],
      },
      {
        path: "陈皮/190_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "降香",
    files: [
      {
        path: "降香/010_降香檀植物.jpg",
        type: [1],
      },
      {
        path: "降香/030_降香药材.jpg",
        type: [1],
      },
      {
        path: "降香/050_降香.jpg",
        type: [1],
      },
      {
        path: "降香/070_降香：海南产.jpg",
        type: [1],
      },
      {
        path: "降香/090_降香：越南产.jpg",
        type: [1],
      },
      {
        path: "降香/110_降香个子，带有非心部位。越南产.jpg",
        type: [1],
      },
      {
        path: "降香/130_降香个子，提取过挥发油.jpg",
        type: [1],
      },
      {
        path: "降香/150_降香伪品，来源不详.jpg",
        type: [1],
      },
      {
        path: "降香/170_降香性状鉴别.jpg",
        type: [1],
      },
      {
        path: "降香/190_伪品紫檀.jpg",
        type: [1],
      },
      {
        path: "降香/210_降香掺边材.jpg",
        type: [1],
      },
      {
        path: "降香/230_降香提取.jpg",
        type: [1],
      },
      {
        path: "降香/250_降香饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "雁肪",
    files: [
      {
        path: "雁肪/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "雄黄",
    files: [
      {
        path: "雄黄/000_功毒杀虫_雄黄.jpg",
        type: [1],
      },
      {
        path: "雄黄/010_雄黄矿石.jpg",
        type: [1],
      },
      {
        path: "雄黄/030_雄黄矿石.jpg",
        type: [1],
      },
      {
        path: "雄黄/050_雄黄药材.jpg",
        type: [1],
      },
      {
        path: "雄黄/070_雄黄药材.jpg",
        type: [1],
      },
      {
        path: "雄黄/090_雄黄.jpg",
        type: [1],
      },
      {
        path: "雄黄/110_雄黄性状鉴别.jpg",
        type: [1],
      },
      {
        path: "雄黄/130_铅丹.jpg",
        type: [1],
      },
      {
        path: "雄黄/150_雄黄粉.jpg",
        type: [1],
      },
      {
        path: "雄黄/170_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "雌黄",
    files: [
      {
        path: "雌黄/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "雚菌",
    files: [
      {
        path: "雚菌/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "雪上一支蒿",
    files: [
      {
        path: "雪上一支蒿/010_雪上一支蒿植物.jpg",
        type: [1],
      },
      {
        path: "雪上一支蒿/030_雪上一支蒿药材.jpg",
        type: [1],
      },
      {
        path: "雪上一支蒿/050_雪上一支蒿药材.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "雷丸",
    files: [
      {
        path: "雷丸/010_菌雷丸.jpg",
        type: [1],
      },
      {
        path: "雷丸/030_雷丸药材.jpg",
        type: [1],
      },
      {
        path: "雷丸/050_雷丸.jpg",
        type: [1],
      },
      {
        path: "雷丸/070_雷丸.jpg",
        type: [1],
      },
      {
        path: "雷丸/090_雷丸.jpg",
        type: [1],
      },
      {
        path: "雷丸/110_吕宋果.jpg",
        type: [1],
      },
      {
        path: "雷丸/130_大风子.jpg",
        type: [1],
      },
      {
        path: "雷丸/150_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "雷公藤",
    files: [
      {
        path: "雷公藤/010_雷公藤植物.jpg",
        type: [1],
      },
      {
        path: "雷公藤/030_雷公藤药材.jpg",
        type: [1],
      },
      {
        path: "雷公藤/050_雷公藤药材.jpg",
        type: [1],
      },
      {
        path: "雷公藤/070_雷公藤饮片.jpg",
        type: [1],
      },
      {
        path: "雷公藤/090_雷公藤饮片.jpg",
        type: [1],
      },
      {
        path: "雷公藤/110_昆明山海棠.jpg",
        type: [1],
      },
      {
        path: "雷公藤/130_四种雷公藤属药材鉴别.jpg",
        type: [1],
      },
      {
        path: "雷公藤/150_丁公藤.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "青叶胆",
    files: [
      {
        path: "青叶胆/010_青叶胆植物.jpg",
        type: [1],
      },
      {
        path: "青叶胆/030_青叶胆药材.jpg",
        type: [1],
      },
      {
        path: "青叶胆/050_青叶胆药材.jpg",
        type: [1],
      },
      {
        path: "青叶胆/070_青叶胆药材.jpg",
        type: [1],
      },
      {
        path: "青叶胆/090_青叶胆药材.jpg",
        type: [1],
      },
      {
        path: "青叶胆/110_青叶胆药材.jpg",
        type: [1],
      },
      {
        path: "青叶胆/130_青叶胆饮片.jpg",
        type: [1],
      },
      {
        path: "青叶胆/150_青叶胆饮片.jpg",
        type: [1],
      },
      {
        path: "青叶胆/170_青叶胆饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "青琅玕",
    files: [
      {
        path: "青琅玕/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "青皮",
    files: [
      {
        path: "青皮/010_橘植物.jpg",
        type: [1],
      },
      {
        path: "青皮/030_橘未成熟的果实.jpg",
        type: [1],
      },
      {
        path: "青皮/050_四花青皮.jpg",
        type: [1],
      },
      {
        path: "青皮/070_个青皮药材.jpg",
        type: [1],
      },
      {
        path: "青皮/090_个青皮药材.jpg",
        type: [1],
      },
      {
        path: "青皮/110_青皮性状鉴别.jpg",
        type: [1],
      },
      {
        path: "青皮/130_青皮饮片.jpg",
        type: [1],
      },
      {
        path: "青皮/150_青皮饮片.jpg",
        type: [1],
      },
      {
        path: "青皮/170_醋青皮.jpg",
        type: [1],
      },
      {
        path: "青皮/190_醋青皮.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "青礞石",
    files: [
      {
        path: "青礞石/010_黑云母片岩.jpg",
        type: [1],
      },
      {
        path: "青礞石/030_绿泥石化云母碳酸盐片岩.jpg",
        type: [1],
      },
      {
        path: "青礞石/050_黑云母片岩.jpg",
        type: [1],
      },
      {
        path: "青礞石/070_绿泥石化云母碳酸盐片岩.jpg",
        type: [1],
      },
      {
        path: "青礞石/090_青礞石药材.jpg",
        type: [1],
      },
      {
        path: "青礞石/110_青礞石药材.jpg",
        type: [1],
      },
      {
        path: "青礞石/130_青礞石药材.jpg",
        type: [1],
      },
      {
        path: "青礞石/150_青礞石药材.jpg",
        type: [1],
      },
      {
        path: "青礞石/170_青礞石性状鉴别.jpg",
        type: [1],
      },
      {
        path: "青礞石/190_青礞石.jpg",
        type: [1],
      },
      {
        path: "青礞石/210_绿泥石化云母碳酸盐片岩与黑云母片岩区别.jpg",
        type: [1],
      },
      {
        path: "青礞石/230_青礞石.jpg",
        type: [1],
      },
      {
        path: "青礞石/250_金礞石.jpg",
        type: [1],
      },
      {
        path: "青礞石/270_青礞石.jpg",
        type: [1],
      },
      {
        path: "青礞石/290_煅青礞石.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "青葙子",
    files: [
      {
        path: "青葙子/010_青葙植物.jpg",
        type: [1],
      },
      {
        path: "青葙子/030_青葙子药材.jpg",
        type: [1],
      },
      {
        path: "青葙子/050_青葙子性状鉴别.jpg",
        type: [1],
      },
      {
        path: "青葙子/070_鸡冠花.jpg",
        type: [1],
      },
      {
        path: "青葙子/090_青葙子（左）与鸡冠花子（右）.jpg",
        type: [1],
      },
      {
        path: "青葙子/110_青葙子（左）与鸡冠花子（右）.jpg",
        type: [1],
      },
      {
        path: "青葙子/130_青葙子、鸡冠花、苋实比较，青葙子长得周正一些，鸡冠花长得不规则，苋比较小。.jpg",
        type: [1],
      },
      {
        path: "青葙子/150_放大镜下可看到凹陷处的凸起种脐，青葙子的在中间一点.jpg",
        type: [1],
      },
      {
        path: "青葙子/170_而鸡冠花的种脐多偏向一边.jpg",
        type: [1],
      },
      {
        path: "青葙子/190_苋的表面像圆盘的底部.jpg",
        type: [1],
      },
      {
        path: "青葙子/210_青葙子残留花柱细长0.4~0.6cm，也就是说大约5个青葙子大小.jpg",
        type: [1],
      },
      {
        path: "青葙子/230_鸡冠花残留的花柱较短，只有0.2~0.3cm，也就是青葙子的三分之一.jpg",
        type: [1],
      },
      {
        path: "青葙子/250_青葙花.jpg",
        type: [1],
      },
      {
        path: "青葙子/270_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "青蒿",
    files: [
      {
        path: "青蒿/000_清热药_青蒿.jpg",
        type: [1],
      },
      {
        path: "青蒿/010_黄花蒿.jpg",
        type: [1],
      },
      {
        path: "青蒿/030_青蒿药材.jpg",
        type: [1],
      },
      {
        path: "青蒿/050_青蒿.jpg",
        type: [1],
      },
      {
        path: "青蒿/070_青蒿.jpg",
        type: [1],
      },
      {
        path: "青蒿/090_青蒿性状鉴别.jpg",
        type: [1],
      },
      {
        path: "青蒿/110_青蒿饮片.jpg",
        type: [1],
      },
      {
        path: "青蒿/130_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "青风藤",
    files: [
      {
        path: "青风藤/010_青藤植物.jpg",
        type: [1],
      },
      {
        path: "青风藤/030_毛青藤植物.jpg",
        type: [1],
      },
      {
        path: "青风藤/050_青风藤药材.jpg",
        type: [1],
      },
      {
        path: "青风藤/070_青风藤（青藤）.jpg",
        type: [1],
      },
      {
        path: "青风藤/090_青风藤（毛青藤）.jpg",
        type: [1],
      },
      {
        path: "青风藤/110_青风藤性状鉴别.jpg",
        type: [1],
      },
      {
        path: "青风藤/130_青风藤.jpg",
        type: [1],
      },
      {
        path: "青风藤/150_鸡矢藤.jpg",
        type: [1],
      },
      {
        path: "青风藤/170_红木香_大血藤_青风藤.jpg",
        type: [1],
      },
      {
        path: "青风藤/190_青风藤饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "青黛",
    files: [
      {
        path: "青黛/000_清热药_青黛.jpg",
        type: [1],
      },
      {
        path: "青黛/010_马蓝植物.jpg",
        type: [1],
      },
      {
        path: "青黛/030_蓼蓝植物.jpg",
        type: [1],
      },
      {
        path: "青黛/050_菘蓝植物.jpg",
        type: [1],
      },
      {
        path: "青黛/070_青黛药材.jpg",
        type: [1],
      },
      {
        path: "青黛/090_青黛粉.jpg",
        type: [1],
      },
      {
        path: "青黛/110_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "韭菜子",
    files: [
      {
        path: "韭菜子/010_韭菜.jpg",
        type: [1],
      },
      {
        path: "韭菜子/030_韭菜子药材.jpg",
        type: [1],
      },
      {
        path: "韭菜子/050_韭菜子性状鉴别.jpg",
        type: [1],
      },
      {
        path: "韭菜子/070_韭菜子.jpg",
        type: [1],
      },
      {
        path: "韭菜子/090_伪品：葱子.jpg",
        type: [1],
      },
      {
        path: "韭菜子/110_葱子与韭菜子.jpg",
        type: [1],
      },
      {
        path: "韭菜子/130_伪品：洋葱子.jpg",
        type: [1],
      },
      {
        path: "韭菜子/150_盐韭菜子.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "预知子",
    files: [
      {
        path: "预知子/010_木通植物.jpg",
        type: [1],
      },
      {
        path: "预知子/030_三叶木通植物.jpg",
        type: [1],
      },
      {
        path: "预知子/050_白木通植物.jpg",
        type: [1],
      },
      {
        path: "预知子/070_预知子鲜果.jpg",
        type: [1],
      },
      {
        path: "预知子/090_预知子药材.jpg",
        type: [1],
      },
      {
        path: "预知子/110_预知子药材.jpg",
        type: [1],
      },
      {
        path: "预知子/130_预知子饮片.jpg",
        type: [1],
      },
      {
        path: "预知子/150_预知子（三叶木通）.jpg",
        type: [1],
      },
      {
        path: "预知子/170_预知子（白木通）.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "颠茄草",
    files: [
      {
        path: "颠茄草/010_颠茄植物.jpg",
        type: [1],
      },
      {
        path: "颠茄草/030_颠茄草.jpg",
        type: [1],
      },
      {
        path: "颠茄草/050_颠茄草.jpg",
        type: [1],
      },
      {
        path: "颠茄草/070_颠茄草.jpg",
        type: [1],
      },
      {
        path: "颠茄草/090_颠茄草.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "飞廉",
    files: [
      {
        path: "飞廉/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "飞扬草",
    files: [
      {
        path: "飞扬草/010_飞扬草植物.jpg",
        type: [1],
      },
      {
        path: "飞扬草/030_飞扬草.jpg",
        type: [1],
      },
      {
        path: "飞扬草/050_飞扬草饮片.jpg",
        type: [1],
      },
      {
        path: "飞扬草/070_飞扬草饮片.jpg",
        type: [1],
      },
      {
        path: "飞扬草/090_飞扬草饮片.jpg",
        type: [1],
      },
      {
        path: "飞扬草/110_飞扬草饮片.jpg",
        type: [1],
      },
      {
        path: "飞扬草/130_飞扬草与混伪品比较.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "饴糖",
    files: [
      {
        path: "饴糖/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "首乌藤",
    files: [
      {
        path: "首乌藤/010_何首乌植物.jpg",
        type: [1],
      },
      {
        path: "首乌藤/030_首乌藤药材.jpg",
        type: [1],
      },
      {
        path: "首乌藤/050_首乌藤.jpg",
        type: [1],
      },
      {
        path: "首乌藤/070_首乌藤饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "香加皮",
    files: [
      {
        path: "香加皮/010_杠柳植物.jpg",
        type: [1],
      },
      {
        path: "香加皮/030_香加皮药材.jpg",
        type: [1],
      },
      {
        path: "香加皮/050_香加皮.jpg",
        type: [1],
      },
      {
        path: "香加皮/070_香加皮性状鉴别.jpg",
        type: [1],
      },
      {
        path: "香加皮/090_香加皮假劣药： 茎皮.jpg",
        type: [1],
      },
      {
        path: "香加皮/110_五加皮.jpg",
        type: [1],
      },
      {
        path: "香加皮/130_五加皮与香加皮的区别.jpg",
        type: [1],
      },
      {
        path: "香加皮/150_香加皮饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "香橼",
    files: [
      {
        path: "香橼/010_枸橼植物.jpg",
        type: [1],
      },
      {
        path: "香橼/030_香圆植物.jpg",
        type: [1],
      },
      {
        path: "香橼/050_枸橼切片.jpg",
        type: [1],
      },
      {
        path: "香橼/070_枸橼性状鉴别.jpg",
        type: [1],
      },
      {
        path: "香橼/090_香圆.jpg",
        type: [1],
      },
      {
        path: "香橼/110_香圆切片.jpg",
        type: [1],
      },
      {
        path: "香橼/130_枸橼纵切片、横切片；香圆近果柄处横切片、中部横切片.jpg",
        type: [1],
      },
      {
        path: "香橼/150_枸橼纵切片、横切片；香圆中部横切片；柚子切片.jpg",
        type: [1],
      },
      {
        path: "香橼/170_香橼伪品：柚子.jpg",
        type: [1],
      },
      {
        path: "香橼/190_香橼伪品：香泡.jpg",
        type: [1],
      },
      {
        path: "香橼/210_枸橼饮片.jpg",
        type: [1],
      },
      {
        path: "香橼/230_香圆饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "香蒲",
    files: [
      {
        path: "香蒲/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "香薷",
    files: [
      {
        path: "香薷/010_石香薷.jpg",
        type: [1],
      },
      {
        path: "香薷/030_江香薷.jpg",
        type: [1],
      },
      {
        path: "香薷/050_海州香薷和石香薷植物对比图.jpg",
        type: [1],
      },
      {
        path: "香薷/070_香薷药材.jpg",
        type: [1],
      },
      {
        path: "香薷/090_石香薷.jpg",
        type: [1],
      },
      {
        path: "香薷/110_香薷.jpg",
        type: [1],
      },
      {
        path: "香薷/130_香薷正品.jpg",
        type: [1],
      },
      {
        path: "香薷/150_假香薷.jpg",
        type: [1],
      },
      {
        path: "香薷/170_香薷掺假.jpg",
        type: [1],
      },
      {
        path: "香薷/190_香薷性状鉴别.jpg",
        type: [1],
      },
      {
        path: "香薷/210_untitled.jpg",
        type: [1],
      },
      {
        path: "香薷/230_伪品土香薷.jpg",
        type: [1],
      },
      {
        path: "香薷/250_土香薷叶背面放大.jpg",
        type: [1],
      },
      {
        path: "香薷/270_香薷饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "香附",
    files: [
      {
        path: "香附/010_莎草植物.jpg",
        type: [1],
      },
      {
        path: "香附/030_香附药材.jpg",
        type: [1],
      },
      {
        path: "香附/050_香附药材.jpg",
        type: [1],
      },
      {
        path: "香附/070_香附饮片.jpg",
        type: [1],
      },
      {
        path: "香附/090_香附性状鉴别.jpg",
        type: [1],
      },
      {
        path: "香附/110_粗根茎莎草.jpg",
        type: [1],
      },
      {
        path: "香附/130_香附非药典品.jpg",
        type: [1],
      },
      {
        path: "香附/150_竹节香附.jpg",
        type: [1],
      },
      {
        path: "香附/170_香附片.jpg",
        type: [1],
      },
      {
        path: "香附/190_醋香附.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "马先蒿",
    files: [
      {
        path: "马先蒿/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "马兜铃",
    files: [
      {
        path: "马兜铃/010_北马兜铃植物.jpg",
        type: [1],
      },
      {
        path: "马兜铃/030_马兜铃植物.jpg",
        type: [1],
      },
      {
        path: "马兜铃/050_马兜铃药材.jpg",
        type: [1],
      },
      {
        path: "马兜铃/070_马兜铃药材.jpg",
        type: [1],
      },
      {
        path: "马兜铃/090_马兜铃.jpg",
        type: [1],
      },
      {
        path: "马兜铃/110_马兜铃性状鉴别.jpg",
        type: [1],
      },
      {
        path: "马兜铃/130_麝香百合.jpg",
        type: [1],
      },
      {
        path: "马兜铃/150_荞麦叶大百合.jpg",
        type: [1],
      },
      {
        path: "马兜铃/170_土兜铃.jpg",
        type: [1],
      },
      {
        path: "马兜铃/190_耳叶马兜铃.jpg",
        type: [1],
      },
      {
        path: "马兜铃/210_马兜铃.jpg",
        type: [1],
      },
      {
        path: "马兜铃/230_蜜马兜铃.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "马刀",
    files: [
      {
        path: "马刀/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "马勃",
    files: [
      {
        path: "马勃/010_真菌脱皮马勃.jpg",
        type: [1],
      },
      {
        path: "马勃/030_真菌大马勃.jpg",
        type: [1],
      },
      {
        path: "马勃/050_真菌紫色马勃.jpg",
        type: [1],
      },
      {
        path: "马勃/070_脱皮马勃.jpg",
        type: [1],
      },
      {
        path: "马勃/090_大马勃.jpg",
        type: [1],
      },
      {
        path: "马勃/110_紫色马勃.jpg",
        type: [1],
      },
      {
        path: "马勃/130_马勃药材.jpg",
        type: [1],
      },
      {
        path: "马勃/150_马勃性状鉴别.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "马钱子",
    files: [
      {
        path: "马钱子/010_马钱植物.jpg",
        type: [1],
      },
      {
        path: "马钱子/030_马钱子药材.jpg",
        type: [1],
      },
      {
        path: "马钱子/050_马钱子性状鉴别.jpg",
        type: [1],
      },
      {
        path: "马钱子/070_马钱子伪品：山马钱.jpg",
        type: [1],
      },
      {
        path: "马钱子/090_山马钱与马钱子对比.jpg",
        type: [1],
      },
      {
        path: "马钱子/110_山马钱.jpg",
        type: [1],
      },
      {
        path: "马钱子/130_云南马钱.jpg",
        type: [1],
      },
      {
        path: "马钱子/150_云南马钱.jpg",
        type: [1],
      },
      {
        path: "马钱子/170_牛眼马钱.jpg",
        type: [1],
      },
      {
        path: "马钱子/190_密花马钱子.jpg",
        type: [1],
      },
      {
        path: "马钱子/210_制马钱子.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "马陆",
    files: [
      {
        path: "马陆/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "马鞭草",
    files: [
      {
        path: "马鞭草/010_马鞭草.jpg",
        type: [1],
      },
      {
        path: "马鞭草/030_马鞭草药材.jpg",
        type: [1],
      },
      {
        path: "马鞭草/050_马鞭草药材.jpg",
        type: [1],
      },
      {
        path: "马鞭草/070_马鞭草性状鉴别.jpg",
        type: [1],
      },
      {
        path: "马鞭草/090_马鞭草.jpg",
        type: [1],
      },
      {
        path: "马鞭草/110_马鞭草杂质.jpg",
        type: [1],
      },
      {
        path: "马鞭草/130_马鞭草饮片正品（左）与伪品（右）对比.jpg",
        type: [1],
      },
      {
        path: "马鞭草/150_马鞭草正品果实（左）与伪品果实（右）对比.jpg",
        type: [1],
      },
      {
        path: "马鞭草/170_马鞭草正品果序.jpg",
        type: [1],
      },
      {
        path: "马鞭草/190_马鞭草伪品果序.jpg",
        type: [1],
      },
      {
        path: "马鞭草/210_马鞭草饮片.jpg",
        type: [1],
      },
      {
        path: "马鞭草/230_马鞭草饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "马齿苋",
    files: [
      {
        path: "马齿苋/010_马齿苋植物.jpg",
        type: [1],
      },
      {
        path: "马齿苋/030_马齿苋药材.jpg",
        type: [1],
      },
      {
        path: "马齿苋/050_马齿苋药材.jpg",
        type: [1],
      },
      {
        path: "马齿苋/070_马齿苋饮片.jpg",
        type: [1],
      },
      {
        path: "马齿苋/090_马齿苋.jpg",
        type: [1],
      },
      {
        path: "马齿苋/110_马齿苋.jpg",
        type: [1],
      },
      {
        path: "马齿苋/130_假马齿苋.jpg",
        type: [1],
      },
      {
        path: "马齿苋/150_马齿苋饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "骨碎补",
    files: [
      {
        path: "骨碎补/010_槲蕨植物.jpg",
        type: [1],
      },
      {
        path: "骨碎补/030_骨碎补药材.jpg",
        type: [1],
      },
      {
        path: "骨碎补/050_骨碎补.jpg",
        type: [1],
      },
      {
        path: "骨碎补/070_骨碎补.jpg",
        type: [1],
      },
      {
        path: "骨碎补/090_烫骨碎补.jpg",
        type: [1],
      },
      {
        path: "骨碎补/110_骨碎补.jpg",
        type: [1],
      },
      {
        path: "骨碎补/130_骨碎补干燥品横切面.jpg",
        type: [1],
      },
      {
        path: "骨碎补/150_骨碎补性状鉴别.jpg",
        type: [1],
      },
      {
        path: "骨碎补/170_骨碎补.jpg",
        type: [1],
      },
      {
        path: "骨碎补/190_大碎补.jpg",
        type: [1],
      },
      {
        path: "骨碎补/210_中华槲蕨：根茎较细长，分枝少，黄棕色小鳞片易脱落，质较硬，断面黄色。.jpg",
        type: [1],
      },
      {
        path: "骨碎补/230_中华槲蕨.jpg",
        type: [1],
      },
      {
        path: "骨碎补/250_崖姜（大骨碎补），表面黑棕色.jpg",
        type: [1],
      },
      {
        path: "骨碎补/270_大骨碎补横切面维管束不呈环状，略呈“凹”形.jpg",
        type: [1],
      },
      {
        path: "骨碎补/290_大叶骨碎补药材（硬骨碎补），表面棕红色至棕褐色，有明显的沟纹.jpg",
        type: [1],
      },
      {
        path: "骨碎补/310_大叶骨碎补横切面，维管束小点14～20个，排列成环，中央有2个大的弯月形维管束。.jpg",
        type: [1],
      },
      {
        path: "骨碎补/330_左骨碎补，中大叶骨碎补，右光亮密网蕨.jpg",
        type: [1],
      },
      {
        path: "骨碎补/350_石蚕.jpg",
        type: [1],
      },
      {
        path: "骨碎补/370_骨碎补伪品.jpg",
        type: [1],
      },
      {
        path: "骨碎补/390_骨碎补伪品：越南进口.jpg",
        type: [1],
      },
      {
        path: "骨碎补/410_骨碎补饮片.jpg",
        type: [1],
      },
      {
        path: "骨碎补/430_烫骨碎补.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "高山辣根菜",
    files: [
      {
        path: "高山辣根菜/010_无茎荠植物.jpg",
        type: [1],
      },
      {
        path: "高山辣根菜/030_高山辣根菜.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "高良姜",
    files: [
      {
        path: "高良姜/010_高良姜.jpg",
        type: [1],
      },
      {
        path: "高良姜/030_高良姜药材.jpg",
        type: [1],
      },
      {
        path: "高良姜/050_高良姜药材.jpg",
        type: [1],
      },
      {
        path: "高良姜/070_高良姜.jpg",
        type: [1],
      },
      {
        path: "高良姜/090_伪品益智根茎.jpg",
        type: [1],
      },
      {
        path: "高良姜/110_伪品大高良姜.jpg",
        type: [1],
      },
      {
        path: "高良姜/130_大良姜.jpg",
        type: [1],
      },
      {
        path: "高良姜/150_高良姜饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "鬼箭羽",
    files: [
      {
        path: "鬼箭羽/010_卫矛植物.jpg",
        type: [1],
      },
      {
        path: "鬼箭羽/030_鬼箭羽.jpg",
        type: [1],
      },
      {
        path: "鬼箭羽/050_鬼箭羽药材.jpg",
        type: [1],
      },
      {
        path: "鬼箭羽/070_鬼箭羽饮片.jpg",
        type: [1],
      },
      {
        path: "鬼箭羽/090_鬼箭羽.jpg",
        type: [1],
      },
      {
        path: "鬼箭羽/110_大果榆.jpg",
        type: [1],
      },
      {
        path: "鬼箭羽/130_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "鬼臼",
    files: [
      {
        path: "鬼臼/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "鱼腥草",
    files: [
      {
        path: "鱼腥草/010_蕺菜.jpg",
        type: [1],
      },
      {
        path: "鱼腥草/030_鲜鱼腥草.jpg",
        type: [1],
      },
      {
        path: "鱼腥草/050_鱼腥草药材.jpg",
        type: [1],
      },
      {
        path: "鱼腥草/070_鱼腥草药材.jpg",
        type: [1],
      },
      {
        path: "鱼腥草/090_鱼腥草.jpg",
        type: [1],
      },
      {
        path: "鱼腥草/110_鱼腥草性状鉴别.jpg",
        type: [1],
      },
      {
        path: "鱼腥草/130_干鱼腥草饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "鲤鱼",
    files: [
      {
        path: "鲤鱼/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "鲤鱼胆",
    files: [
      {
        path: "鲤鱼胆/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "鳖甲",
    files: [
      {
        path: "鳖甲/000_补虚药_鳖甲.jpg",
        type: [1],
      },
      {
        path: "鳖甲/000_补虚药_鳖甲2.jpg",
        type: [1],
      },
      {
        path: "鳖甲/010_鳖.jpg",
        type: [1],
      },
      {
        path: "鳖甲/030_鳖甲药材.jpg",
        type: [1],
      },
      {
        path: "鳖甲/050_鳖甲背面.jpg",
        type: [1],
      },
      {
        path: "鳖甲/070_鳖甲腹面.jpg",
        type: [1],
      },
      {
        path: "鳖甲/090_鳖甲饮片正面观和背面观.jpg",
        type: [1],
      },
      {
        path: "鳖甲/110_鳖甲性状鉴别.jpg",
        type: [1],
      },
      {
        path: "鳖甲/130_鳖甲及混淆品.jpg",
        type: [1],
      },
      {
        path: "鳖甲/150_混淆品：有孔大鳖甲、无孔大鳖甲.jpg",
        type: [1],
      },
      {
        path: "鳖甲/170_缘板鳖甲背面：肋骨常不伸出肋板外.jpg",
        type: [1],
      },
      {
        path: "鳖甲/190_伪品表面呈颗粒状.jpg",
        type: [1],
      },
      {
        path: "鳖甲/210_鳖甲伪品（佛罗里达鳖，又名珍珠鳖），个头大.jpg",
        type: [1],
      },
      {
        path: "鳖甲/230_醋鳖甲.jpg",
        type: [1],
      },
      {
        path: "鳖甲/250_醋鳖甲.jpg",
        type: [1],
      },
      {
        path: "鳖甲/270_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "鸡内金",
    files: [
      {
        path: "鸡内金/000_消食药_鸡内金.jpg",
        type: [1],
      },
      {
        path: "鸡内金/010_家鸡.jpg",
        type: [1],
      },
      {
        path: "鸡内金/030_鸡内金药材.jpg",
        type: [1],
      },
      {
        path: "鸡内金/050_鸡内金.jpg",
        type: [1],
      },
      {
        path: "鸡内金/070_鸡内金.jpg",
        type: [1],
      },
      {
        path: "鸡内金/090_炒鸡内金.jpg",
        type: [1],
      },
      {
        path: "鸡内金/110_醋鸡内金.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "鸡冠花",
    files: [
      {
        path: "鸡冠花/010_红鸡冠花植物.jpg",
        type: [1],
      },
      {
        path: "鸡冠花/030_白鸡冠花植物.jpg",
        type: [1],
      },
      {
        path: "鸡冠花/050_红鸡冠花药材.jpg",
        type: [1],
      },
      {
        path: "鸡冠花/070_白鸡冠花药材.jpg",
        type: [1],
      },
      {
        path: "鸡冠花/090_鸡冠花.jpg",
        type: [1],
      },
      {
        path: "鸡冠花/110_鸡冠花性状鉴别.jpg",
        type: [1],
      },
      {
        path: "鸡冠花/130_鸡冠花饮片.jpg",
        type: [1],
      },
      {
        path: "鸡冠花/150_鸡冠花炭.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "鸡子黄",
    files: [
      {
        path: "鸡子黄/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "鸡矢白",
    files: [
      {
        path: "鸡矢白/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "鸡矢藤",
    files: [
      {
        path: "鸡矢藤/010_鸡矢藤植物.jpg",
        type: [1],
      },
      {
        path: "鸡矢藤/030_鸡矢藤药材.jpg",
        type: [1],
      },
      {
        path: "鸡矢藤/050_鸡矢藤.jpg",
        type: [1],
      },
      {
        path: "鸡矢藤/070_鸡矢藤.jpg",
        type: [1],
      },
      {
        path: "鸡矢藤/090_鸡矢藤.jpg",
        type: [1],
      },
      {
        path: "鸡矢藤/110_鸡矢藤性状鉴别.jpg",
        type: [1],
      },
      {
        path: "鸡矢藤/130_青风藤.jpg",
        type: [1],
      },
      {
        path: "鸡矢藤/150_鸡矢藤.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "鸡血藤",
    files: [
      {
        path: "鸡血藤/010_密花豆植物.jpg",
        type: [1],
      },
      {
        path: "鸡血藤/030_鸡血藤.jpg",
        type: [1],
      },
      {
        path: "鸡血藤/050_鸡血藤药材.jpg",
        type: [1],
      },
      {
        path: "鸡血藤/070_鸡血藤.jpg",
        type: [1],
      },
      {
        path: "鸡血藤/090_鸡血藤性状鉴别.jpg",
        type: [1],
      },
      {
        path: "鸡血藤/110_丰城鸡血藤.jpg",
        type: [1],
      },
      {
        path: "鸡血藤/130_白花油麻藤.jpg",
        type: [1],
      },
      {
        path: "鸡血藤/150_常春油麻藤.jpg",
        type: [1],
      },
      {
        path: "鸡血藤/170_滇鸡血藤.jpg",
        type: [1],
      },
      {
        path: "鸡血藤/190_滇鸡血藤.jpg",
        type: [1],
      },
      {
        path: "鸡血藤/210_异型南五味子藤.jpg",
        type: [1],
      },
      {
        path: "鸡血藤/230_丰城鸡血藤_白花油麻藤_异型南五味子藤.jpg",
        type: [1],
      },
      {
        path: "鸡血藤/250_过岗龙.jpg",
        type: [1],
      },
      {
        path: "鸡血藤/270_圆过岗龙.jpg",
        type: [1],
      },
      {
        path: "鸡血藤/290_黑血藤.jpg",
        type: [1],
      },
      {
        path: "鸡血藤/310_猪腰豆藤.jpg",
        type: [1],
      },
      {
        path: "鸡血藤/330_大血藤.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "鸡骨草",
    files: [
      {
        path: "鸡骨草/010_广州相思子.jpg",
        type: [1],
      },
      {
        path: "鸡骨草/030_鸡骨草药材.jpg",
        type: [1],
      },
      {
        path: "鸡骨草/050_鸡骨草药材.jpg",
        type: [1],
      },
      {
        path: "鸡骨草/070_鸡骨草性状鉴别.jpg",
        type: [1],
      },
      {
        path: "鸡骨草/090_鸡骨草.jpg",
        type: [1],
      },
      {
        path: "鸡骨草/110_毛鸡骨草.jpg",
        type: [1],
      },
      {
        path: "鸡骨草/130_上毛鸡骨草叶、下鸡骨草叶.jpg",
        type: [1],
      },
      {
        path: "鸡骨草/150_上毛鸡骨草、下鸡骨草.jpg",
        type: [1],
      },
      {
        path: "鸡骨草/170_假鸡骨草与小叶黑面神.jpg",
        type: [1],
      },
      {
        path: "鸡骨草/190_鸡骨草饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "鸦胆子",
    files: [
      {
        path: "鸦胆子/010_鸦胆子.jpg",
        type: [1],
      },
      {
        path: "鸦胆子/030_鸦胆子药材.jpg",
        type: [1],
      },
      {
        path: "鸦胆子/050_鸦胆子.jpg",
        type: [1],
      },
      {
        path: "鸦胆子/070_鸦胆子性状鉴别.jpg",
        type: [1],
      },
      {
        path: "鸦胆子/090_鸦胆子仁.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "鸭跖草",
    files: [
      {
        path: "鸭跖草/010_鸭跖草植物.jpg",
        type: [1],
      },
      {
        path: "鸭跖草/030_鸭跖草.jpg",
        type: [1],
      },
      {
        path: "鸭跖草/050_鸭跖草.jpg",
        type: [1],
      },
      {
        path: "鸭跖草/070_鸭跖草.jpg",
        type: [1],
      },
      {
        path: "鸭跖草/090_鸭跖草.jpg",
        type: [1],
      },
      {
        path: "鸭跖草/110_鸭跖草.jpg",
        type: [1],
      },
      {
        path: "鸭跖草/130_紫鸭跖草.jpg",
        type: [1],
      },
      {
        path: "鸭跖草/150_鸭跖草饮片.jpg",
        type: [1],
      },
      {
        path: "鸭跖草/170_鸭跖草饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "鹅不食草",
    files: [
      {
        path: "鹅不食草/010_鹅不食草.jpg",
        type: [1],
      },
      {
        path: "鹅不食草/030_鹅不食草药材.jpg",
        type: [1],
      },
      {
        path: "鹅不食草/050_鹅不食草药材.jpg",
        type: [1],
      },
      {
        path: "鹅不食草/070_鹅不食草.jpg",
        type: [1],
      },
      {
        path: "鹅不食草/090_鹅不食草.jpg",
        type: [1],
      },
      {
        path: "鹅不食草/110_鹅不食草性状鉴别.jpg",
        type: [1],
      },
      {
        path: "鹅不食草/130_鹅不食草饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "鹅管石",
    files: [
      {
        path: "鹅管石/010_丛生盔形珊瑚动物.jpg",
        type: [1],
      },
      {
        path: "鹅管石/030_鹅管石.jpg",
        type: [1],
      },
      {
        path: "鹅管石/050_鹅管石.jpg",
        type: [1],
      },
      {
        path: "鹅管石/070_鹅管石.jpg",
        type: [1],
      },
      {
        path: "鹅管石/090_煅鹅管石.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "鹤草芽",
    files: [
      {
        path: "鹤草芽/010_龙芽草植物.jpg",
        type: [1],
      },
      {
        path: "鹤草芽/030_鹤草芽植物.jpg",
        type: [1],
      },
      {
        path: "鹤草芽/050_鹤草芽.jpg",
        type: [1],
      },
      {
        path: "鹤草芽/070_鹤草芽.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "鹤虱",
    files: [
      {
        path: "鹤虱/010_天名精植物.jpg",
        type: [1],
      },
      {
        path: "鹤虱/030_天名精果序.jpg",
        type: [1],
      },
      {
        path: "鹤虱/050_鹤虱药材.jpg",
        type: [1],
      },
      {
        path: "鹤虱/070_鹤虱.jpg",
        type: [1],
      },
      {
        path: "鹤虱/090_鹤虱性状鉴别.jpg",
        type: [1],
      },
      {
        path: "鹤虱/110_鹤虱.jpg",
        type: [1],
      },
      {
        path: "鹤虱/130_南鹤虱.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "鹿茸",
    files: [
      {
        path: "鹿茸/000_补虚药_鹿茸.jpg",
        type: [1],
      },
      {
        path: "鹿茸/010_梅花鹿.jpg",
        type: [1],
      },
      {
        path: "鹿茸/030_马鹿.jpg",
        type: [1],
      },
      {
        path: "鹿茸/050_花鹿茸.jpg",
        type: [1],
      },
      {
        path: "鹿茸/070_马鹿茸.jpg",
        type: [1],
      },
      {
        path: "鹿茸/090_鹿茸片.jpg",
        type: [1],
      },
      {
        path: "鹿茸/110_鹿茸片等级划分.jpg",
        type: [1],
      },
      {
        path: "鹿茸/130_不同等级的鹿茸片.jpg",
        type: [1],
      },
      {
        path: "鹿茸/150_鹿茸粉.jpg",
        type: [1],
      },
      {
        path: "鹿茸/170_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "鹿藿",
    files: [
      {
        path: "鹿藿/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "鹿衔草",
    files: [
      {
        path: "鹿衔草/010_鹿蹄草植物.jpg",
        type: [1],
      },
      {
        path: "鹿衔草/030_普通鹿蹄草.jpg",
        type: [1],
      },
      {
        path: "鹿衔草/050_鹿衔草鲜药材.jpg",
        type: [1],
      },
      {
        path: "鹿衔草/070_鹿衔草.jpg",
        type: [1],
      },
      {
        path: "鹿衔草/090_鹿衔草.jpg",
        type: [1],
      },
      {
        path: "鹿衔草/110_鹿衔草.jpg",
        type: [1],
      },
      {
        path: "鹿衔草/130_鹿蹄草.jpg",
        type: [1],
      },
      {
        path: "鹿衔草/150_普通鹿蹄草.jpg",
        type: [1],
      },
      {
        path: "鹿衔草/170_鹿衔草性状鉴别.jpg",
        type: [1],
      },
      {
        path: "鹿衔草/190_鹿蹄草、普通鹿蹄草及伪品红花鹿蹄草原植物比较.jpg",
        type: [2],
      },
      {
        path: "鹿衔草/210_鹿蹄草、普通鹿蹄草及伪品红花鹿蹄草性状比较.jpg",
        type: [2],
      },
      {
        path: "鹿衔草/230_鹿衔草饮片.jpg",
        type: [1],
      },
      {
        path: "鹿衔草/250_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "鹿角",
    files: [
      {
        path: "鹿角/010_梅花鹿.jpg",
        type: [1],
      },
      {
        path: "鹿角/030_马鹿.jpg",
        type: [1],
      },
      {
        path: "鹿角/050_马鹿角.jpg",
        type: [1],
      },
      {
        path: "鹿角/070_马鹿角.jpg",
        type: [1],
      },
      {
        path: "鹿角/090_梅花鹿角.jpg",
        type: [1],
      },
      {
        path: "鹿角/110_梅花鹿角.jpg",
        type: [1],
      },
      {
        path: "鹿角/130_鹿角脱盘.jpg",
        type: [1],
      },
      {
        path: "鹿角/150_鹿角脱盘.jpg",
        type: [1],
      },
      {
        path: "鹿角/170_鹿角段.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "鹿角胶",
    files: [
      {
        path: "鹿角胶/010_梅花鹿.jpg",
        type: [1],
      },
      {
        path: "鹿角胶/030_马鹿.jpg",
        type: [1],
      },
      {
        path: "鹿角胶/050_鹿角.jpg",
        type: [1],
      },
      {
        path: "鹿角胶/070_鹿角胶.jpg",
        type: [1],
      },
      {
        path: "鹿角胶/090_鹿角胶.jpg",
        type: [1],
      },
      {
        path: "鹿角胶/110_鹿角胶.jpg",
        type: [1],
      },
      {
        path: "鹿角胶/130_鹿角胶.jpg",
        type: [1],
      },
      {
        path: "鹿角胶/150_鹿角胶.jpg",
        type: [1],
      },
      {
        path: "鹿角胶/170_鹿角胶.jpg",
        type: [1],
      },
      {
        path: "鹿角胶/190_鹿角胶.jpg",
        type: [1],
      },
      {
        path: "鹿角胶/210_鹿角胶.jpg",
        type: [1],
      },
      {
        path: "鹿角胶/230_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "鹿角霜",
    files: [
      {
        path: "鹿角霜/010_梅花鹿.jpg",
        type: [1],
      },
      {
        path: "鹿角霜/030_马鹿.jpg",
        type: [1],
      },
      {
        path: "鹿角霜/050_鹿角.jpg",
        type: [1],
      },
      {
        path: "鹿角霜/070_鹿角霜.jpg",
        type: [1],
      },
      {
        path: "鹿角霜/090_鹿角霜.jpg",
        type: [1],
      },
      {
        path: "鹿角霜/110_鹿角霜.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "麋脂",
    files: [
      {
        path: "麋脂/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "麝香",
    files: [
      {
        path: "麝香/000_开窍药_麝香.jpg",
        type: [1],
      },
      {
        path: "麝香/010_林麝.jpg",
        type: [1],
      },
      {
        path: "麝香/030_马麝.jpg",
        type: [1],
      },
      {
        path: "麝香/050_原麝.jpg",
        type: [1],
      },
      {
        path: "麝香/070_毛壳麝香.jpg",
        type: [1],
      },
      {
        path: "麝香/090_毛壳麝香.jpg",
        type: [1],
      },
      {
        path: "麝香/110_麝香仁.jpg",
        type: [1],
      },
      {
        path: "麝香/130_麝香药材.jpg",
        type: [1],
      },
      {
        path: "麝香/150_麝香.jpg",
        type: [1],
      },
      {
        path: "麝香/170_麝香性状鉴别.jpg",
        type: [1],
      },
      {
        path: "麝香/190_毛壳麝香.jpg",
        type: [1],
      },
      {
        path: "麝香/210_麝香仁.jpg",
        type: [1],
      },
      {
        path: "麝香/230_麝香仁.jpg",
        type: [1],
      },
      {
        path: "麝香/250_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "麦冬",
    files: [
      {
        path: "麦冬/000_补虚药_麦冬.jpg",
        type: [1],
      },
      {
        path: "麦冬/010_麦冬植物.jpg",
        type: [1],
      },
      {
        path: "麦冬/030_川麦冬药材.jpg",
        type: [1],
      },
      {
        path: "麦冬/050_浙麦冬药材.jpg",
        type: [1],
      },
      {
        path: "麦冬/070_麦冬性状鉴别.jpg",
        type: [1],
      },
      {
        path: "麦冬/090_湖北麦冬药材.jpg",
        type: [1],
      },
      {
        path: "麦冬/110_短葶山麦冬药材.jpg",
        type: [1],
      },
      {
        path: "麦冬/130_山麦冬性状鉴别.jpg",
        type: [1],
      },
      {
        path: "麦冬/150_不同地区的麦冬.jpg",
        type: [1],
      },
      {
        path: "麦冬/170_麦冬显微图.jpg",
        type: [1],
      },
      {
        path: "麦冬/190_山麦冬显微图.jpg",
        type: [1],
      },
      {
        path: "麦冬/210_土麦冬.jpg",
        type: [2],
      },
      {
        path: "麦冬/230_大麦冬.jpg",
        type: [2],
      },
      {
        path: "麦冬/250_大麦冬（未去外皮）.jpg",
        type: [2],
      },
      {
        path: "麦冬/270_竹叶麦冬.jpg",
        type: [2],
      },
      {
        path: "麦冬/290_麦冬饮片.jpg",
        type: [1],
      },
      {
        path: "麦冬/310_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "麦芽",
    files: [
      {
        path: "麦芽/010_大麦植物.jpg",
        type: [1],
      },
      {
        path: "麦芽/030_麦芽药材.jpg",
        type: [1],
      },
      {
        path: "麦芽/050_麦芽.jpg",
        type: [1],
      },
      {
        path: "麦芽/070_麦芽.jpg",
        type: [1],
      },
      {
        path: "麦芽/090_麦芽性状鉴别.jpg",
        type: [1],
      },
      {
        path: "麦芽/110_伪品：未发芽大麦.jpg",
        type: [1],
      },
      {
        path: "麦芽/130_炒麦芽.jpg",
        type: [1],
      },
      {
        path: "麦芽/150_焦麦芽.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "麻黄",
    files: [
      {
        path: "麻黄/000_收涩药_麻黄根.jpg",
        type: [1],
      },
      {
        path: "麻黄/010_草麻黄植物.jpg",
        type: [1],
      },
      {
        path: "麻黄/030_中麻黄植物.jpg",
        type: [1],
      },
      {
        path: "麻黄/050_木贼麻黄植物.jpg",
        type: [1],
      },
      {
        path: "麻黄/070_草麻黄.jpg",
        type: [1],
      },
      {
        path: "麻黄/090_草麻黄药材.jpg",
        type: [1],
      },
      {
        path: "麻黄/110_中麻黄.jpg",
        type: [1],
      },
      {
        path: "麻黄/130_中麻黄药材.jpg",
        type: [1],
      },
      {
        path: "麻黄/150_木贼麻黄.jpg",
        type: [1],
      },
      {
        path: "麻黄/170_木贼麻黄药材.jpg",
        type: [1],
      },
      {
        path: "麻黄/190_麻黄性状鉴别.jpg",
        type: [1],
      },
      {
        path: "麻黄/210_丽江麻黄.jpg",
        type: [1],
      },
      {
        path: "麻黄/230_膜果麻黄.jpg",
        type: [1],
      },
      {
        path: "麻黄/250_节节草.jpg",
        type: [1],
      },
      {
        path: "麻黄/270_麻黄段.jpg",
        type: [1],
      },
      {
        path: "麻黄/290_麻黄伪品：节节草.jpg",
        type: [1],
      },
      {
        path: "麻黄/310_麻黄伪品：问荆.jpg",
        type: [1],
      },
      {
        path: "麻黄/330_蜜麻黄饮片.jpg",
        type: [1],
      },
      {
        path: "麻黄/350_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "麻黄根",
    files: [
      {
        path: "麻黄根/010_草麻黄植物.jpg",
        type: [1],
      },
      {
        path: "麻黄根/030_中麻黄植物.jpg",
        type: [1],
      },
      {
        path: "麻黄根/050_麻黄根药材.jpg",
        type: [1],
      },
      {
        path: "麻黄根/070_麻黄根饮片.jpg",
        type: [1],
      },
      {
        path: "麻黄根/090_麻黄根.jpg",
        type: [1],
      },
      {
        path: "麻黄根/110_草麻黄根.jpg",
        type: [1],
      },
      {
        path: "麻黄根/130_草麻黄根.jpg",
        type: [1],
      },
      {
        path: "麻黄根/150_麻黄根.jpg",
        type: [1],
      },
      {
        path: "麻黄根/170_麻黄根饮片.jpg",
        type: [1],
      },
      {
        path: "麻黄根/190_麻黄根饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "黄柏",
    files: [
      {
        path: "黄柏/000_清热药_黄柏.jpg",
        type: [1],
      },
      {
        path: "黄柏/000_清热药_黄柏2.jpg",
        type: [1],
      },
      {
        path: "黄柏/010_黄皮树植物.jpg",
        type: [1],
      },
      {
        path: "黄柏/030_黄柏.jpg",
        type: [1],
      },
      {
        path: "黄柏/050_黄柏性状鉴别.jpg",
        type: [1],
      },
      {
        path: "黄柏/070_黄檗植物.jpg",
        type: [1],
      },
      {
        path: "黄柏/090_关黄柏药材.jpg",
        type: [1],
      },
      {
        path: "黄柏/110_关黄柏性状鉴别.jpg",
        type: [1],
      },
      {
        path: "黄柏/130_黄柏与关黄柏饮片比较.jpg",
        type: [1],
      },
      {
        path: "黄柏/150_黄柏栓皮薄.jpg",
        type: [1],
      },
      {
        path: "黄柏/170_关黄柏栓皮厚.jpg",
        type: [1],
      },
      {
        path: "黄柏/190_黄柏外表面.jpg",
        type: [1],
      },
      {
        path: "黄柏/210_关黄柏外表面.jpg",
        type: [1],
      },
      {
        path: "黄柏/230_黄柏表面观.jpg",
        type: [1],
      },
      {
        path: "黄柏/250_关黄柏表面观.jpg",
        type: [1],
      },
      {
        path: "黄柏/270_关黄柏.jpg",
        type: [1],
      },
      {
        path: "黄柏/290_川黄柏.jpg",
        type: [1],
      },
      {
        path: "黄柏/310_小檗皮.jpg",
        type: [2],
      },
      {
        path: "黄柏/330_番薯片.jpg",
        type: [2],
      },
      {
        path: "黄柏/350_黄柏饮片.jpg",
        type: [1],
      },
      {
        path: "黄柏/370_关黄柏饮片.jpg",
        type: [1],
      },
      {
        path: "黄柏/390_盐黄柏饮片.jpg",
        type: [1],
      },
      {
        path: "黄柏/410_盐关黄柏饮片.jpg",
        type: [1],
      },
      {
        path: "黄柏/430_黄柏炭.jpg",
        type: [1],
      },
      {
        path: "黄柏/450_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "黄环",
    files: [
      {
        path: "黄环/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "黄精",
    files: [
      {
        path: "黄精/010_滇黄精植物.jpg",
        type: [1],
      },
      {
        path: "黄精/030_黄精植物.jpg",
        type: [1],
      },
      {
        path: "黄精/050_多花黄精植物.jpg",
        type: [1],
      },
      {
        path: "黄精/070_大黄精药材.jpg",
        type: [1],
      },
      {
        path: "黄精/090_鸡头黄精药材.jpg",
        type: [1],
      },
      {
        path: "黄精/110_姜形黄精.jpg",
        type: [1],
      },
      {
        path: "黄精/130_湖北黄精.jpg",
        type: [1],
      },
      {
        path: "黄精/150_卷叶黄精.jpg",
        type: [1],
      },
      {
        path: "黄精/170_热河黄精.jpg",
        type: [1],
      },
      {
        path: "黄精/190_进口越南黄精（味苦）.jpg",
        type: [1],
      },
      {
        path: "黄精/210_黄精饮片.jpg",
        type: [1],
      },
      {
        path: "黄精/230_酒黄精饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "黄芩",
    files: [
      {
        path: "黄芩/000_清热药_黄芩.jpg",
        type: [1],
      },
      {
        path: "黄芩/000_清热药_黄芩2.jpg",
        type: [1],
      },
      {
        path: "黄芩/010_黄芩植物.jpg",
        type: [1],
      },
      {
        path: "黄芩/030_黄芩药材.jpg",
        type: [1],
      },
      {
        path: "黄芩/050_黄芩（枝芩）.jpg",
        type: [1],
      },
      {
        path: "黄芩/070_黄芩（枝芩）.jpg",
        type: [1],
      },
      {
        path: "黄芩/090_黄芩性状鉴别.jpg",
        type: [1],
      },
      {
        path: "黄芩/110_滇黄芩.jpg",
        type: [1],
      },
      {
        path: "黄芩/130_粘毛黄芩.jpg",
        type: [1],
      },
      {
        path: "黄芩/150_甘肃黄芩.jpg",
        type: [1],
      },
      {
        path: "黄芩/170_黄芩片.jpg",
        type: [1],
      },
      {
        path: "黄芩/190_酒黄芩.jpg",
        type: [1],
      },
      {
        path: "黄芩/210_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "黄芪",
    files: [
      {
        path: "黄芪/000_补虚药_黄芪.jpg",
        type: [1],
      },
      {
        path: "黄芪/000_补虚药_黄芪切片.jpg",
        type: [1],
      },
      {
        path: "黄芪/010_蒙古黄芪.jpg",
        type: [1],
      },
      {
        path: "黄芪/030_膜荚黄芪.jpg",
        type: [1],
      },
      {
        path: "黄芪/050_黄芪药材.jpg",
        type: [1],
      },
      {
        path: "黄芪/070_黄芪性状鉴别.jpg",
        type: [1],
      },
      {
        path: "黄芪/090_刺果甘草.jpg",
        type: [2],
      },
      {
        path: "黄芪/110_锦鸡儿.jpg",
        type: [2],
      },
      {
        path: "黄芪/130_锦鸡儿表面切面观.jpg",
        type: [2],
      },
      {
        path: "黄芪/150_圆叶锦葵.jpg",
        type: [2],
      },
      {
        path: "黄芪/170_紫苜蓿.jpg",
        type: [2],
      },
      {
        path: "黄芪/190_紫苜蓿断面观.jpg",
        type: [2],
      },
      {
        path: "黄芪/210_梭果黄芪.jpg",
        type: [2],
      },
      {
        path: "黄芪/230_梭果黄芪断面观.jpg",
        type: [2],
      },
      {
        path: "黄芪/250_欧蜀葵.jpg",
        type: [2],
      },
      {
        path: "黄芪/270_欧蜀葵切面观.jpg",
        type: [2],
      },
      {
        path: "黄芪/290_四川黄芪.jpg",
        type: [2],
      },
      {
        path: "黄芪/310_单蕊黄芪.jpg",
        type: [2],
      },
      {
        path: "黄芪/330_东俄洛黄芪.jpg",
        type: [2],
      },
      {
        path: "黄芪/350_多花黄芪.jpg",
        type: [2],
      },
      {
        path: "黄芪/370_金翼黄芪.jpg",
        type: [2],
      },
      {
        path: "黄芪/390_蜀葵.jpg",
        type: [2],
      },
      {
        path: "黄芪/410_蓝花棘豆.jpg",
        type: [2],
      },
      {
        path: "黄芪/430_圆片.jpg",
        type: [1],
      },
      {
        path: "黄芪/450_斜片.jpg",
        type: [1],
      },
      {
        path: "黄芪/470_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "黄芫花",
    files: [
      {
        path: "黄芫花/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "黄藤",
    files: [
      {
        path: "黄藤/010_黄藤植物.jpg",
        type: [1],
      },
      {
        path: "黄藤/030_黄藤药材.jpg",
        type: [1],
      },
      {
        path: "黄藤/050_黄藤药材.jpg",
        type: [1],
      },
      {
        path: "黄藤/070_黄藤.jpg",
        type: [1],
      },
      {
        path: "黄藤/090_黄藤、大叶藤.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "黄蜀葵花",
    files: [
      {
        path: "黄蜀葵花/010_黄蜀葵植物.jpg",
        type: [1],
      },
      {
        path: "黄蜀葵花/030_黄蜀葵花药材.jpg",
        type: [1],
      },
      {
        path: "黄蜀葵花/050_黄蜀葵花药材.jpg",
        type: [1],
      },
      {
        path: "黄蜀葵花/070_黄蜀葵花药材.jpg",
        type: [1],
      },
      {
        path: "黄蜀葵花/090_黄蜀葵花.jpg",
        type: [1],
      },
      {
        path: "黄蜀葵花/110_菜芙蓉.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "黄连",
    files: [
      {
        path: "黄连/000_清热药_黄连.jpg",
        type: [1],
      },
      {
        path: "黄连/010_黄连植物.jpg",
        type: [1],
      },
      {
        path: "黄连/030_三角叶黄连植物.jpg",
        type: [1],
      },
      {
        path: "黄连/050_云连植物.jpg",
        type: [1],
      },
      {
        path: "黄连/070_味连药材.jpg",
        type: [1],
      },
      {
        path: "黄连/090_雅连药材.jpg",
        type: [1],
      },
      {
        path: "黄连/110_云连药材.jpg",
        type: [1],
      },
      {
        path: "黄连/130_黄连性状鉴别.jpg",
        type: [1],
      },
      {
        path: "黄连/150_峨眉野连.jpg",
        type: [2],
      },
      {
        path: "黄连/170_因州黄连.jpg",
        type: [2],
      },
      {
        path: "黄连/190_土黄连.jpg",
        type: [2],
      },
      {
        path: "黄连/210_马尾连.jpg",
        type: [2],
      },
      {
        path: "黄连/230_多叶唐松草.jpg",
        type: [2],
      },
      {
        path: "黄连/250_滇豆根.jpg",
        type: [2],
      },
      {
        path: "黄连/270_滇豆根染色.jpg",
        type: [2],
      },
      {
        path: "黄连/290_鲜黄连.jpg",
        type: [2],
      },
      {
        path: "黄连/310_箭叶淫羊藿.jpg",
        type: [2],
      },
      {
        path: "黄连/330_血水草.jpg",
        type: [2],
      },
      {
        path: "黄连/350_野鸡尾.jpg",
        type: [2],
      },
      {
        path: "黄连/370_石蚕.jpg",
        type: [2],
      },
      {
        path: "黄连/390_黄连片.jpg",
        type: [1],
      },
      {
        path: "黄连/410_酒黄连饮片.jpg",
        type: [1],
      },
      {
        path: "黄连/430_姜黄连饮片.jpg",
        type: [1],
      },
      {
        path: "黄连/450_萸黄连饮片.jpg",
        type: [1],
      },
      {
        path: "黄连/470_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "黍米",
    files: [
      {
        path: "黍米/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "黑种草子",
    files: [
      {
        path: "黑种草子/010_腺毛黑种草植物.jpg",
        type: [1],
      },
      {
        path: "黑种草子/030_黑种草子.jpg",
        type: [1],
      },
      {
        path: "黑种草子/050_黑种草子.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "黑芝麻",
    files: [
      {
        path: "黑芝麻/010_脂麻植物.jpg",
        type: [1],
      },
      {
        path: "黑芝麻/030_黑芝麻.jpg",
        type: [1],
      },
      {
        path: "黑芝麻/050_黑芝麻.jpg",
        type: [1],
      },
      {
        path: "黑芝麻/070_炒黑芝麻.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "黑豆",
    files: [
      {
        path: "黑豆/010_大豆植物.jpg",
        type: [1],
      },
      {
        path: "黑豆/030_黑豆.jpg",
        type: [1],
      },
      {
        path: "黑豆/050_黑豆.jpg",
        type: [1],
      },
      {
        path: "黑豆/070_黑豆.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "鼠妇",
    files: [
      {
        path: "鼠妇/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "鼠李",
    files: [
      {
        path: "鼠李/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "鼯鼠",
    files: [
      {
        path: "鼯鼠/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "龙眼肉",
    files: [
      {
        path: "龙眼肉/010_龙眼植物.jpg",
        type: [1],
      },
      {
        path: "龙眼肉/030_龙眼肉药材.jpg",
        type: [1],
      },
      {
        path: "龙眼肉/050_龙眼肉性状鉴别.jpg",
        type: [1],
      },
      {
        path: "龙眼肉/070_荔枝肉.jpg",
        type: [1],
      },
      {
        path: "龙眼肉/090_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "龙胆",
    files: [
      {
        path: "龙胆/010_条叶龙胆.jpg",
        type: [1],
      },
      {
        path: "龙胆/030_龙胆.jpg",
        type: [1],
      },
      {
        path: "龙胆/050_三花龙胆.jpg",
        type: [1],
      },
      {
        path: "龙胆/070_坚龙胆.jpg",
        type: [1],
      },
      {
        path: "龙胆/090_龙胆药材.jpg",
        type: [1],
      },
      {
        path: "龙胆/110_龙胆药材.jpg",
        type: [1],
      },
      {
        path: "龙胆/130_坚龙胆药材.jpg",
        type: [1],
      },
      {
        path: "龙胆/150_坚龙胆药材.jpg",
        type: [1],
      },
      {
        path: "龙胆/170_龙胆性状.jpg",
        type: [1],
      },
      {
        path: "龙胆/190_龙胆饮片.jpg",
        type: [1],
      },
      {
        path: "龙胆/210_龙胆饮片.jpg",
        type: [1],
      },
      {
        path: "龙胆/230_坚龙胆药材.jpg",
        type: [1],
      },
      {
        path: "龙胆/250_坚龙胆饮片.jpg",
        type: [1],
      },
      {
        path: "龙胆/270_龙胆（条叶）.jpg",
        type: [1],
      },
      {
        path: "龙胆/290_龙胆（三花）.jpg",
        type: [1],
      },
      {
        path: "龙胆/310_坚龙胆.jpg",
        type: [1],
      },
      {
        path: "龙胆/330_龙胆性状鉴别.jpg",
        type: [1],
      },
      {
        path: "龙胆/350_鬼白.jpg",
        type: [2],
      },
      {
        path: "龙胆/370_桃儿七.jpg",
        type: [2],
      },
      {
        path: "龙胆/390_桃儿七切片.jpg",
        type: [2],
      },
      {
        path: "龙胆/410_草龙胆.jpg",
        type: [2],
      },
      {
        path: "龙胆/430_红花龙胆.jpg",
        type: [2],
      },
      {
        path: "龙胆/450_龙胆饮片.jpg",
        type: [1],
      },
      {
        path: "龙胆/470_坚龙胆饮片.jpg",
        type: [1],
      },
      {
        path: "龙胆/490_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "龙脷叶",
    files: [
      {
        path: "龙脷叶/010_龙脷叶植物.jpg",
        type: [1],
      },
      {
        path: "龙脷叶/030_龙脷叶.jpg",
        type: [1],
      },
      {
        path: "龙脷叶/050_龙脷叶.jpg",
        type: [1],
      },
      {
        path: "龙脷叶/070_龙脷叶.jpg",
        type: [1],
      },
      {
        path: "龙脷叶/090_龙脷叶.jpg",
        type: [1],
      },
      {
        path: "龙脷叶/110_龙脷叶.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "龙葵",
    files: [
      {
        path: "龙葵/010_龙葵植物.jpg",
        type: [1],
      },
      {
        path: "龙葵/030_龙葵药材.jpg",
        type: [1],
      },
      {
        path: "龙葵/050_龙葵饮片.jpg",
        type: [1],
      },
      {
        path: "龙葵/070_龙葵饮片.jpg",
        type: [1],
      },
      {
        path: "龙葵/090_龙葵饮片.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "龙须草",
    files: [
      {
        path: "龙须草/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "龙骨",
    files: [
      {
        path: "龙骨/000_安神药_龙骨.jpg",
        type: [1],
      },
      {
        path: "龙骨/010_龙骨.jpg",
        type: [1],
      },
      {
        path: "龙骨/030_五花龙骨药材.jpg",
        type: [1],
      },
      {
        path: "龙骨/050_五花龙骨.jpg",
        type: [1],
      },
      {
        path: "龙骨/070_龙骨药材.jpg",
        type: [1],
      },
      {
        path: "龙骨/090_龙骨正品，龙骨斑明显.jpg",
        type: [1],
      },
      {
        path: "龙骨/110_龙骨正品，龙骨斑明显.jpg",
        type: [1],
      },
      {
        path: "龙骨/130_龙骨正品，龙骨斑明显.jpg",
        type: [1],
      },
      {
        path: "龙骨/150_龙骨正品，火烧时受热部分颜色稍有变化，不冒烟.jpg",
        type: [1],
      },
      {
        path: "龙骨/170_龙骨伪品  烧骨头 骨松质多，没有龙骨斑.jpg",
        type: [2],
      },
      {
        path: "龙骨/190_龙骨伪品  烧骨头 骨松质骨密质部分均有.jpg",
        type: [2],
      },
      {
        path: "龙骨/210_龙骨伪品   做旧的烧骨头，土多并无龙骨斑.jpg",
        type: [2],
      },
      {
        path: "龙骨/230_龙骨伪品   疑似没烧透的骨头，质油润并无龙骨斑.jpg",
        type: [2],
      },
      {
        path: "龙骨/250_龙骨劣品    泥土没有清洗或没有洗净.jpg",
        type: [1],
      },
      {
        path: "龙骨/270_龙骨劣品   细沙浸入龙骨内部.jpg",
        type: [1],
      },
      {
        path: "龙骨/290_龙骨劣品   骨髓腔内充满大量的碳酸钙结晶.jpg",
        type: [1],
      },
      {
        path: "龙骨/310_龙骨劣品   骨骼较大，表面有龙骨斑.jpg",
        type: [1],
      },
      {
        path: "龙骨/330_龙骨劣品    骨骼内部已经完全石化.jpg",
        type: [1],
      },
      {
        path: "龙骨/350_煅龙骨.jpg",
        type: [1],
      },
      {
        path: "龙骨/370_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "龙齿",
    files: [
      {
        path: "龙齿/010_青龙齿.jpg",
        type: [1],
      },
      {
        path: "龙齿/030_白龙齿.jpg",
        type: [1],
      },
      {
        path: "龙齿/050_龙齿药材.jpg",
        type: [1],
      },
      {
        path: "龙齿/070_龙齿药材.jpg",
        type: [1],
      },
      {
        path: "龙齿/090_龙齿药材.jpg",
        type: [1],
      },
      {
        path: "龙齿/110_龙齿药材.jpg",
        type: [1],
      },
      {
        path: "龙齿/130_龙齿药材.jpg",
        type: [1],
      },
      {
        path: "龙齿/150_龙齿伪品，现代动物牙齿加工伪制，有煅裂痕，质地酥脆.jpg",
        type: [1],
      },
      {
        path: "龙齿/170_龙齿伪品：狗牙骨.jpg",
        type: [1],
      },
      {
        path: "龙齿/190_龙齿伪品.jpg",
        type: [1],
      },
      {
        path: "龙齿/210_龙齿伪品：牛牙伪制品.jpg",
        type: [1],
      },
      {
        path: "龙齿/230_煅龙齿.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "龟甲",
    files: [
      {
        path: "龟甲/000_补虚药_龟甲.jpg",
        type: [1],
      },
      {
        path: "龟甲/000_补虚药_龟甲2.jpg",
        type: [1],
      },
      {
        path: "龟甲/010_乌龟.jpg",
        type: [1],
      },
      {
        path: "龟甲/030_背甲药材.jpg",
        type: [1],
      },
      {
        path: "龟甲/050_龟板药材.jpg",
        type: [1],
      },
      {
        path: "龟甲/070_背甲.jpg",
        type: [1],
      },
      {
        path: "龟甲/090_龟板.jpg",
        type: [1],
      },
      {
        path: "龟甲/110_龟甲背甲正面观（盾片）.jpg",
        type: [1],
      },
      {
        path: "龟甲/130_龟甲背甲骨板正面观.jpg",
        type: [1],
      },
      {
        path: "龟甲/150_龟甲.jpg",
        type: [1],
      },
      {
        path: "龟甲/170_龟甲性状鉴别.jpg",
        type: [1],
      },
      {
        path: "龟甲/190_龟板与马来闭壳龟.jpg",
        type: [1],
      },
      {
        path: "龟甲/210_缅甸陆龟、黄喉拟水龟.jpg",
        type: [1],
      },
      {
        path: "龟甲/230_巴西龟（巴西红耳龟）.jpg",
        type: [1],
      },
      {
        path: "龟甲/250_伪品：缅甸陆龟背甲.jpg",
        type: [1],
      },
      {
        path: "龟甲/270_缅甸陆龟腹甲.jpg",
        type: [1],
      },
      {
        path: "龟甲/290_伪品：凹甲陆龟背面.jpg",
        type: [1],
      },
      {
        path: "龟甲/310_伪品：凹甲陆龟腹甲.jpg",
        type: [1],
      },
      {
        path: "龟甲/330_黄缘闭壳龟背甲.jpg",
        type: [1],
      },
      {
        path: "龟甲/350_黄缘闭壳龟腹甲.jpg",
        type: [1],
      },
      {
        path: "龟甲/370_背甲.jpg",
        type: [1],
      },
      {
        path: "龟甲/390_腹甲.jpg",
        type: [1],
      },
      {
        path: "龟甲/410_醋龟甲（背甲）.jpg",
        type: [1],
      },
      {
        path: "龟甲/430_醋龟甲（腹甲）.jpg",
        type: [1],
      },
      {
        path: "龟甲/450_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "龟甲胶",
    files: [
      {
        path: "龟甲胶/010_乌龟.jpg",
        type: [1],
      },
      {
        path: "龟甲胶/030_背甲药材.jpg",
        type: [1],
      },
      {
        path: "龟甲胶/050_龟板药材.jpg",
        type: [1],
      },
      {
        path: "龟甲胶/070_龟甲胶.jpg",
        type: [1],
      },
      {
        path: "龟甲胶/090_龟甲胶.jpg",
        type: [1],
      },
      {
        path: "龟甲胶/110_龟甲胶.jpg",
        type: [1],
      },
    ],
  },
  {
    dir: "𬶍鱼甲",
    files: [
      {
        path: "𬶍鱼甲/010_倪注神农本草经.jpg",
        type: [1],
      },
    ],
  },
];

function find_genuine_paths(names) {
  // 查找正品路径
  // 使用 Fisher-Yates 洗牌算法
  const shuffled = [...names];
  for (let i = shuffled.length - 1; i > 0; i--) {
    const j = Math.floor(Math.random() * (i + 1));
    [shuffled[i], shuffled[j]] = [shuffled[j], shuffled[i]];
  }

  // 查找匹配的路径并按 path 排序
  return shuffled
    .flatMap((name) =>
      source_file_paths
        .filter((path) => path.dir === name)
        .flatMap((path) =>
          path.files
            .filter((file) => file.type?.includes(1))
            .map((file) => file.path)
        )
    )
    .sort(); // 按照 path 字符串升序排序
}

function find_paths(names) {
  // 查找全部路径
  // 使用 Fisher-Yates 洗牌算法
  const shuffled = [...names];
  for (let i = shuffled.length - 1; i > 0; i--) {
    const j = Math.floor(Math.random() * (i + 1));
    [shuffled[i], shuffled[j]] = [shuffled[j], shuffled[i]];
  }

  // 查找匹配的路径并按 path 排序
  return shuffled
    .flatMap((name) =>
      source_file_paths
        .filter((path) => path.dir === name)
        .flatMap((path) => path.files.map((file) => file.path))
    )
    .sort(); // 按照 path 字符串升序排序
}

function random_one_dir() {
  // 生成 [0, source_file_paths.length) 范围内的随机整数
  const index = Math.floor(Math.random() * source_file_paths.length);
  // 返回对应的 dir 属性
  return source_file_paths[index].dir;
}
