// 倪海厦-神农本草经药名
const nihaixia_slbcj_ym = [
  ["丹砂"],
  ["云母"],
  ["玉泉"],
  ["石钟乳"],
  ["涅石"],
  ["消石"],
  ["朴消"],
  ["滑石"],
  ["石胆（又名胆矾）"],
  ["空青"],
  ["曾青"],
  ["禹余粮"],
  ["太一余粮"],
  ["白石英"],
  ["紫石英"],
  ["青石赤石黄石白石黑石脂等"],
  ["白青"],
  ["扁青"],
  ["昌蒲"],
  ["鞠华"],
  ["人参"],
  ["天门冬"],
  ["甘草"],
  ["干地黄"],
  ["白术"],
  ["菟丝子"],
  ["牛膝"],
  ["充蔚子"],
  ["女萎"],
  ["防葵"],
  ["茈胡"],
  ["麦门冬"],
  ["独活"],
  ["车前子"],
  ["木香"],
  ["署豫"],
  ["薏苡仁"],
  ["泽泻"],
  ["远志"],
  ["龙胆"],
  ["细辛"],
  ["石斛"],
  ["巴戟天"],
  ["白英"],
  ["白蒿"],
  ["赤箭"],
  ["奄闾子"],
  ["析蓂子"],
  ["蓍实"],
  ["赤芝黑芝青芝白芝黄芝紫芝"],
  ["卷柏"],
  ["蓝实"],
  ["芎穷"],
  ["蘼芜"],
  ["黄连"],
  ["络石"],
  ["蒺藜子"],
  ["黄耆"],
  ["肉松容"],
  ["防风"],
  ["蒲黄"],
  ["香蒲"],
  ["续断"],
  ["漏芦"],
  ["营实"],
  ["天名精"],
  ["决明子"],
  ["丹参"],
  ["茜根"],
  ["飞廉"],
  ["五味子"],
  ["旋华"],
  ["兰草"],
  ["蛇床子"],
  ["地肤子"],
  ["景天"],
  ["茵陈"],
  ["杜若"],
  ["沙参"],
  ["白兔藿"],
  ["徐长卿"],
  ["石龙刍"],
  ["薇衔"],
  ["云实"],
  ["王不留行"],
  ["升麻"],
  ["青蘘"],
  ["姑活"],
  ["别羁"],
  ["屈草"],
  ["淮木"],
  ["牡桂"],
  ["菌桂"],
  ["松脂"],
  ["槐实"],
  ["枸杞"],
  ["柏实"],
  ["茯苓"],
  ["榆皮"],
  ["酸枣"],
  ["檗木"],
  ["干漆"],
  ["五加皮"],
  ["蔓荆实"],
  ["辛夷"],
  ["桑上寄生"],
  ["杜仲"],
  ["女贞实"],
  ["木兰"],
  ["蕤核"],
  ["橘柚"],
  ["发髲"],
  ["龙骨"],
  ["麝香"],
  ["牛黄"],
  ["熊脂"],
  ["白胶"],
  ["阿胶"],
  ["丹雄鸡"],
  ["雁肪"],
  ["石蜜"],
  ["蜂子，蜂蜜，蜂蜡"],
  ["蜜蜡"],
  ["牡蛎"],
  ["龟甲"],
  ["桑蜱蛸"],
  ["海蛤"],
  ["文蛤"],
  ["蠡鱼"],
  ["鲤鱼胆"],
  ["藕实茎"],
  ["大枣"],
  ["蒲萄"],
  ["蓬蘽"],
  ["鸡头实"],
  ["胡麻"],
  ["麻蕡"],
  ["冬葵子"],
  ["苋实"],
  ["瓜蒂"],
  ["白瓜子"],
  ["苦菜"],
  ["雄黄"],
  ["石硫黄"],
  ["雌黄"],
  ["水银"],
  ["石膏"],
  ["慈石"],
  ["凝水石"],
  ["阳起石"],
  ["孔公孽"],
  ["殷孽"],
  ["铁精"],
  ["理石"],
  ["长石"],
  ["肤青"],
  ["干姜"],
  ["枲耳实"],
  ["葛根"],
  ["瓜篓根"],
  ["苦参"],
  ["当归"],
  ["麻黄"],
  ["通草"],
  ["芍药"],
  ["蠡实"],
  ["瞿麦"],
  ["玄参"],
  ["秦艽"],
  ["百合"],
  ["知母"],
  ["贝母"],
  ["白芷"],
  ["淫羊藿"],
  ["黄芩"],
  ["狗脊"],
  ["石龙芮"],
  ["茅根"],
  ["紫苑"],
  ["紫草"],
  ["败酱"],
  ["白鲜皮"],
  ["酸浆"],
  ["紫参"],
  ["槀本"],
  ["石苇"],
  ["萆薢"],
  ["白薇"],
  ["水萍"],
  ["王瓜"],
  ["地榆"],
  ["海藻"],
  ["泽兰"],
  ["防己"],
  ["款冬花"],
  ["牡丹"],
  ["马先蒿"],
  ["积雪草"],
  ["女菀"],
  ["王孙"],
  ["蜀羊泉"],
  ["爵床"],
  ["假苏"],
  ["翘根"],
  ["桑根白皮"],
  ["竹叶"],
  ["吴茱萸"],
  ["栀子"],
  ["芜荑"],
  ["枳实"],
  ["厚朴"],
  ["秦皮"],
  ["秦椒"],
  ["山茱萸"],
  ["紫葳"],
  ["猪苓"],
  ["白棘"],
  ["龙眼"],
  ["松萝"],
  ["卫矛"],
  ["合欢"],
  ["白马茎"],
  ["鹿茸"],
  ["牛角鳃"],
  ["羖羊角"],
  ["牡狗阴茎"],
  ["羚羊角"],
  ["犀角"],
  ["燕屎"],
  ["天鼠屎"],
  ["猬皮"],
  ["露蜂房"],
  ["鳖甲"],
  ["蟹"],
  ["蚱蝉"],
  ["蛴螬"],
  ["乌贼鱼骨"],
  ["白僵蚕"],
  ["鮀鱼甲"],
  ["樗鸡"],
  ["蛞蝓"],
  ["石龙子"],
  ["木虻"],
  ["蜚虻"],
  ["蜚蠊"],
  ["蟅虫"],
  ["伏翼"],
  ["梅实"],
  ["大豆黄卷"],
  ["粟米"],
  ["黍米"],
  ["蓼实"],
  ["葱实"],
  ["水苏"],
  ["石灰"],
  ["礜石"],
  ["铅丹"],
  ["粉钖"],
  ["代赭"],
  ["卤咸"],
  ["白垩"],
  ["冬灰"],
  ["青琅玕"],
  ["附子"],
  ["乌头"],
  ["天雄"],
  ["半夏"],
  ["虎掌"],
  ["鸢尾"],
  ["大黄"],
  ["葶苈"],
  ["桔梗"],
  ["莨菪子"],
  ["草蒿"],
  ["旋复花"],
  ["藜芦"],
  ["钩吻"],
  ["射干"],
  ["蛇含"],
  ["恒山"],
  ["蜀漆"],
  ["甘遂"],
  ["白敛"],
  ["青葙子"],
  ["雚菌"],
  ["白及"],
  ["大戟"],
  ["泽漆"],
  ["茵芋"],
  ["贯众"],
  ["荛花"],
  ["牙子"],
  ["羊踯躅"],
  ["商陆"],
  ["羊蹄"],
  ["萹蓄"],
  ["狼毒"],
  ["白头翁"],
  ["鬼臼"],
  ["羊桃"],
  ["女青"],
  ["连翘"],
  ["蔺茹"],
  ["乌韭"],
  ["鹿藿"],
  ["蚤休"],
  ["石长生"],
  ["陆英"],
  ["盖草"],
  ["牛扁"],
  ["夏枯草"],
  ["芫花"],
  ["巴豆"],
  ["蜀椒"],
  ["皂荚"],
  ["柳花"],
  ["楝实"],
  ["郁李仁"],
  ["莽草"],
  ["雷丸"],
  ["桐叶"],
  ["梓白皮"],
  ["古南"],
  ["黄环"],
  ["溲疏"],
  ["鼠李"],
  ["药实根"],
  ["栾花"],
  ["蔓椒"],
  ["豚卵"],
  ["麋脂"],
  ["（鼯）鼠"],
  ["六畜毛蹄甲"],
  ["虾蟆"],
  ["马刀"],
  ["蛇蜕"],
  ["白颈蚯蚓"],
  ["翳螉"],
  ["蜈蚣"],
  ["水蛭"],
  ["斑蟊（猫）"],
  ["贝子"],
  ["石蚕"],
  ["雀瓮"],
  ["蜣螂"],
  ["蝼蛄"],
  ["马陆"],
  ["地胆"],
  ["鼠妇"],
  ["萤火"],
  ["衣鱼"],
  ["桃核仁"],
  ["杏核仁"],
  ["腐婢"],
  ["苦瓠"],
  ["水斳"],
  ["彼子"],
  ["青盐"],
  ["诃黎勒（诃子）"],
  ["红花"],
  ["蜘蛛"],
  ["赤小豆"],
  ["艾叶"],
  ["紫苏"],
  ["饴糖"],
  ["柏叶（侧柏叶）"],
  ["豆豉"],
  ["鸡矢白"],
  ["蒴翟细叶"],
  ["没药"],
  ["乳香"],
  ["白芷"],
  ["粳米"],
  ["甘李根白皮"],
  ["三七"],
  ["鸡子黄"],
  ["猪肤"],
  ["郁金"],
  ["木通"],
  ["新绛"],
  ["薤白"],
  ["白前"],
  ["神曲"],
  ["小麦"],
  ["灶心土"],
];

// 倪海厦-神农本草经药名-在知乎的医药原始中的检索名称，有扩展
// bookes 表示：0 不区别，1 伤寒论，2 金匮，
const nihaixia_slbcj_ym_ext = [
  {
    name: ["朱砂", "丹砂"],
    books: [0],
  },
  {
    name: ["云母"],
    books: [0],
  },
  {
    name: ["玉泉"],
    books: [0],
  },
  {
    name: ["石钟乳"],
    books: [0],
  },
  {
    name: ["矾石", "白矾", "涅石"],
    books: [0],
  },
  {
    name: ["芒消", "硝石", "消石"],
    books: [0],
  },
  {
    name: ["朴硝", "芒硝", "朴消"],
    books: [1],
  },
  {
    name: ["滑石"],
    books: [1],
  },
  {
    name: ["胆矾", "石胆", "石胆（又名胆矾）"],
    books: [0],
  },
  {
    name: ["空青"],
    books: [0],
  },
  {
    name: ["曾青"],
    books: [0],
  },
  {
    name: ["禹余粮"],
    books: [1],
  },
  {
    name: ["太乙余粮", "太一余粮"],
    books: [0],
  },
  {
    name: ["白石英"],
    books: [0],
  },
  {
    name: ["紫石英"],
    books: [0],
  },
  {
    name: ["青石赤石黄石白石黑石脂等"],
    books: [0],
  },
  {
    name: ["赤石脂", "上面五色石中的一个"],
    books: [1],
  },
  {
    name: ["白青"],
    books: [0],
  },
  {
    name: ["扁青"],
    books: [0],
  },
  {
    name: ["菖蒲", "昌蒲"],
    books: [0],
  },
  {
    name: ["九节菖蒲", "扩展的，但这个才是真正用的"],
    books: [0],
  },
  {
    name: ["石菖蒲", "扩展的，这个也可以用"],
    books: [0],
  },
  {
    name: ["菊花", "鞠华"],
    books: [0],
  },
  {
    name: ["野菊花"],
    books: [0],
  },
  {
    name: ["人参"],
    books: [1],
  },
  {
    name: ["天冬", "天门冬"],
    books: [1],
  },
  {
    name: ["甘草"],
    books: [1],
  },
  {
    name: ["地黄", "干地黄"],
    books: [1],
  },
  {
    name: ["山精", "白术"],
    books: [1],
  },
  {
    name: ["菟丝子"],
    books: [0],
  },
  {
    name: ["牛膝"],
    books: [0],
  },
  {
    name: ["川牛膝", "这个才是真正用的"],
    books: [0],
  },
  {
    name: ["益母草", "充蔚子"],
    books: [0],
  },
  {
    name: ["玉竹", "女萎"],
    books: [0],
  },
  {
    name: ["防葵"],
    books: [0],
  },
  {
    name: ["柴胡", "茈胡"],
    books: [1],
  },
  {
    name: ["麦冬", "麦门冬"],
    books: [1],
  },
  {
    name: ["姜活", "独活", "姜活是独活种在西昌"],
    books: [0],
  },
  {
    name: ["当道", "车前子"],
    books: [0],
  },
  {
    name: ["车前草"],
    books: [0],
  },
  {
    name: ["木香", "木香生于两广"],
    books: [0],
  },
  {
    name: ["山药", "淮山药", "署豫"],
    books: [0],
  },
  {
    name: ["薏仁", "解蠡", "薏苡仁"],
    books: [0],
  },
  {
    name: ["泽泻"],
    books: [1],
  },
  {
    name: ["远志"],
    books: [0],
  },
  {
    name: ["龙胆"],
    books: [0],
  },
  {
    name: ["龙胆草", "扩展的"],
    books: [0],
  },
  {
    name: ["细辛"],
    books: [1],
  },
  {
    name: ["石斛"],
    books: [0],
  },
  {
    name: ["巴戟天"],
    books: [0],
  },
  {
    name: ["白英"],
    books: [0],
  },
  {
    name: ["白蒿"],
    books: [0],
  },
  {
    name: ["天麻", "赤箭"],
    books: [0],
  },
  {
    name: ["奄闾子"],
    books: [0],
  },
  {
    name: ["析蓂子"],
    books: [0],
  },
  {
    name: ["蓍实"],
    books: [0],
  },
  {
    name: ["蓍草", "扩展的"],
    books: [0],
  },
  {
    name: ["灵芝", "赤芝黑芝青芝白芝黄芝紫芝", "灵芝加紫芝为六色芝"],
    books: [0],
  },
  {
    name: ["万岁", "卷柏"],
    books: [0],
  },
  {
    name: ["青黛", "蓝实"],
    books: [0],
  },
  {
    name: ["川芎", "芎穷"],
    books: [0],
  },
  {
    name: ["蘼芜", "川芎的苗"],
    books: [0],
  },
  {
    name: ["黄连"],
    books: [1],
  },
  {
    name: ["络石藤", "石龙藤", "络石"],
    books: [0],
  },
  {
    name: ["蒺藜", "蒺藜子"],
    books: [0],
  },
  {
    name: ["黄芪", "黄耆"],
    books: [0],
  },
  {
    name: ["肉苁蓉", "肉菘蓉", "肉松容"],
    books: [0],
  },
  {
    name: ["防风"],
    books: [0],
  },
  {
    name: ["蒲黄"],
    books: [0],
  },
  {
    name: ["香蒲"],
    books: [0],
  },
  {
    name: ["续断"],
    books: [0],
  },
  {
    name: ["漏芦禹州漏芦", "漏芦"],
    books: [0],
  },
  {
    name: ["蔷薇", "营实"],
    books: [0],
  },
  {
    name: ["天名精"],
    books: [0],
  },
  {
    name: ["决明子"],
    books: [0],
  },
  {
    name: ["丹参"],
    books: [0],
  },
  {
    name: ["茜草", "茜根"],
    books: [0],
  },
  {
    name: ["飞廉"],
    books: [0],
  },
  {
    name: ["五味子"],
    books: [1],
  },
  {
    name: ["旋覆花", "旋华"],
    books: [0],
  },
  {
    name: ["佩兰", "兰草"],
    books: [0],
  },
  {
    name: ["泽兰", "扩展的"],
    books: [0],
  },
  {
    name: ["落帚", "蛇床子"],
    books: [0],
  },
  {
    name: ["地肤子"],
    books: [0],
  },
  {
    name: ["景天"],
    books: [0],
  },
  {
    name: ["茵陈蒿", "茵陈"],
    books: [1],
  },
  {
    name: ["杜衡", "杜若"],
    books: [0],
  },
  {
    name: ["沙参"],
    books: [0],
  },
  {
    name: ["南沙参", "扩展的"],
    books: [0],
  },
  {
    name: ["北沙参", "扩展的"],
    books: [0],
  },
  {
    name: ["白兔藿"],
    books: [0],
  },
  {
    name: ["徐长卿"],
    books: [0],
  },
  {
    name: ["龙须草", "石龙刍"],
    books: [0],
  },
  {
    name: ["鹿衔草", "薇衔"],
    books: [0],
  },
  {
    name: ["云实"],
    books: [0],
  },
  {
    name: ["王不留行"],
    books: [0],
  },
  {
    name: ["升麻"],
    books: [1],
  },
  {
    name: ["胡麻", "巨胜子", "青蘘"],
    books: [0],
  },
  {
    name: ["冬葵", "冬葵子", "姑活"],
    books: [0],
  },
  {
    name: ["冬葵果", "扩展的"],
    books: [0],
  },
  {
    name: ["别羁"],
    books: [0],
  },
  {
    name: ["屈草"],
    books: [0],
  },
  {
    name: ["淮木"],
    books: [0],
  },
  {
    name: ["桂枝", "大桂", "牡桂"],
    books: [1],
  },
  {
    name: ["桂皮", "牡桂的皮", "扩展的"],
    books: [0],
  },
  {
    name: ["肉桂", "小桂", "菌桂", "肉桂是皮", "扩展的"],
    books: [1],
  },
  {
    name: ["松脂"],
    books: [0],
  },
  {
    name: ["槐实"],
    books: [0],
  },
  {
    name: ["枸杞子", "枸杞"],
    books: [0],
  },
  {
    name: ["柏子仁", "柏实"],
    books: [0],
  },
  {
    name: ["茯苓"],
    books: [1],
  },
  {
    name: ["茯苓皮", "扩展的"],
    books: [1],
  },
  {
    name: ["榆白皮", "榆皮"],
    books: [0],
  },
  {
    name: ["酸枣仁", "酸枣"],
    books: [0],
  },
  {
    name: ["黄柏", "檗木"],
    books: [1],
  },
  {
    name: ["干漆"],
    books: [0],
  },
  {
    name: ["五加皮"],
    books: [0],
  },
  {
    name: ["蔓荆子", "蔓荆实"],
    books: [0],
  },
  {
    name: ["辛夷花", "辛夷"],
    books: [0],
  },
  {
    name: ["桑寄生", "桑上寄生"],
    books: [0],
  },
  {
    name: ["杜仲"],
    books: [0],
  },
  {
    name: ["女贞子", "女贞实"],
    books: [0],
  },
  {
    name: ["木兰"],
    books: [0],
  },
  {
    name: ["蕤仁", "蕤核"],
    books: [0],
  },
  {
    name: ["陈皮", "橘柚"],
    books: [0],
  },
  {
    name: ["血余炭", "发髲"],
    books: [0],
  },
  {
    name: ["龙骨"],
    books: [1],
  },
  {
    name: ["麝香"],
    books: [0],
  },
  {
    name: ["牛黄"],
    books: [0],
  },
  {
    name: ["熊脂"],
    books: [0],
  },
  {
    name: ["鹿角胶", "白胶"],
    books: [0],
  },
  {
    name: ["阿胶"],
    books: [1],
  },
  {
    name: ["丹雄鸡"],
    books: [0],
  },
  {
    name: ["鸡内金", "扩展的"],
    books: [0],
  },
  {
    name: ["鸭脂", "野鸭脂肪", "雁肪"],
    books: [0],
  },
  {
    name: ["冰糖", "石蜜"],
    books: [0],
  },
  {
    name: ["蜂子，蜂蜜，蜂蜡"],
    books: [0],
  },
  {
    name: ["蜂蜜", "扩展的"],
    books: [0],
  },
  {
    name: ["蜜蜡", "琥珀的一种"],
    books: [0],
  },
  {
    name: ["牡蛎"],
    books: [1],
  },
  {
    name: ["龟甲"],
    books: [0],
  },
  {
    name: ["桑螵蛸", "桑蜱蛸", "螳螂的幼虫"],
    books: [0],
  },
  {
    name: ["蛤蜊", "海蛤", "海蛤一片片的"],
    books: [0],
  },
  {
    name: ["蛤壳", "文蛤", "文蛤整个的"],
    books: [1],
  },
  {
    name: ["鲤鱼", "蠡鱼"],
    books: [0],
  },
  {
    name: ["鲤鱼胆"],
    books: [0],
  },
  {
    name: ["莲子", "藕实茎"],
    books: [0],
  },
  {
    name: ["大枣"],
    books: [1],
  },
  {
    name: ["葡萄", "蒲萄"],
    books: [0],
  },
  {
    name: ["覆盆子", "蓬蘽"],
    books: [0],
  },
  {
    name: ["芡实", "鸡头实"],
    books: [0],
  },
  {
    name: ["胡麻"],
    books: [0],
  },
  {
    name: ["火麻仁", "麻子仁", "麻蕡", "大麻的子"],
    books: [1],
  },
  {
    name: ["冬葵子", "也是上面的姑活"],
    books: [0],
  },
  {
    name: ["苋实"],
    books: [0],
  },
  {
    name: ["瓜蒂", "甜的瓜的蒂"],
    books: [1],
  },
  {
    name: ["冬瓜子", "白瓜子"],
    books: [0],
  },
  {
    name: ["苦菜"],
    books: [0],
  },
  {
    name: ["雄黄"],
    books: [0],
  },
  {
    name: ["硫黄", "石硫黄"],
    books: [0],
  },
  {
    name: ["雌黄"],
    books: [0],
  },
  {
    name: ["水银"],
    books: [0],
  },
  {
    name: ["石膏"],
    books: [1],
  },
  {
    name: ["磁石", "慈石"],
    books: [0],
  },
  {
    name: ["寒水石", "凝水石"],
    books: [0],
  },
  {
    name: ["阳起石"],
    books: [0],
  },
  {
    name: ["孔公孽"],
    books: [0],
  },
  {
    name: ["殷孽"],
    books: [0],
  },
  {
    name: ["铁落", "铁精", "打铁残渣"],
    books: [0],
  },
  {
    name: ["理石"],
    books: [0],
  },
  {
    name: ["长石"],
    books: [0],
  },
  {
    name: ["肤青"],
    books: [0],
  },
  {
    name: ["干姜"],
    books: [1],
  },
  {
    name: ["生姜", "扩展的"],
    books: [1],
  },
  {
    name: ["姜皮", "扩展的"],
    books: [1],
  },
  {
    name: ["姜黄", "扩展的"],
    books: [1],
  },
  {
    name: ["枲耳实"],
    books: [0],
  },
  {
    name: ["葛根"],
    books: [1],
  },
  {
    name: ["天花粉", "瓜篓根"],
    books: [1],
  },
  {
    name: ["瓜蒌", "栝蒌", "扩展的"],
    books: [1],
  },
  {
    name: ["苦参"],
    books: [0],
  },
  {
    name: ["当归"],
    books: [1],
  },
  {
    name: ["麻黄"],
    books: [1],
  },
  {
    name: ["通草"],
    books: [1],
  },
  {
    name: ["白芍", "芍药"],
    books: [1],
  },
  {
    name: ["马蔺子", "蠡实"],
    books: [0],
  },
  {
    name: ["瞿麦"],
    books: [0],
  },
  {
    name: ["黑参", "玄参"],
    books: [0],
  },
  {
    name: ["秦瓜", "秦艽"],
    books: [0],
  },
  {
    name: ["百合"],
    books: [0],
  },
  {
    name: ["知母"],
    books: [1],
  },
  {
    name: ["川贝母", "贝母"],
    books: [1],
  },
  {
    name: ["白芷"],
    books: [0],
  },
  {
    name: ["淫羊藿"],
    books: [0],
  },
  {
    name: ["黄芩"],
    books: [1],
  },
  {
    name: ["狗脊"],
    books: [0],
  },
  {
    name: ["石龙芮"],
    books: [0],
  },
  {
    name: ["白茅根", "茅根"],
    books: [0],
  },
  {
    name: ["紫苑"],
    books: [0],
  },
  {
    name: ["紫草"],
    books: [0],
  },
  {
    name: ["败酱"],
    books: [0],
  },
  {
    name: ["白鲜皮"],
    books: [0],
  },
  {
    name: ["锦灯笼", "灯笼草", "洛神珠", "酸浆"],
    books: [0],
  },
  {
    name: ["紫参"],
    books: [0],
  },
  {
    name: ["鬼卿", "槀本"],
    books: [0],
  },
  {
    name: ["石苇"],
    books: [0],
  },
  {
    name: ["粉、绵萆薢", "萆薢"],
    books: [0],
  },
  {
    name: ["白薇"],
    books: [0],
  },
  {
    name: ["浮萍", "水萍"],
    books: [0],
  },
  {
    name: ["土瓜", "王瓜"],
    books: [0],
  },
  {
    name: ["地榆"],
    books: [0],
  },
  {
    name: ["海藻"],
    books: [0],
  },
  {
    name: ["泽兰"],
    books: [0],
  },
  {
    name: ["防己", "下面两个都可以用"],
    books: [0],
  },
  {
    name: ["汉防己", "扩展的"],
    books: [0],
  },
  {
    name: ["木防己", "扩展的"],
    books: [0],
  },
  {
    name: ["款冬花"],
    books: [0],
  },
  {
    name: ["牡丹皮", "牡丹"],
    books: [0],
  },
  {
    name: ["马先蒿"],
    books: [0],
  },
  {
    name: ["积雪草"],
    books: [0],
  },
  {
    name: ["女菀"],
    books: [0],
  },
  {
    name: ["王孙"],
    books: [0],
  },
  {
    name: ["羊泉", "蜀羊泉"],
    books: [0],
  },
  {
    name: ["香苏", "爵床"],
    books: [0],
  },
  {
    name: ["荆芥", "假苏"],
    books: [0],
  },
  {
    name: ["翘根"],
    books: [0],
  },
  {
    name: ["桑白皮", "桑根白皮"],
    books: [0],
  },
  {
    name: ["淡竹叶", "竹叶"],
    books: [0],
  },
  {
    name: ["吴茱萸"],
    books: [1],
  },
  {
    name: ["栀子"],
    books: [1],
  },
  {
    name: ["芜荑"],
    books: [0],
  },
  {
    name: ["枳实"],
    books: [1],
  },
  {
    name: ["枳壳", "扩展的"],
    books: [0],
  },
  {
    name: ["厚朴"],
    books: [1],
  },
  {
    name: ["秦皮"],
    books: [1],
  },
  {
    name: ["秦椒", "类似花椒"],
    books: [0],
  },
  {
    name: ["山茱萸"],
    books: [0],
  },
  {
    name: ["凌霄花", "紫葳"],
    books: [0],
  },
  {
    name: ["猪苓"],
    books: [1],
  },
  {
    name: ["白棘"],
    books: [0],
  },
  {
    name: ["龙眼肉", "龙眼"],
    books: [0],
  },
  {
    name: ["老君须与松萝", "松萝"],
    books: [0],
  },
  {
    name: ["鬼箭羽", "卫矛"],
    books: [0],
  },
  {
    name: ["合欢皮", "合欢"],
    books: [0],
  },
  {
    name: ["合欢花", "扩展的"],
    books: [0],
  },
  {
    name: ["白马茎"],
    books: [0],
  },
  {
    name: ["鹿茸"],
    books: [0],
  },
  {
    name: ["牛角鳃"],
    books: [0],
  },
  {
    name: ["黑羊角", "羖羊角"],
    books: [0],
  },
  {
    name: ["牡狗阴茎"],
    books: [0],
  },
  {
    name: ["羚羊角"],
    books: [0],
  },
  {
    name: ["犀角"],
    books: [0],
  },
  {
    name: ["燕屎"],
    books: [0],
  },
  {
    name: ["蝙蝠屎", "伏翼屎", "天鼠屎"],
    books: [0],
  },
  {
    name: ["刺猬皮", "猬皮"],
    books: [0],
  },
  {
    name: ["蜂房", "露蜂房"],
    books: [0],
  },
  {
    name: ["鳖甲"],
    books: [0],
  },
  {
    name: ["螃蟹", "蟹"],
    books: [0],
  },
  {
    name: ["蝉蜕", "蚱蝉"],
    books: [0],
  },
  {
    name: ["蛴螬"],
    books: [0],
  },
  {
    name: ["乌贼鱼骨"],
    books: [0],
  },
  {
    name: ["僵蚕", "白僵蚕"],
    books: [0],
  },
  {
    name: ["𬶍鱼甲", "鮀鱼甲"],
    books: [0],
  },
  {
    name: ["樗鸡"],
    books: [0],
  },
  {
    name: ["鼻涕虫", "蛞蝓"],
    books: [0],
  },
  {
    name: ["蜥蜴", "石龙子"],
    books: [0],
  },
  {
    name: ["木虻"],
    books: [0],
  },
  {
    name: ["虻虫", "牛虻", "蜚虻", "虻虫用的牛虻"],
    books: [1],
  },
  {
    name: ["蟑螂", "蜚蠊"],
    books: [0],
  },
  {
    name: ["土鳖虫", "地鳖虫", "地鳖", "蟅虫"],
    books: [0],
  },
  {
    name: ["夜明砂", "伏翼", "蝙蝠的大便"],
    books: [0],
  },
  {
    name: ["乌梅", "梅实", "乌梅与白梅，但常用乌梅"],
    books: [1],
  },
  {
    name: ["大豆黄卷", "取黑大豆制"],
    books: [0],
  },
  {
    name: ["粟米", "取黑粟米"],
    books: [0],
  },
  {
    name: ["黍米", "取红黍米"],
    books: [0],
  },
  {
    name: ["蓼实"],
    books: [0],
  },
  {
    name: ["葱实"],
    books: [0],
  },
  {
    name: ["葱白", "扩展的"],
    books: [1],
  },
  {
    name: ["水苏"],
    books: [0],
  },
  {
    name: ["石灰"],
    books: [0],
  },
  {
    name: ["青分石", "固羊石", "礜石"],
    books: [0],
  },
  {
    name: ["铅丹"],
    books: [1],
  },
  {
    name: ["粉钖"],
    books: [0],
  },
  {
    name: ["赭石", "代赭石", "代赭"],
    books: [1],
  },
  {
    name: ["卤咸", "海盐与青盐"],
    books: [0],
  },
  {
    name: ["大青盐", "扩展的"],
    books: [0],
  },
  {
    name: ["白土", "白垩"],
    books: [0],
  },
  {
    name: ["藜灰", "冬灰"],
    books: [0],
  },
  {
    name: ["石珠", "青琅玕"],
    books: [0],
  },
  {
    name: ["附子"],
    books: [1],
  },
  {
    name: ["川乌", "乌头"],
    books: [0],
  },
  {
    name: ["天雄"],
    books: [0],
  },
  {
    name: ["半夏"],
    books: [1],
  },
  {
    name: ["天南星", "虎掌", "不是老虎的掌"],
    books: [0],
  },
  {
    name: ["射干", "鸢尾"],
    books: [0],
  },
  {
    name: ["大黄"],
    books: [1],
  },
  {
    name: ["葶苈子", "葶苈"],
    books: [1],
  },
  {
    name: ["桔梗"],
    books: [1],
  },
  {
    name: ["莨菪", "莨菪子"],
    books: [0],
  },
  {
    name: ["青蒿", "草蒿"],
    books: [0],
  },
  {
    name: ["旋覆花", "旋复花"],
    books: [1],
  },
  {
    name: ["藜芦"],
    books: [0],
  },
  {
    name: ["野葛", "钩吻"],
    books: [0],
  },
  {
    name: ["射干"],
    books: [0],
  },
  {
    name: ["蛇衔", "蛇含"],
    books: [0],
  },
  {
    name: ["恒山"],
    books: [0],
  },
  {
    name: ["常山苗", "蜀漆", "常山的苗，并非是树漆"],
    books: [1],
  },
  {
    name: ["常山", "扩展的"],
    books: [1],
  },
  {
    name: ["甘遂"],
    books: [1],
  },
  {
    name: ["白敛"],
    books: [0],
  },
  {
    name: ["草决明", "青葙子", "与决明子相似"],
    books: [0],
  },
  {
    name: ["雚菌"],
    books: [0],
  },
  {
    name: ["白芨", "白及"],
    books: [0],
  },
  {
    name: ["红大戟", "大戟", "应该是红大戟，而非京大戟"],
    books: [1],
  },
  {
    name: ["泽漆", "大戟苗"],
    books: [0],
  },
  {
    name: ["茵芋"],
    books: [0],
  },
  {
    name: ["贯众", "不知是哪种，但与大黄很像"],
    books: [0],
  },
  {
    name: ["绵马贯众", "扩展的"],
    books: [0],
  },
  {
    name: ["紫萁贯众", "扩展的"],
    books: [0],
  },
  {
    name: ["黄芫花", "荛花"],
    books: [0],
  },
  {
    name: ["狼牙", "牙子"],
    books: [0],
  },
  {
    name: ["羊踯躅"],
    books: [0],
  },
  {
    name: ["商陆", "白商陆根"],
    books: [0],
  },
  {
    name: ["羊蹄草", "羊蹄"],
    books: [0],
  },
  {
    name: ["萹蓄"],
    books: [0],
  },
  {
    name: ["狼毒"],
    books: [0],
  },
  {
    name: ["白头翁"],
    books: [1],
  },
  {
    name: ["鬼臼"],
    books: [0],
  },
  {
    name: ["羊桃"],
    books: [0],
  },
  {
    name: ["女青"],
    books: [0],
  },
  {
    name: ["连翘"],
    books: [1],
  },
  {
    name: ["蔺茹"],
    books: [0],
  },
  {
    name: ["乌韭"],
    books: [0],
  },
  {
    name: ["鹿藿"],
    books: [0],
  },
  {
    name: ["蚤休"],
    books: [0],
  },
  {
    name: ["石长生"],
    books: [0],
  },
  {
    name: ["陆英"],
    books: [0],
  },
  {
    name: ["盖草"],
    books: [0],
  },
  {
    name: ["牛扁"],
    books: [0],
  },
  {
    name: ["夏枯草"],
    books: [0],
  },
  {
    name: ["芫花"],
    books: [1],
  },
  {
    name: ["巴豆"],
    books: [1],
  },
  {
    name: ["花椒", "蜀椒", "取开口的"],
    books: [1],
  },
  {
    name: ["皂荚"],
    books: [0],
  },
  {
    name: ["大皂角", "扩展的"],
    books: [0],
  },
  {
    name: ["皂角刺", "扩展的"],
    books: [0],
  },
  {
    name: ["柳絮", "柳花"],
    books: [0],
  },
  {
    name: ["苦楝子", "川楝子", "金铃子", "楝实"],
    books: [0],
  },
  {
    name: ["郁李仁"],
    books: [0],
  },
  {
    name: ["莽草"],
    books: [0],
  },
  {
    name: ["雷丸"],
    books: [0],
  },
  {
    name: ["桐叶"],
    books: [0],
  },
  {
    name: ["生梓白皮", "梓白皮"],
    books: [1],
  },
  {
    name: ["古南"],
    books: [0],
  },
  {
    name: ["黄环"],
    books: [0],
  },
  {
    name: ["溲疏"],
    books: [0],
  },
  {
    name: ["鼠李"],
    books: [0],
  },
  {
    name: ["药实根"],
    books: [0],
  },
  {
    name: ["栾花"],
    books: [0],
  },
  {
    name: ["蔓椒"],
    books: [0],
  },
  {
    name: ["豚卵"],
    books: [0],
  },
  {
    name: ["麋脂"],
    books: [0],
  },
  {
    name: ["鼯鼠", "（鼯）鼠"],
    books: [0],
  },
  {
    name: ["六畜毛蹄甲"],
    books: [0],
  },
  {
    name: ["蛤蟆", "虾蟆"],
    books: [0],
  },
  {
    name: ["马刀"],
    books: [0],
  },
  {
    name: ["蛇蜕"],
    books: [0],
  },
  {
    name: ["地龙", "白颈蚯蚓"],
    books: [0],
  },
  {
    name: ["翳螉"],
    books: [0],
  },
  {
    name: ["蜈蚣"],
    books: [0],
  },
  {
    name: ["水蛭"],
    books: [1],
  },
  {
    name: ["斑蝥", "斑蟊（猫）"],
    books: [0],
  },
  {
    name: ["贝齿", "贝子"],
    books: [0],
  },
  {
    name: ["石蚕"],
    books: [0],
  },
  {
    name: ["蝉蜕", "雀瓮", "就是蝉蜕，前面有，此药重复"],
    books: [0],
  },
  {
    name: ["蜣螂"],
    books: [0],
  },
  {
    name: ["蝼蛄"],
    books: [0],
  },
  {
    name: ["马陆"],
    books: [0],
  },
  {
    name: ["地胆"],
    books: [0],
  },
  {
    name: ["鼠妇"],
    books: [0],
  },
  {
    name: ["萤火"],
    books: [0],
  },
  {
    name: ["白鱼", "衣鱼", "常指白鲤鱼"],
    books: [0],
  },
  {
    name: ["桃仁", "桃核仁"],
    books: [1],
  },
  {
    name: ["苦杏仁", "杏仁", "杏核仁"],
    books: [1],
  },
  {
    name: ["腐婢"],
    books: [0],
  },
  {
    name: ["苦瓠", "苦瓠非苦瓜"],
    books: [0],
  },
  {
    name: ["水靳", "芹菜", "水斳"],
    books: [0],
  },
  {
    name: ["彼子"],
    books: [0],
  },
  {
    name: ["大青盐", "青盐"],
    books: [0],
  },
  {
    name: ["诃子", "诃黎勒（诃子）"],
    books: [0],
  },
  {
    name: ["红花", "川红花便宜，故现常用"],
    books: [0],
  },
  {
    name: ["川红花", "扩展的"],
    books: [0],
  },
  {
    name: ["藏红花", "扩展的"],
    books: [0],
  },
  {
    name: ["蜘蛛", "取大腹，深灰色"],
    books: [0],
  },
  {
    name: ["赤小豆"],
    books: [1],
  },
  {
    name: ["艾叶"],
    books: [0],
  },
  {
    name: ["紫苏梗", "紫苏叶", "紫苏"],
    books: [0],
  },
  {
    name: ["麦芽糖", "胶饴", "饴糖"],
    books: [1],
  },
  {
    name: ["侧柏叶", "柏叶（侧柏叶）"],
    books: [0],
  },
  {
    name: ["淡豆豉", "香豉", "豆豉", "黑豆做的"],
    books: [1],
  },
  {
    name: ["鸡矢白"],
    books: [0],
  },
  {
    name: ["蒴翟细叶"],
    books: [0],
  },
  {
    name: ["没药"],
    books: [0],
  },
  {
    name: ["乳香"],
    books: [0],
  },
  {
    name: ["白芷", "与前面重复"],
    books: [0],
  },
  {
    name: ["粳米"],
    books: [1],
  },
  {
    name: ["李根白皮", "甘李根白皮", "李树之根"],
    books: [0],
  },
  {
    name: ["三七"],
    books: [0],
  },
  {
    name: ["鸡子黄"],
    books: [1],
  },
  {
    name: ["猪肤"],
    books: [0],
  },
  {
    name: "猪胆",
    books: [null],
  },
  {
    name: ["木通", "古名通草，但与上面的通草不是一个"],
    books: [0],
  },
  {
    name: ["川木通", "扩展的"],
    books: [0],
  },
  {
    name: ["新绛"],
    books: [0],
  },
  {
    name: ["薤白"],
    books: [0],
  },
  {
    name: ["白前"],
    books: [0],
  },
  {
    name: ["神曲"],
    books: [0],
  },
  {
    name: ["小麦"],
    books: [0],
  },
  {
    name: ["伏龙肝", "灶心土"],
    books: [0],
  },
];

function random_exclude_nihaixia_shl_ym_ext() {
  arr = nihaixia_slbcj_ym_ext
    .filter((x) => !x["books"].includes(1))
    .map((x) => x["name"]);
  return arr[Math.floor(Math.random() * arr.length)];
}

function random_only_nihaixia_shl_ym_ext() {
  arr = nihaixia_slbcj_ym_ext
    .filter((x) => x["books"].includes(1))
    .map((x) => x["name"]);
  return arr[Math.floor(Math.random() * arr.length)];
}

function random_only_nihaixia_jk_ym_ext() {
  arr = nihaixia_slbcj_ym_ext
    .filter((x) => x["books"].includes(2))
    .map((x) => x["name"]);
  return arr[Math.floor(Math.random() * arr.length)];
}

function random_nihaixia_shl_and_jk_ym_ext() {
  arr = nihaixia_slbcj_ym_ext
    .filter((x) => x["books"].includes(1) || x["books"].includes(2))
    .map((x) => x["name"]);
  return arr[Math.floor(Math.random() * arr.length)];
}

function random_all_nihaixia_slbcj_ym_ext() {
  return nihaixia_slbcj_ym_ext[
    Math.floor(Math.random() * nihaixia_slbcj_ym_ext.length)
  ]["name"];
}
